[
  {
    "id": 1,
    "book": "كتاب الإيمان",
    "bab": "باب سؤال جبريل النبي ﷺ عن الإيمان والإسلام والإحسان",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ كَانَ يَوْمًا بَارِزًا لِلنَّاسِ إِذْ أَتَاهُ رَجُلٌ يَمْشِي، فَقَالَ: يَا رَسُولَ اللهِ، مَا الإِيمَانُ؟ قَالَ: «الإِيمَانُ أَنْ تُؤْمِنَ بِاللهِ، وَمَلائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَلِقَائِهِ، وَتُؤْمِنَ بِالْبَعْثِ الآخِرِ». قَالَ: يَا رَسُولَ اللهِ، مَا الإِسْلامُ؟ قَالَ: «الإِسْلامُ أَنْ تَعْبُدَ اللهَ وَلا تُشْرِكَ بِهِ شَيْئًا، وَتُقِيمَ الصَّلاةَ، وَتُؤْتِيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ». قَالَ: يَا رَسُولَ اللهِ، مَا الإِحْسَانُ؟ قَالَ: «الإِحْسَانُ أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ». قَالَ: يَا رَسُولَ اللهِ، مَتَى السَّاعَةُ؟ قَالَ: «مَا الْمَسْؤُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَلَكِنْ سَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا: إِذَا وَلَدَتِ الْمَرْأَةُ [رَبَّتَهَا] - وَفِي رِوَايَةٍ: رَبَّهَا - فَذَاكَ مِنْ أَشْرَاطِهَا، وَإِذَا كَانَ الْحُفَاةُ الْعُرَاةُ رُؤُوسَ النَّاسِ - وَفِي رِوَايَةٍ: إِذَا تَطَاوَلَ رُعَاةُ (الإِبِلِ الْبُهْمِ) فِي الْبُنْيَانِ. وَفِي رِوَايَةٍ (مُعَلَّقَةٍ): رِعَاءُ الْبَهْمِ - فَذَاكَ مِنْ أَشْرَاطِهَا، فِي خَمْسٍ لا يَعْلَمُهُنَّ إِلا اللهُ: ﴿إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الأَرْحَامِ﴾. ثُمَّ انْصَرَفَ الرَّجُلُ، فَقَالَ: رُدُّوا عَلَيَّ. فَأَخَذُوا لِيَرُدُّوا فَلَمْ يَرَوْا شَيْئًا، فَقَالَ: هَذَا جِبْرِيلُ جَاءَ لِيُعَلِّمَ النَّاسَ دِينَهُمْ».<br>وَفِي رِوَايَةٍ: لَا تَقُومُ السَّاعَةُ حَتَّى يَتَطَاوَلَ النَّاسُ فِي الْبُنْيَانِ.<br>● (وَفِي حَدِيثِ ابْنِ عُمَرَ رَضْيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ النَّبِيُّ ﷺ مَفَاتِيحُ الْغَيْبِ خَمْسٌ. ثُمَّ قَرَأَ: ﴿إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ﴾)."
  },
  {
    "id": 2,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: مَا الإِيمَانُ؟",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -، قَالَ: إِنَّ وَفْدَ عَبْدِ الْقَيْسِ أَتَوُا النَّبِيَّ ﷺ، فَقَالَ: «مَنِ الْوَفْدُ؟» قَالُوا: رَبِيعَةُ. فَقَالَ: «مَرْحَبًا بِالْوَفْدِ غَيْرَ خَزَايَا وَلا نَدَامَى». قَالُوا: إِنَّا نَأْتِيكَ مِنْ شُقَّةٍ بَعِيدَةٍ، وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَيُّ مِنْ كُفَّارِ مُضَرَ، وَلا نَسْتَطِيعُ أَنْ نَأْتِيَكَ إِلا فِي شَهْرٍ حَرَامٍ، فَمُرْنَا بِأَمْرٍ نُخْبِرْ بِهِ مَنْ وَرَاءَنَا، نَدْخُلْ بِهِ الْجَنَّةَ. - وَفِي رِوَايَةٍ: وَسَأَلُوهُ عَنِ الأَشْرِبَةِ - فَأَمَرَهُمْ بِأَرْبَعٍ، وَنَهَاهُمْ عَنْ أَرْبَعٍ: أَمَرَهُمْ بِالإِيمَانِ بِاللهِ عَزَّ وَجَلَّ وَحْدَهُ، قَالَ: «هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللهِ وَحْدَهُ؟» قَالُوا: اللهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «شَهَادَةُ أَنْ لا إِلَهَ إِلا اللهُ - وَفِي رِوَايَةٍ: وَحْدَهُ لا شَرِيكَ لَهُ - وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامُ الصَّلاةِ، وَإِيتَاءُ الزَّكَاةِ، وَصَوْمُ رَمَضَانَ، وَتُعْطُوا الْخُمُسَ مِنَ الْمَغْنَمِ. وَنَهَاهُمْ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ، قَالَ: «احْفَظُوهُ وَأَخْبِرُوهُ مَنْ وَرَاءَكُمْ».<br>(وَفِي رِوَايَةٍ: إِنَّ أَوَّلَ جُمُعَةٍ جُمِّعَتْ - بَعْدَ جُمُعَةٍ فِي مَسْجِدِ رَسُولِ اللهِ ﷺ - فِي مَسْجِدِ عَبْدِ الْقَيْسِ بِجُوَاثَى مِنَ الْبَحْرَيْنِ).<br>● (وَفِي حَدِيثِ جَابِرٍ رَضِيَ اللهُ عَنْهُ قَالَ: نَهَى رَسُولُ اللهِ ﷺ عَنِ الظُّرُوفِ، فَقَالَتِ الأَنْصَارُ: إِنَّهُ لَا بُدَّ لَنَا مِنْهَا! قَالَ: فَلَا إِذًا)."
  },
  {
    "id": 3,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: إِذَا قَالَ الْمُشْرِكُ عِنْدَ الْمَوْتِ: لا إِلَهَ إِلا اللهُ",
    "text": "عَنِ الْمُسَيَّبِ - رضي الله عنه -: أَنَّ أَبَا طَالِبٍ لَمَّا حَضَرَتْهُ الْوَفَاةُ دَخَلَ عَلَيْهِ النَّبِيُّ ﷺ وَعِنْدَهُ أَبُو جَهْلٍ، فَقَالَ: «أَيْ عَمِّ! قُلْ لا إِلَهَ إِلا اللهُ، كَلِمَةً أُحَاجُّ - وَفِي رِوَايَةٍ: أَشْهَدُ - لَكَ بِهَا عِنْدَ اللهِ». فَقَالَ أَبُو جَهْلٍ وَعَبْدُ اللهِ بْنُ أَبِي أُمَيَّةَ: يَا أَبَا طَالِبٍ! تَرْغَبُ عَنْ مِلَّةِ عَبْدِ الْمُطَّلِبِ؟ فَلَمْ يَزَالا يُكَلِّمَانِهِ حَتَّى قَالَ آخِرَ شَيْءٍ كَلَّمَهُمْ بِهِ: عَلَى مِلَّةِ عَبْدِ الْمُطَّلِبِ. - وَفِي رِوَايَةٍ: وَأَبَى أَنْ يَقُولَ: لا إِلَهَ إِلا اللهُ -، فَقَالَ النَّبِيُّ ﷺ: «لأَسْتَغْفِرَنَّ لَكَ مَا لَمْ أُنْهَ عَنْهُ». فَنَزَلَتْ: ﴿مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَنْ يَسْتَغْفِرُوا لِلْمُشْرِكِينَ وَلَوْ كَانُوا أُولِي قُرْبَى مِنْ بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ﴾، وَنَزَلَتْ: ﴿إِنَّكَ لا تَهْدِي مَنْ أَحْبَبْتَ﴾."
  },
  {
    "id": 4,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا: لا إِلَهَ إِلا اللهُ",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، قَالَ: لَمَّا تُوُفِّيَ رَسُولُ اللهِ ﷺ، وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ، وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ، قَالَ عُمَرُ لأَبِي بَكْرٍ: كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللهِ ﷺ: «أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا: لا إِلَهَ إِلا اللهُ، فَمَنْ قَالَ: لا إِلَهَ إِلا اللهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلا بِحَقِّهِ، وَحِسَابُهُ عَلَى اللهِ»?! فَقَالَ: وَاللهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاةِ وَالزَّكَاةِ؛ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ، وَاللهِ لَوْ مَنَعُونِي عِقَالاً (وَفِي رِوَايَةٍ: عَنَاقًا) كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللهِ ﷺ لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ. فَقَالَ عُمَرُ: فَوَاللهِ مَا هُوَ إِلا أَنْ رَأَيْتُ اللهَ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ.<br>● وَفِي حَدِيثِ ابْنِ عُمَرَ - رضي الله عنهما -: أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لا إِلَهَ إِلا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَيُقِيمُوا الصَّلاةَ، وَيُؤْتُوا الزَّكَاةَ...<br>● (وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -:) أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا: لا إِلَهَ إِلا اللهُ؛ فَإِذَا قَالُوهَا، (وَصَلَّوْا صَلاتَنَا، وَاسْتَقْبَلُوا قِبْلَتَنَا، وَذَبَحُوا ذَبِيحَتَنَا..) (وَفِي رِوَايَةٍ: فَذَلِكَ الْمُسْلِمُ الَّذِي لَهُ ذِمَّةُ اللهِ وَذِمَّةُ رَسُولِهِ، فَلا تَخْفِرُوا اللهَ فِي ذِمَّتِهِ)."
  },
  {
    "id": 5,
    "book": "كتاب الإيمان",
    "bab": "باب عِصْمَةِ دَمِ مَنْ قَالَ: لا إِلَهَ إِلا اللهُ",
    "text": "عَنِ الْمِقْدَادِ - رضي الله عنه -، قَالَ: يَا رَسُولَ اللهِ! إِنْ لَقِيتُ كَافِرًا فَاقْتَتَلْنَا، فَضَرَبَ يَدِي بِالسَّيْفِ فَقَطَعَهَا، ثُمَّ لاذَ مِنِّي بِشَجَرَةٍ، وَقَالَ: أَسْلَمْتُ لِلَّهِ، أَأَقْتُلُهُ بَعْدَ أَنْ قَالَهَا؟ قَالَ رَسُولُ اللهِ ﷺ: «لا تَقْتُلْهُ». قَالَ: يَا رَسُولَ اللهِ! فَإِنَّهُ طَرَحَ إِحْدَى يَدَيَّ، ثُمَّ قَالَ ذَلِكَ بَعْدَ مَا قَطَعَهَا، أَأَقْتُلُهُ؟ قَالَ: «لا تَقْتُلْهُ؛ فَإِنْ قَتَلْتَهُ فَإِنَّهُ بِمَنْزِلَتِكَ قَبْلَ أَنْ تَقْتُلَهُ، وَأَنْتَ بِمَنْزِلَتِهِ قَبْلَ أَنْ يَقُولَ كَلِمَتَهُ الَّتِي قَالَ».<br>● (وَفِي حَدِيثِ ابْنِ عَبَّاسٍ - رضي الله عنهما - مُعَلَّقًا قَالَ: قَالَ النَّبِيُّ ﷺ لِلْمِقْدَادِ: إِذَا كَانَ رَجُلٌ مُؤْمِنٌ يُخْفِي إِيمَانَهُ مَعَ قَوْمٍ كُفَّارٍ فَأَظْهَرَ إِيمَانَهُ فَقَتَلْتَهُ! فَكَذَلِكَ كُنْتَ أَنْتَ تُخْفِي إِيمَانَكَ بِمَكَّةَ مِنْ قَبْلُ)."
  },
  {
    "id": 6,
    "book": "كتاب الإيمان",
    "bab": "باب عِصْمَةِ دَمِ مَنْ قَالَ: لا إِلَهَ إِلا اللهُ",
    "text": "عَنْ أُسَامَةَ بْنِ زَيْدٍ - رضي الله عنهما -، قَالَ: بَعَثَنَا رَسُولُ اللهِ ﷺ إِلَى الْحُرَقَةِ مِنْ جُهَيْنَةَ، قَالَ: فَصَبَّحْنَا الْقَوْمَ فَهَزَمْنَاهُمْ، وَلَحِقْتُ أَنَا وَرَجُلٌ مِنَ الأَنْصَارِ رَجُلاً مِنْهُمْ، فَلَمَّا غَشِينَاهُ قَالَ: لا إِلَهَ إِلا اللهُ. فَكَفَّ عَنْهُ الأَنْصَارِيُّ، فَطَعَنْتُهُ بِرُمْحِي حَتَّى قَتَلْتُهُ، فَلَمَّا قَدِمْنَا بَلَغَ ذَلِكَ النَّبِيَّ ﷺ، فَقَالَ لِي: «يَا أُسَامَةُ! أَقَتَلْتَهُ بَعْدَ مَا قَالَ: لا إِلَهَ إِلا اللهُ؟» قُلْتُ: يَا رَسُولَ اللهِ، إِنَّمَا كَانَ مُتَعَوِّذًا. قَالَ: «أَقَتَلْتَهُ بَعْدَ مَا قَالَ: لا إِلَهَ إِلا اللهُ؟» فَمَا زَالَ يُكَرِّرُهَا عَلَيَّ حَتَّى تَمَنَّيْتُ أَنِّي لَمْ أَكُنْ أَسْلَمْتُ قَبْلَ ذَلِكَ الْيَوْمِ.<br>● (وَفِي حَدِيثِ ابْنِ عُمَرَ - رضي الله عنهما -: أَتَاهُ رَجُلانِ فِي فِتْنَةِ ابْنِ الزُّبَيْرِ، فَقَالا: إِنَّ النَّاسَ صَنَعُوا، وَأَنْتَ ابْنُ عُمَرَ وَصَاحِبُ النَّبِيِّ ﷺ، فَمَا يَمْنَعُكَ أَنْ تَخْرُجَ؟ فَقَالَ: يَمْنَعُنِي أَنَّ اللهَ حَرَّمَ دَمَ أَخِي. [فَقَالا: أَلَمْ يَقُلِ اللهُ: ﴿وَقَاتِلُوهُمْ حَتَّى لا تَكُونَ فِتْنَةٌ﴾؟ فَقَالَ: قَاتَلْنَا حَتَّى لَمْ تَكُنْ فِتْنَةٌ، وَكَانَ الدِّينُ لِلَّهِ، وَأَنْتُمْ تُرِيدُونَ أَنْ تُقَاتِلُوا حَتَّى تَكُونَ فِتْنَةٌ،] وَيَكُونَ الدِّينُ لِغَيْرِ اللهِ).<br>(وَفِي رِوَايَةٍ: يَا ابْنَ أَخِي! أَغْتَرُّ بِهَذِهِ الآيَةِ وَلا أُقَاتِلُ، أَحَبُّ إِلَيَّ مِنْ أَنْ أَغْتَرَّ بِهَذِهِ الآيَةِ الَّتِي يَقُولُ اللهُ تَعَالَى: ﴿وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا﴾ إِلَى آخِرِهَا.)<br>(وَفِي رِوَايَةٍ: أَنَّ رَجُلاً أَتَى ابْنَ عُمَرَ، فَقَالَ: يَا أَبَا عَبْدِ الرَّحْمَنِ! أَلا تَسْمَعُ مَا ذَكَرَ اللهُ فِي كِتَابِهِ: ﴿وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا فَإِنْ بَغَتْ إِحْدَاهُمَا عَلَى الأُخْرَى فَقَاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِيءَ إِلَى أَمْرِ اللهِ﴾، ﴿وَقَاتِلُوهُمْ حَتَّى لا تَكُونَ فِتْنَةٌ﴾؟ قَالَ: فَعَلْنَا عَلَى عَهْدِ رَسُولِ اللهِ ﷺ، وَكَانَ الإِسْلامُ قَلِيلاً، فَكَانَ الرَّجُلُ يُفْتَنُ فِي دِينِهِ، إِمَّا قَتَلُوهُ، وَإِمَّا يُعَذِّبُونَهُ، حَتَّى كَثُرَ الإِسْلامُ فَلَمْ تَكُنْ فِتْنَةٌ)."
  },
  {
    "id": 7,
    "book": "كتاب الإيمان",
    "bab": "باب خصال الإيمان وثواب ذلك",
    "text": "عَنْ أَبِي أَيُّوبَ - رضي الله عنه -: أَنَّ رَجُلاً قَالَ: يَا رَسُولَ اللهِ! أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ. (فَقَالَ الْقَوْمُ: مَا لَهُ، مَا لَهُ؟ فَقَالَ رَسُولُ اللهِ ﷺ: أَرَبٌ مَا لَهُ). فَقَالَ النَّبِيُّ ﷺ: «تَعْبُدُ اللهَ لا تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصِلُ الرَّحِمَ».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: وَتَصُومُ رَمَضَانَ. قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ لا أَزِيدُ عَلَى هَذَا. فَلَمَّا وَلَّى قَالَ النَّبِيُّ ﷺ: «مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا»."
  },
  {
    "id": 8,
    "book": "كتاب الإيمان",
    "bab": "باب خصال الإيمان وثواب ذلك",
    "text": "عَنْ عُبَادَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «مَنْ شَهِدَ أَنْ لا إِلَهَ إِلا اللهُ، وَحْدَهُ لا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَأَنَّ عِيسَى عَبْدُ اللهِ وَرَسُولُهُ، وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ، وَالْجَنَّةَ حَقٌّ، وَالنَّارَ حَقٌّ؛ أَدْخَلَهُ اللهُ الْجَنَّةَ عَلَى مَا كَانَ مِنَ الْعَمَلِ. وَفِي رِوَايَةٍ: مِنْ أَبْوَابِ الْجَنَّةِ الثَّمَانِيَةِ أَيَّهَا شَاءَ."
  },
  {
    "id": 9,
    "book": "كتاب الإيمان",
    "bab": "باب قول النبي ﷺ: «أَشْهَدُ أَنْ لا إِلَهَ إِلا اللهُ، وَأَنِّي رَسُولُ اللهِ»",
    "text": "عَنْ سَلَمَةَ - رضي الله عنه -، قَالَ: خَفَّتْ أُزَوَادُ الْقَوْمَ وَأَمْلَقُوا، فَأَتَوْا النَّبِيَّ ﷺ فِي نَحْرِ إِبِلِهِمْ، فَأَذِنَ لَهُمْ، فَلَقِيَهُمْ عُمَرُ فَأَخْبَرُوهُ، فَقَالَ: مَا بَقَاؤُكُمْ بَعْدَ إِبِلِكُمْ؟ فَدَخَلَ عَلَى النَّبِيِّ ﷺ، فَقَالَ: يَا رَسُولَ اللهِ! مَا بَقَاؤُهُمْ بَعْدَ إِبِلِهِمْ؟ فَقَالَ رَسُولُ اللهِ ﷺ: «نَادِ فِي النَّاسِ فَيَأْتُونَ بِفَضْلِ أَزْوَادِهِمْ». فَبُسِطَ لِذَلِكَ نِطَعٌ، وَجَعَلُوهُ عَلَى النِّطَعِ، فَقَامَ رَسُولُ اللهِ ﷺ، فَدَعَا وَبَرَّكَ عَلَيْهِ، ثُمَّ دَعَاهُمْ بِأَوْعِيَتِهِمْ، فَاحْتَثَى النَّاسُ حَتَّى فَرَغُوا، ثُمَّ قَالَ رَسُولُ اللهِ ﷺ: «أَشْهَدُ أَنْ لا إِلَهَ إِلا اللهُ، وَأَنِّي رَسُولُ اللهِ»."
  },
  {
    "id": 10,
    "book": "كتاب الإيمان",
    "bab": "باب ما جاء في دعاء النبي ﷺ أمته إلى توحيد الله تبارك وتعالى",
    "text": "عَنْ مُعَاذٍ - رضي الله عنه -، قَالَ: بَيْنَا أَنَا رَدِيفُ النَّبِيِّ ﷺ - وَفِي رِوَايَةٍ: عَلَى حِمَارٍ يُقَالُ لَهُ: عُفَيْرٌ - لَيْسَ بَيْنِي وَبَيْنَهُ إِلا آخِرَةُ الرَّحْلِ، فَقَالَ: «يَا مُعَاذٌ بْنَ جَبَلٍ!» قُلْتُ: لَبَّيْكَ رَسُولَ اللهِ وَسَعْدَيْكَ. ثُمَّ سَارَ سَاعَةً، ثُمَّ قَالَ: «يَا مُعَاذُ!» قُلْتُ: لَبَّيْكَ رَسُولَ اللهِ وَسَعْدَيْكَ. ثُمَّ سَارَ سَاعَةً، ثُمَّ قَالَ: «يَا مُعَاذُ!» قُلْتُ: لَبَّيْكَ رَسُولَ اللهِ وَسَعْدَيْكَ. فَقَالَ: «هَلْ تَدْرِي مَا حَقُّ اللهِ عَلَى عِبَادِهِ؟» قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «حَقُّ اللهِ عَلَى عِبَادِهِ أَنْ يَعْبُدُوهُ وَلا يُشْرِكُوا بِهِ شَيْئًا». ثُمَّ سَارَ سَاعَةً، ثُمَّ قَالَ: «يَا مُعَاذٌ بْنَ جَبَلٍ!» قُلْتُ: لَبَّيْكَ رَسُولَ اللهِ وَسَعْدَيْكَ. فَقَالَ: «هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللهِ إِذَا فَعَلُوهُ؟» قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «حَقُّ الْعِبَادِ عَلَى اللهِ أَنْ لا يُعَذِّبَهُمْ». وَفِي رِوَايَةٍ: فَقُلْتُ: يَا رَسُولَ اللهِ، أَفَلا أُبَشِّرُ بِهِ النَّاسَ؟ قَالَ: «لا تُبَشِّرْهُمْ فَيَتَّكِلُوا».<br>● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: أَنَّ النَّبِيَّ ﷺ وَمُعَاذٌ رَدِيفُهُ عَلَى الرَّحْلِ قَالَ: يَا مُعَاذٌ بْنَ جَبَلٍ! قُلْتُ: لَبَّيْكَ يَا رَسُولَ اللهِ وَسَعْدَيْكَ. قَالَ: «يَا مُعَاذُ!» قَالَ: لَبَّيْكَ يَا رَسُولَ اللهِ وَسَعْدَيْكَ. - ثَلاثًا - قَالَ: «مَا مِنْ أَحَدٍ يَشْهَدُ أَنْ لا إِلَهَ إِلا اللهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ (صِدْقًا مِنْ قَلْبِهِ) إِلا حَرَّمَهُ اللهُ عَلَى النَّارِ (وَفِي رِوَايَةٍ: مَنْ لَقِيَ اللهَ لا يُشْرِكُ بِهِ شَيْئًا دَخَلَ الْجَنَّةَ). قَالَ: يَا رَسُولَ اللهِ! أَفَلا أُخْبِرُ بِهِ النَّاسَ فَيَسْتَبْشِرُوا؟ قَالَ: إِذًا يَتَّكِلُوا. وَأَخْبَرَ بِهَا مُعَاذٌ عِنْدَ مَوْتِهِ تَأَثُّمًا."
  },
  {
    "id": 11,
    "book": "كتاب الإيمان",
    "bab": "باب العمل الذي يبتغى به وجه الله",
    "text": "عَنِ ابْنِ شِهَابٍ، قَالَ: أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ الأَنْصَارِيُّ - رضي الله عنه -: أَنَّهُ عَقَلَ رَسُولَ اللهِ ﷺ، وَعَقَلَ مَجَّةً مَجَّهَا فِي وَجْهِهِ مِنْ بِئْرٍ كَانَتْ فِي دَارِهِمْ (وَفِي رِوَايَةٍ: وَهُوَ ابْنُ خَمْسِ سِنِينَ)، فَزَعَمَ مَحْمُودٌ أَنَّهُ سَمِعَ عِتْبَانَ بْنَ مَالِكٍ الأَنْصَارِيَّ - رضي الله عنه - وَكَانَ مِمَّنْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللهِ ﷺ - يَقُولُ: كُنْتُ أُصَلِّي لِقَوْمِي بِبَنِي سَالِمٍ، وَكَانَ يَحُولُ بَيْنِي وَبَيْنَهُمْ وَادٍ إِذَا جَاءَتِ الأَمْطَارُ، فَيَشُقُّ عَلَيَّ اجْتِيَازُهُ قِبَلَ مَسْجِدِهِمْ، فَجِئْتُ رَسُولَ اللهِ ﷺ، فَقُلْتُ لَهُ: إِنِّي أَنْكَرْتُ بَصَرِي، وَإِنَّ الْوَادِيَ الَّذِي بَيْنِي وَبَيْنَ قَوْمِي يَسِيلُ إِذَا جَاءَتِ الأَمْطَارُ، فَيَشُقُّ عَلَيَّ اجْتِيَازُهُ (وَفِي رِوَايَةٍ: إِنَّهَا تَكُونُ الظُّلْمَةُ)، فَوَدِدْتُ أَنَّكَ تَأْتِي، فَتُصَلِّيَ مِنْ بَيْتِي مَكَانًا أَتَّخِذُهُ مُصَلًّى. فَقَالَ رَسُولُ اللهِ ﷺ: «سَأَفْعَلُ» - وَفِي رِوَايَةٍ: إِنْ شَاءَ اللهُ -. فَغَدَا عَلَيَّ رَسُولُ اللهِ ﷺ وَأَبُو بَكْرٍ - رضي الله عنه - بَعْدَ مَا اشْتَدَّ النَّهَارُ، فَاسْتَأْذَنَ رَسُولُ اللهِ ﷺ، فَأَذِنْتُ لَهُ، فَلَمْ يَجْلِسْ حَتَّى قَالَ: «أَيْنَ تُحِبُّ أَنْ أُصَلِّيَ مِنْ بَيْتِكَ؟» فَأَشَرْتُ لَهُ إِلَى الْمَكَانِ الَّذِي أُحِبُّ أَنْ أُصَلِّيَ فِيهِ، فَقَامَ رَسُولُ اللهِ ﷺ، فَكَبَّرَ وَصَفَفْنَا وَرَاءَهُ، فَصَلَّى رَكْعَتَيْنِ، ثُمَّ سَلَّمَ، وَسَلَّمْنَا حِينَ سَلَّمَ، فَحَبَسْتُهُ عَلَى خَزِيرٍ يُصْنَعُ لَهُ، فَسَمِعَ أَهْلُ الدَّارِ رَسُولَ اللهِ ﷺ فِي بَيْتِي، فَثَابَ رِجَالٌ مِنْهُمْ، حَتَّى كَثُرَ الرِّجَالُ فِي الْبَيْتِ، فَقَالَ رَجُلٌ مِنْهُمْ: مَا فَعَلَ مَالِكٌ؟ لا أَرَاهُ! فَقَالَ رَجُلٌ مِنْهُمْ: ذَاكَ مُنَافِقٌ لا يُحِبُّ اللهَ وَرَسُولَهُ. فَقَالَ رَسُولُ اللهِ ﷺ: «لا تَقُلْ ذَاكَ! أَلا تَرَاهُ قَالَ: لا إِلَهَ إِلا اللهُ، يَبْتَغِي بِذَلِكَ وَجْهَ اللهِ؟» فَقَالَ: اللهُ وَرَسُولُهُ أَعْلَمُ، أَمَّا نَحْنُ فَوَاللهِ لا نَرَى وُدَّهُ وَلا حَدِيثَهُ إِلا إِلَى الْمُنَافِقِينَ. قَالَ رَسُولُ اللهِ ﷺ: «فَإِنَّ اللهَ قَدْ حَرَّمَ عَلَى النَّارِ مَنْ قَالَ: لا إِلَهَ إِلا اللهُ، يَبْتَغِي بِذَلِكَ وَجْهَ اللهِ (وَفِي رِوَايَةٍ: فَإِنَّهُ لا يُوَافَى عَبْدٌ يَوْمَ الْقِيَامَةِ بِهِ إِلا حَرَّمَ اللهُ عَلَيْهِ النَّارَ).<br>● (وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: قَالَ رَجُلٌ مِنَ الأَنْصَارِ: إِنِّي لا أَسْتَطِيعُ الصَّلاةَ مَعَكَ. وَكَانَ رَجُلاً ضَخْمًا، فَصَنَعَ لِلنَّبِيِّ ﷺ طَعَامًا، فَدَعَاهُ إِلَى مَنْزِلِهِ، فَبَسَطَ لَهُ حَصِيرًا، وَنَضَحَ طَرَفَ الْحَصِيرِ، فَصَلَّى عَلَيْهِ رَكْعَتَيْنِ فَقَالَ رَجُلٌ مِنَ آلِ الْجَارُودِ لأَنَسٍ: أَكَانَ النَّبِيُّ ﷺ يُصَلِّي الضُّحَى؟ قَالَ: مَا رَأَيْتُهُ صَلاهَا إِلا يَوْمَئِذٍ)."
  },
  {
    "id": 12,
    "book": "كتاب الإيمان",
    "bab": "باب الرياء والسمعة",
    "text": "عَنْ جُنْدَبٍ - رضي الله عنه -، قَالَ: قَالَ النَّبِيُّ ﷺ: «مَنْ سَمَّعَ سَمَّعَ اللهُ بِهِ (وَفِي رِوَايَةٍ: يَوْمَ الْقِيَامَةِ)، وَمَنْ يُرَائِي يُرَائِي اللهُ بِهِ. وَفِي رِوَايَةٍ: وَمَنْ يُشَاقِقْ يَشْقُقِ اللهُ عَلَيْهِ يَوْمَ الْقِيَامَةِ. فَقَالُوا: أَوْصِنَا. فَقَالَ: إِنَّ أَوَّلَ مَا يُنْتِنُ مِنَ الإِنْسَانِ بَطْنُهُ، فَمَنِ اسْتَطَاعَ أَنْ لا يَأْكُلَ إِلا طَيِّبًا فَلْيَفْعَلْ، وَمَنِ اسْتَطَاعَ أَنْ لا يُحَالَ بَيْنَهُ وَبَيْنَ الْجَنَّةِ بِمِلْءِ كَفِّهِ مِنْ دَمٍ أَهْرَاقَهُ فَلْيَفْعَلْ»."
  },
  {
    "id": 13,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الإيمان بالله أفضل الأعمال",
    "text": "عَنْ أَبِي ذَرٍّ - رضي الله عنه -، قَالَ: سَأَلْتُ النَّبِيَّ ﷺ: أَيُّ الْعَمَلِ أَفْضَلُ؟ قَالَ: «إِيمَانٌ بِاللهِ، وَجِهَادٌ فِي سَبِيلِهِ». قُلْتُ: فَأَيُّ الرِّقَابِ أَفْضَلُ؟ قَالَ: أَعْلاهَا ثَمَنًا، وَأَنْفَسُهَا عِنْدَ أَهْلِهَا. قُلْتُ: فَإِنْ لَمْ أَفْعَلْ؟ قَالَ: «تُعِينُ صَانِعًا، أَوْ تَصْنَعُ لأَخْرَقَ». قَالَ: فَإِنْ لَمْ أَفْعَلْ؟ قَالَ: «تَدَعُ النَّاسَ مِنَ الشَّرِّ؛ فَإِنَّهَا صَدَقَةٌ تَصَدَّقُ بِهَا عَلَى نَفْسِكَ»."
  },
  {
    "id": 14,
    "book": "كتاب الإيمان",
    "bab": "باب من قال: إن الإيمان هو العمل",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ سُئِلَ: أَيُّ الْعَمَلِ أَفْضَلُ؟ فَقَالَ: «إِيمَانٌ بِاللهِ وَرَسُولِهِ». قِيلَ: ثُمَّ مَاذَا؟ قَالَ: «الْجِهَادُ فِي سَبِيلِ اللهِ». قِيلَ: ثُمَّ مَاذَا؟ قَالَ: «حَجٌّ مَبْرُورٌ»."
  },
  {
    "id": 15,
    "book": "كتاب الإيمان",
    "bab": "باب قطع الوسوسة في الإيمان",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «يَأْتِي الشَّيْطَانُ أَحَدَكُمْ فَيَقُولُ: مَنْ خَلَقَ كَذَا؟ مَنْ خَلَقَ كَذَا؟ حَتَّى يَقُولَ: مَنْ خَلَقَ رَبَّكَ؟ فَإِذَا بَلَغَهُ فَلْيَسْتَعِذْ بِاللهِ وَلْيَنْتَهِ».<br>● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: «لَنْ يَبْرَحَ النَّاسُ يَتَسَاءَلُونَ حَتَّى يَقُولُوا: هَذَا اللهُ خَالِقُ كُلِّ شَيْءٍ، فَمَنْ خَلَقَ اللهَ؟»."
  },
  {
    "id": 16,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: لكل نبي آية يؤمن عليها البشر",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ: «مَا مِنَ الأَنْبِيَاءِ نَبِيٌّ إِلا أُعْطِيَ مِنَ الآيَاتِ مَا مِثْلُهُ آمَنَ عَلَيْهِ الْبَشَرُ، وَإِنَّمَا كَانَ الَّذِي أُوتِيتُ وَحْيًا أَوْحَاهُ اللهُ إِلَيَّ، فَأَرْجُو أَنِّي أَكْثَرُهُمْ تَابِعًا يَوْمَ الْقِيَامَةِ»."
  },
  {
    "id": 17,
    "book": "كتاب الإيمان",
    "bab": "باب فضل من أسلم من أهل الكتابين",
    "text": "عَنْ أَبِي مُوسَى - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «ثَلاثَةٌ لَهُمْ أَجْرَانِ: رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَآمَنَ بِمُحَمَّدٍ ﷺ، وَالْعَبْدُ الْمَمْلُوكُ إِذَا أَدَّى حَقَّ اللهِ وَحَقَّ مَوَالِيهِ، وَرَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ فَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا، وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ»."
  },
  {
    "id": 18,
    "book": "كتاب الإيمان",
    "bab": "باب حلاوة الإيمان",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «ثَلاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلاوَةَ الإِيمَانِ: أَنْ يَكُونَ اللهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءَ لا يُحِبُّهُ إِلا لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ»."
  },
  {
    "id": 19,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: حب الرسول ﷺ من الإيمان",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، قَالَ: قَالَ النَّبِيُّ ﷺ: «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ، وَوَلَدِهِ، وَالنَّاسِ أَجْمَعِينَ».<br>● (وَفِي حَدِيثِ عَبْدِ اللهِ بْنِ هِشَامٍ - رضي الله عنه - قَالَ: كُنَّا مَعَ النَّبِيِّ ﷺ وَهُوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ - رضي الله عنه -، فَقَالَ لَهُ عُمَرُ: يَا رَسُولَ اللهِ! لأَنْتَ أَحَبُّ إِلَيَّ مِنْ كُلِّ شَيْءٍ إِلا مِنْ نَفْسِي. فَقَالَ النَّبِيُّ ﷺ: «لا وَالَّذِي نَفْسِي بِيَدِهِ! حَتَّى أَكُونَ أَحَبَّ إِلَيْكَ مِنْ نَفْسِكَ». فَقَالَ لَهُ عُمَرُ: فَإِنَّهُ الآنَ وَاللهِ لأَنْتَ أَحَبُّ إِلَيَّ مِنْ نَفْسِي. فَقَالَ النَّبِيُّ ﷺ: «الآنَ يَا عُمَرُ»)."
  },
  {
    "id": 20,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: من الإيمان أن يحب لأخيه ما يحب لنفسه",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ»."
  },
  {
    "id": 21,
    "book": "كتاب الإيمان",
    "bab": "باب علامة المنافق",
    "text": "عَنِ ابْنِ عَمْرٍو - رضي الله عنهما -، عَنِ النَّبِيِّ ﷺ، قَالَ: «أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا - وَفِي رِوَايَةٍ: خَالِصًا -، أَوْ كَانَتْ فِيهِ خَصْلَةٌ مِنْ أَرْبَعَةٍ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا: إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أُخْلَفَ (وَفِي رِوَايَةٍ: إِذَا اؤْتُمِنَ خَانَ)، وَإِذَا عَاهَدَ غَدَرَ، وَإِذَا خَاصَمَ فَجَرَ».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: «آيَةُ الْمُنَافِقِ ثَلاثٌ: إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ»."
  },
  {
    "id": 22,
    "book": "كتاب الإيمان",
    "bab": "باب مثل المؤمن والمنافق",
    "text": "عَنْ كَعْبِ بْنِ مَالِكٍ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «مَثَلُ الْمُؤْمِنِ كَالْخَامَةِ مِنَ الزَّرْعِ: تُفَيِّئُهَا الرِّيحُ مَرَّةً، وَتَعْدِلُهَا مَرَّةً، وَمَثَلُ الْمُنَافِقِ كَالأَرْزَةِ لا تَزَالُ، حَتَّى يَكُونَ انْجِعَافُهَا مَرَّةً وَاحِدَةً».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: وَكَذَلِكَ الْمُؤْمِنُ يُكْفَّأُ بِالْبَلاءِ."
  },
  {
    "id": 23,
    "book": "كتاب الإيمان",
    "bab": "باب مثل المؤمن والمنافق",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما -، قَالَ: كُنَّا عِنْدَ رَسُولِ اللهِ ﷺ - وَفِي رِوَايَةٍ: وَهُوَ يَأْكُلُ جُمَّارًا -، فَقَالَ: «أَخْبِرُونِي بِشَجَرَةٍ (وَفِي رِوَايَةٍ: خَضْرَاءَ) تُشْبِهُ، أَوْ كَالرَّجُلِ الْمُسْلِمِ، لا يَتَحَاتُّ وَرَقُهَا، وَلا، وَلا، وَلا، تُؤْتِي أُكُلَهَا كُلَّ حِينٍ». - وَفِي رِوَايَةٍ: فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي - قَالَ ابْنُ عُمَرَ: فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ، وَرَأَيْتُ أَبَا بَكْرٍ وَعُمَرَ لا يَتَكَلَّمَانِ، فَكَرِهْتُ أَنْ أَتَكَلَّمَ، فَلَمَّا لَمْ يَقُولُوا شَيْئًا قَالَ رَسُولُ اللهِ ﷺ: «هِيَ النَّخْلَةُ». فَلَمَّا قُمْنَا قُلْتُ لِعُمَرَ: يَا أَبَتَاهُ! وَاللهِ لَقَدْ كَانَ وَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ. فَقَالَ: مَا مَنَعَكَ أَنْ تَكَلَّمَ؟ قَالَ: لَمْ أَرَكُمْ تَكَلَّمُونَ؛ فَكَرِهْتُ أَنْ أَتَكَلَّمَ أَوْ أَقُولَ شَيْئًا. قَالَ عُمَرُ: لأَنْ تَكُونَ قُلْتَهَا أَحَبُّ إِلَيَّ مِنْ كَذَا وَكَذَا."
  },
  {
    "id": 24,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الحياء من الإيمان",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «الإِيمَانُ بِضْعٌ  (وَسِتُّونَ) شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ».<br>● وَفِي حَدِيثِ ابْنِ عُمَرَ - رضي الله عنهما -: أَنَّ رَسُولَ اللهِ ﷺ مَرَّ عَلَى رَجُلٍ مِنَ الأَنْصَارِ وَهُوَ يَعِظُ أَخَاهُ فِي الْحَيَاءِ، فَقَالَ رَسُولُ الله ﷺ: «دَعْهُ! فَإِنَّ الْحَيَاءَ مِنَ الإِيمَانِ»."
  },
  {
    "id": 25,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الحياء من الإيمان",
    "text": "عَنِ عِمْرَانَ - رضي الله عنه -، قَالَ: قَالَ النَّبِيُّ ﷺ: «الْحَيَاءُ لا يَأْتِي إِلا بِخَيْرٍ». فَقَالَ بُشَيْرُ بْنُ كَعْبٍ: مَكْتُوبٌ فِي الْحِكْمَةِ: إِنَّ مِنَ الْحَيَاءِ وَقَارًا، وَإِنَّ مِنْ الْحَيَاءِ سَكِينَةً. فَقَالَ لَهُ عِمْرَانُ: أُحَدِّثُكَ عَنْ رَسُولِ اللهِ ﷺ وَتُحَدِّثُنِي عَنْ صَحِيفَتِكَ؟!."
  },
  {
    "id": 26,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: من كان يؤمن بالله واليوم الآخر",
    "text": "عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ - رضي الله عنه -، قَالَ: سَمِعَتْ أُذُنَايَ وَأَبْصَرَتْ عَيْنَايَ حِينَ تَكَلَّمَ النَّبِيُّ ﷺ، فَقَالَ: «مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتَهُ». قَالَ: وَمَا جَائِزَتُهُ يَا رَسُولَ اللهِ؟ قَالَ: «يَوْمٌ وَلَيْلَةٌ، وَالضِّيَافَةُ ثَلاثَةُ أَيَّامٍ، فَمَا كَانَ وَرَاءَ ذَلِكَ فَهُوَ صَدَقَةٌ عَلَيْهِ - وَفِي رِوَايَةٍ: وَلا يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُحْرِجَهُ -، وَمَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: (فَلْيُصِلْ رَحِمَهُ)."
  },
  {
    "id": 27,
    "book": "كتاب الإيمان",
    "bab": "باب إثم من لا يأمن جاره بوائقه",
    "text": "عَنْ أَبِي شُرَيْحٍ - رضي الله عنه -: أَنَّ النَّبِيَّ ﷺ قَالَ: «وَاللهِ لا يُؤْمِنُ، وَاللهِ لا يُؤْمِنُ، وَاللهِ لا يُؤْمِنُ». قِيلَ: وَمَنْ يَا رَسُولَ اللهِ؟ قَالَ: «الَّذِي لا يَأْمَنُ جَارُهُ بَوَائِقَهُ».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه - مُعَلَّقًا مِثْلَهُ."
  },
  {
    "id": 28,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: علامة الإيمان حب الأنصار",
    "text": "عَنِ الْبَرَاءِ - رضي الله عنه -، قَالَ: قَالَ النَّبِيُّ ﷺ: «الأَنْصَارُ لا يُحِبُّهُمْ إِلا مُؤْمِنٌ، وَلا يُبْغِضُهُمْ إِلا مُنَافِقٌ، فَمَنْ أَحَبَّهُمْ أَحَبَّهُ اللهُ، وَمَنْ أَبْغَضَهُمْ أَبْغَضَهُ اللهُ».<br>● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: «آيَةُ الإِيمَانِ حُبُّ الأَنْصَارِ، وَآيَةُ النِّفَاقِ بُغْضُ الأَنْصَارِ»."
  },
  {
    "id": 29,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الإيمان يأرز إلى المدينة",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «إِنَّ الإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا»."
  },
  {
    "id": 30,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الإيمان يمان",
    "text": "عَنْ أَبِي مَسْعُودٍ - رضي الله عنه -، قَالَ: أَشَارَ رَسُولُ اللهِ ﷺ بِيَدِهِ نَحْوَ الْيَمَنِ، فَقَالَ: «الإِيمَانُ [يَمَانٍ] هَاهُنَا (وَفِي رِوَايَةٍ: مَرَّتَيْنِ)، أَلا إِنَّ الْقَسْوَةَ وَغِلَظَ الْقُلُوبِ فِي الْفَدَّادِينَ عِنْدَ أُصُولِ أَذْنَابِ الإِبِلِ (وَفِي رِوَايَةٍ: وَالْبَقَرِ)، حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ: فِي رَبِيعَةَ وَمُضَرَ»."
  },
  {
    "id": 31,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الإيمان يمان",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ: «أَتَاكُمْ أَهْلُ الْيَمَنِ، هُمْ أَرَقُّ أَفْئِدَةً، وَأَلْيَنُ قُلُوبًا، الإِيمَانُ - وَفِي رِوَايَةٍ: الْفِقْهُ - يَمَانٍ، وَالْحِكْمَةُ يَمَانِيَةٌ، وَالْفَخْرُ وَالْخُيَلاءُ فِي أَصْحَابِ الإِبِلِ - وَفِي رِوَايَةٍ: وَالْخَيْلِ -، وَالسَّكِينَةُ وَالْوَقَارُ فِي أَهْلِ الْغَنَمِ».<br>وَفِي رِوَايَةٍ: رَأْسُ الْكُفْرِ نَحْوَ الْمَشْرِقِ."
  },
  {
    "id": 32,
    "book": "كتاب الإيمان",
    "bab": "باب ما ينافي كمال الإيمان",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «لا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ، وَلا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُ وَهُوَ مُؤْمِنٌ، وَلا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ، وَلا يَنْتَهِبُ نُهْبَةً - وَفِي رِوَايَةٍ: ذَاتَ شَرَفٍ - يَرْفَعُ النَّاسُ إِلَيْهِ فِيهَا أَبْصَارَهُمْ وَهُوَ مُؤْمِنٌ». وَفِي رِوَايَةٍ: وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُ.<br>● (وَفِي حَدِيثِ ابْنِ عَبَّاسٍ - رضي الله عنهما -: وَلا يَقْتُلُ وَهُوَ مُؤْمِنٌ. قَالَ عِكْرِمَةُ: قُلْتُ لابْنِ عَبَّاسٍ: كَيْفَ يُنْزَعُ الإِيمَانُ مِنْهُ؟ قَالَ: هَكَذَا - وَشَبَّكَ بَيْنَ أَصَابِعِهِ ثُمَّ أَخْرَجَهَا -، فَإِنْ تَابَ عَادَ إِلَيْهِ هَكَذَا. وَشَبَّكَ بَيْنَ أَصَابِعِهِ)."
  },
  {
    "id": 33,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: لا يلدغ المؤمن من جحر مرتين",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «لا يُلْدَغُ الْمُؤْمِنُ مِنْ جُحْرٍ وَاحِدٍ مَرَّتَيْنِ»."
  },
  {
    "id": 34,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: عقوق الوالدين من الكبائر",
    "text": "عَنْ أَبِي بَكْرَةَ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «أَلا أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ؟» - وَفِي رِوَايَةٍ: ثَلاثًا - قُلْنَا: بَلَى يَا رَسُولَ اللهِ! قَالَ: «الإِشْرَاكُ بِاللهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَكَانَ مُتَّكِئًا فَجَلَسَ، فَقَالَ: أَلا وَقَوْلُ الزُّورِ وَشَهَادَةُ الزُّورِ، أَلا وَقَوْلُ الزُّورِ وَشَهَادَةُ الزُّورِ! فَمَا زَالَ يَقُولُهَا حَتَّى قُلْتُ: لا يَسْكُتُ».<br>● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: وَقَتْلُ النَّفْسِ.<br>● (وَفِي حَدِيثِ عَبْدِ اللهِ بْنِ عَمْرٍو - رضي الله عنهما -: وَالْيَمِينُ الْغَمُوسُ). (وَفِي رِوَايَةٍ: عَنْ فِرَاسٍ: قُلْتُ لِلشَّعْبِيِّ: وَمَا الْيَمِينُ الْغَمُوسُ؟ قَالَ: الَّذِي يَقْتَطِعُ مَالَ امْرِئٍ مُسْلِمٍ هُوَ فِيهَا كَاذِبٌ)."
  },
  {
    "id": 35,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: عقوق الوالدين من الكبائر",
    "text": "عَنِ ابْنِ عَمْرٍو - رضي الله عنهما -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «إِنَّ مِنْ (أَكْبَرِ) الْكَبَائِرِ أَنْ يَلْعَنَ الرَّجُلُ وَالِدَيْهِ». قِيلَ: يَا رَسُولَ اللهِ! وَكَيْفَ يَلْعَنُ الرَّجُلُ وَالِدَيْهِ؟ قَالَ: «يَسُبُّ الرَّجُلُ أَبَا الرَّجُلِ، فَيَسُبُّ أَبَاهُ، وَيَسُبُّ أُمَّهُ؛ فَيَسُبُّ أُمَّهُ»."
  },
  {
    "id": 36,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: الشرك والسحر من الموبقات",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ». قَالُوا: يَا رَسُولَ اللهِ! وَمَا هُنَّ؟ قَالَ: «الشِّرْكُ بِاللهِ، وَالسِّحْرُ، وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللهُ إِلا بِالْحَقِّ، وَأَكْلُ الرِّبَا، وَأَكْلُ مَالِ الْيَتِيمِ، وَالتَّوَلِّي يَوْمَ الزَّحْفِ، وَقَذْفُ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ الْغَافِلاتِ»."
  },
  {
    "id": 37,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: قتل المؤمن من الكبائر",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما -، عَنِ النَّبِيِّ ﷺ، قَالَ - وَفِي رِوَايَةٍ: فِي حَجَّةِ الْوَدَاعِ -: «وَيْلَكُمْ! لا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ».<br>● وَفِي حَدِيثِ جَرِيرٍ - رضي الله عنه -: أَنَّ النَّبِيَّ ﷺ قَالَ لَهُ فِي حَجَّةِ الْوَدَاعِ: اسْتَنْصِتِ النَّاسَ. فَقَالَ..."
  },
  {
    "id": 38,
    "book": "كتاب الإيمان",
    "bab": "باب من ادعى إلى غير أبيه",
    "text": "عَنْ سَعْدٍ - رضي الله عنه -، قَالَ: سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ: «مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ».<br>● (وَفِي حَدِيثِ وَاثِلَةَ بْنِ الأَسْقَعِ - رضي الله عنه -: إِنَّ مِنْ أَعْظَمِ الْفِرَى أَنْ يَدَّعِيَ الرَّجُلُ إِلَى غَيْرِ أَبِيهِ، أَوْ يُرِيَ عَيْنَهُ مَا لَمْ تَرَ، أَوْ يَقُولَ عَلَى رَسُولِ اللهِ ﷺ مَا لَمْ يَقُلْ)."
  },
  {
    "id": 39,
    "book": "كتاب الإيمان",
    "bab": "باب من ادعى إلى غير أبيه",
    "text": "عَنْ أَبِي ذَرٍّ - رضي الله عنه -: أَنَّهُ سَمِعَ النَّبِيَّ ﷺ يَقُولُ: «لَيْسَ مِنْ رَجُلٍ ادَّعَى لِغَيْرِ أَبِيهِ وَهُوَ يَعْلَمُهُ إِلا كَفَرَ، وَمَنِ ادَّعَى قَوْمًا لَيْسَ لَهُ فِيهِمْ نَسَبٌ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: «لا تَرْغَبُوا عَنْ آبَائِكُمْ، فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ».<br>● (وَفِي حَدِيثِ عُمَرَ - رضي الله عنه -: إِنَّا كُنَّا نَقْرَأُ فِيمَا نَقْرَأُ مِنْ كِتَابِ اللهِ: أَنْ لا تَرْغَبُوا عَنْ آبَائِكُمْ؛ فَإِنَّهُ كُفْرٌ بِكُمْ أَنْ تَرْغَبُوا عَنْ آبَائِكُمْ)."
  },
  {
    "id": 40,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: من كفر أخاه بغير تأويل فهو كما قال",
    "text": "عَنْ أَبِي ذَرٍّ - رضي الله عنه -: أَنَّهُ سَمِعَ النَّبِيَّ ﷺ يَقُولُ: «لا يَرْمِي رَجُلٌ رَجُلاً بِالْفُسُوقِ وَلا يَرْمِيهِ بِالْكُفْرِ إِلا ارْتَدَّتْ عَلَيْهِ إِنْ لَمْ يَكُنْ صَاحِبُهُ كَذَلِكَ»."
  },
  {
    "id": 41,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: من كفر أخاه بغير تأويل فهو كما قال",
    "text": "عَنْ ثَابِتِ بْنِ الضَّحَّاكِ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «مَنْ حَلَفَ عَلَى مِلَّةٍ غَيْرِ الإِسْلامِ - وَفِي رِوَايَةٍ: كَاذِبًا مُتَعَمِّدًا - فَهُوَ كَمَا قَالَ، وَمَنْ لَعَنَ مُؤْمِنًا فَهُوَ كَقَتْلِهِ، (وَمَنْ قَذَفَ مُؤْمِنًا بِكُفْرٍ فَهُوَ كَقَتْلِهِ)»."
  },
  {
    "id": 42,
    "book": "كتاب الإيمان",
    "bab": "باب قوله تعالى: ﴿فَلا تَجْعَلُوا اللهَ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ﴾",
    "text": "عَنِ ابْنِ مَسْعُودٍ - رضي الله عنه -، قَالَ: سَأَلْتُ، أَوْ سُئِلَ رَسُولُ اللهِ ﷺ: أَيُّ الذَّنْبِ عِنْدَ اللهِ أَكْبَرُ؟ قَالَ: «أَنْ تَجْعَلَ لِلَّهِ نِدًّا وَهُوَ خَلَقَكَ». - وَفِي رِوَايَةٍ: قُلْتُ: إِنَّ ذَلِكَ لَعَظِيمٌ! - قُلْتُ: ثُمَّ أَيُّ؟ قَالَ: «ثُمَّ أَنْ تَقْتُلَ وَلَدَكَ خَشْيَةَ أَنْ يَطْعَمَ مَعَكَ». قُلْتُ: ثُمَّ أَيُّ؟ قَالَ: «أَنْ تُزَانِيَ بِحَلِيلَةِ جَارِكَ». قَالَ: وَنَزَلَتْ هَذِهِ الآيَةُ تَصْدِيقًا لِقَوْلِ رَسُولِ اللهِ ﷺ: ﴿وَالَّذِينَ لا يَدْعُونَ مَعَ اللهِ إِلَهًا آخَرَ وَلا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللهُ إِلا بِالْحَقِّ وَلا يَزْنُونَ﴾."
  },
  {
    "id": 43,
    "book": "كتاب الإيمان",
    "bab": "باب قوله تعالى: ﴿وَلا تَجْعَلُوا اللهَ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ﴾",
    "text": "عَنِ ابْنِ مَسْعُودٍ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «مَنْ مَاتَ يُشْرِكُ بِاللهِ شَيْئًا دَخَلَ النَّارَ». وَقُلْتُ أَنَا: مَنْ مَاتَ لا يُشْرِكُ بِاللهِ شَيْئًا دَخَلَ الْجَنَّةَ."
  },
  {
    "id": 44,
    "book": "كتاب الإيمان",
    "bab": "باب من كان آخر كلامه لا إله إلا الله",
    "text": "عَنْ أَبِي ذَرٍّ - رضي الله عنه -، قَالَ: أَتَيْتُ النَّبِيَّ ﷺ وَعَلَيْهِ ثَوْبٌ أَبْيَضُ وَهُوَ نَائِمٌ، ثُمَّ أَتَيْتُهُ وَقَدِ اسْتَيْقَظَ، فَقَالَ: «مَا مِنْ عَبْدٍ قَالَ: لا إِلَهَ إِلا اللهُ، ثُمَّ مَاتَ عَلَى ذَلِكَ إِلا دَخَلَ الْجَنَّةَ». قُلْتُ: وَإِنْ زَنَى وَإِنْ سَرَقَ؟ قَالَ: «وَإِنْ زَنَى وَإِنْ سَرَقَ». قُلْتُ: وَإِنْ زَنَى وَإِنْ سَرَقَ؟ قَالَ: «وَإِنْ زَنَى وَإِنْ سَرَقَ». قُلْتُ: وَإِنْ زَنَى وَإِنْ سَرَقَ؟ قَالَ: «وَإِنْ زَنَى وَإِنْ سَرَقَ، عَلَى رَغْمِ أَنْفِ أَبِي ذَرٍّ». وَكَانَ أَبُو ذَرٍّ إِذَا حَدَّثَ بِهَذَا قَالَ: وَإِنْ رَغِمَ أَنْفُ أَبِي ذَرٍّ.<br>وَفِي رِوَايَةٍ: عَرَضَ لِي جِبْرِيلُ فِي جَانِبِ الْحَرَّةِ، قَالَ: بَشِّرْ أُمَّتَكَ أَنَّهُ مَنْ مَاتَ لا يُشْرِكُ بِاللهِ شَيْئًا دَخَلَ الْجَنَّةَ (وَفِي رِوَايَةٍ: أَوْ: لَمْ يَدْخُلِ النَّارَ). قُلْتُ: يَا جِبْرِيلُ، وَإِنْ سَرَقَ وَإِنْ زَنَى؟ قَالَ: نَعَمْ. قَالَ: قُلْتُ: وَإِنْ سَرَقَ وَإِنْ زَنَى؟ قَالَ: نَعَمْ، وَإِنْ شَرِبَ الْخَمْرَ."
  },
  {
    "id": 45,
    "book": "كتاب الإيمان",
    "bab": "باب قول الله تعالى: ﴿وَتَجْعَلُونَ رِزْقَكُمْ أَنَّكُمْ تُكَذِّبُونَ﴾",
    "text": "عَنْ زَيْدِ بْنِ خَالِدٍ - رضي الله عنه -، قَالَ: صَلَّى لَنَا رَسُولُ اللهِ ﷺ صَلاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ عَلَى إِثْرِ سَمَاءٍ كَانَتْ مِنَ اللَّيْلَةِ، فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ، فَقَالَ: «هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ؟» قَالُوا: اللهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ، فَأَمَّا مَنْ قَالَ: مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ (وَفِي رِوَايَةٍ: وَبِرِزْقِ اللهِ)؛ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ، وَأَمَّا مَنْ قَالَ: مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا؛ فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ»."
  },
  {
    "id": 46,
    "book": "كتاب الإيمان",
    "bab": "باب قوله: ﴿إِنَّ وَلِيِّيَ اللهُ وَصَالِحُ الْمُؤْمِنِينَ﴾",
    "text": "عَنْ عَمْرِو بْنِ الْعَاصِ - رضي الله عنه -، قَالَ: سَمِعْتُ النَّبِيَّ ﷺ جِهَارًا غَيْرَ سِرٍّ يَقُولُ: «إِنَّ آلَ أَبِي فُلانٍ لَيْسُوا بِأَوْلِيَائِي، إِنَّمَا وَلِيِّيَ اللهُ وَصَالِحُ الْمُؤْمِنِينَ. (وَفِي رِوَايَةٍ مُعَلَّقَةٍ: وَلَكِنْ لَهُمْ رَحِمٌ أَبُلُّهَا بِبِلالِهَا)."
  },
  {
    "id": 47,
    "book": "كتاب الإيمان",
    "bab": "باب شرائع الإسلام",
    "text": "عَنْ طَلْحَةَ - رضي الله عنه -، قَالَ: جَاءَ رَجُلٌ إِلَى رَسُولِ اللهِ ﷺ مِنْ أَهْلِ نَجْدٍ، ثَائِرَ الرَّأْسِ، يُسْمَعُ دَوِيُّ صَوْتِهِ وَلا يُفْقَهُ مَا يَقُولُ، حَتَّى دَنَا، فَإِذَا هُوَ يَسْأَلُ عَنِ الإِسْلامِ. فَقَالَ رَسُولُ اللهِ ﷺ: «خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ». فَقَالَ: هَلْ عَلَيَّ غَيْرُهَا؟ قَالَ: «لا، إِلا أَنْ تَطَّوَّعَ». قَالَ رَسُولُ اللهِ ﷺ: «وَصِيَامُ رَمَضَانَ». قَالَ: هَلْ عَلَيَّ غَيْرُهُ؟ قَالَ: «لا، إِلا أَنْ تَطَّوَّعَ». قَالَ: وَذَكَرَ لَهُ رَسُولُ اللهِ ﷺ الزَّكَاةَ، قَالَ: هَلْ عَلَيَّ غَيْرُهَا؟ قَالَ: «لا، إِلا أَنْ تَطَّوَّعَ». (وَفِي رِوَايَةٍ: فَأَخْبَرَهُ رَسُولُ اللهِ ﷺ شَرَائِعَ الإِسْلامِ). قَالَ: فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ: وَاللهِ لا أَزِيدُ عَلَى هَذَا وَلا أَنْقُصُ. قَالَ رَسُولُ اللهِ ﷺ: «أَفْلَحَ إِنْ صَدَقَ. وَفِي رِوَايَةٍ: أَوْ: دَخَلَ الْجَنَّةَ إِنْ صَدَقَ»."
  },
  {
    "id": 48,
    "book": "كتاب الإيمان",
    "bab": "باب قول النبي ﷺ: بني الإسلام على خمس",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «بُنِيَ الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَالْحَجِّ، وَصَوْمِ رَمَضَانَ».<br>وَفِي رِوَايَةٍ: (عَنْ نَافِعٍ: أَنَّ رَجُلاً أَتَى ابْنَ عُمَرَ، فَقَالَ: يَا أَبَا عَبْدِ الرَّحْمَنِ، مَا حَمَلَكَ عَلَى أَنْ تَحُجَّ عَامًا وَتَعْتَمِرَ عَامًا، وَتَتْرُكَ الْجِهَادَ فِي سَبِيلِ اللهِ عَزَّ وَجَلَّ، وَقَدْ عَلِمْتَ مَا رَغَّبَ اللهُ فِيهِ؟! قَالَ: يَا ابْنَ أَخِي،) بُنِيَ الإِسْلامُ..."
  },
  {
    "id": 49,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: إطعام الطعام من الإسلام",
    "text": "عَنِ ابْنِ عَمْرٍو - رضي الله عنهما -: أَنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ: أَيُّ الإِسْلامِ خَيْرٌ؟ قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ»."
  },
  {
    "id": 50,
    "book": "كتاب الإيمان",
    "bab": "باب من أحسن في الإسلام",
    "text": "عَنِ ابْنِ مَسْعُودٍ - رضي الله عنه -، قَالَ: قَالَ رَجُلٌ: يَا رَسُولَ اللهِ! أَنُؤَاخَذُ بِمَا عَمِلْنَا فِي الْجَاهِلِيَّةِ؟ قَالَ: «مَنْ أَحْسَنَ فِي الإِسْلامِ لَمْ يُؤَاخَذْ بِمَا عَمِلَ فِي الْجَاهِلِيَّةِ، وَمَنْ أَسَاءَ فِي الإِسْلامِ أُخِذَ بِالأَوَّلِ وَالآخِرِ»."
  },
  {
    "id": 51,
    "book": "كتاب الإيمان",
    "bab": "باب خوف المؤمن من أن يحبط عمله وهو لا يشعر",
    "text": "عَنِ ابْنِ مَسْعُودٍ - رضي الله عنه -: أَنَّ النَّبِيَّ ﷺ قَالَ: «سِبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ»."
  },
  {
    "id": 52,
    "book": "كتاب الإيمان",
    "bab": "باب من هم بحسنة أو بسيئة",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -، عَنِ النَّبِيِّ ﷺ فِيمَا يَرْوِي عَنْ رَبِّهِ عَزَّ وَجَلَّ، قَالَ: «إِنَّ اللهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ ثُمَّ بَيَّنَ ذَلِكَ: فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ لَهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ، إِلَى سَبْعِ مِائَةِ ضِعْفٍ، إِلَى أَضْعَافٍ كَثِيرَةٍ. وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ لَهُ عِنْدَهُ حَسَنَةً كَامِلَةً، فَإِنْ هُوَ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ لَهُ سَيِّئَةً وَاحِدَةً».<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: يَقُولُ اللهُ: «إِذَا أَرَادَ عَبْدِي أَنْ يَعْمَلَ سَيِّئَةً فَلا تَكْتُبُوهَا عَلَيْهِ حَتَّى يَعْمَلَهَا، فَإِنْ عَمِلَهَا فَاكْتُبُوهَا بِمِثْلِهَا، وَإِنْ تَرَكَهَا مِنْ أَجْلِي فَاكْتُبُوهَا لَهُ حَسَنَةً، وَإِذَا أَرَادَ أَنْ يَعْمَلَ حَسَنَةً فَلَمْ يَعْمَلْهَا فَاكْتُبُوهَا لَهُ حَسَنَةً، فَإِنْ عَمِلَهَا فَاكْتُبُوهَا لَهُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةٍ»."
  },
  {
    "id": 53,
    "book": "كتاب الإيمان",
    "bab": "باب من هم بحسنة أو بسيئة",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «إِذَا أَحْسَنَ أَحَدُكُمْ إِسْلامَهُ فَكُلُّ حَسَنَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِ مِائَةِ ضِعْفٍ، وَكُلُّ سَيِّئَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِمِثْلِهَا».<br>● (وَفِي حَدِيثِ أَبِي سَعِيدٍ - رضي الله عنه - مُعَلَّقًا: وَالسَّيِّئَةُ بِمِثْلِهَا، إِلا أَنْ يَتَجَاوَزَ اللهُ عَنْهَا)."
  },
  {
    "id": 54,
    "book": "كتاب الإيمان",
    "bab": "باب تجاوز الله تعالى عن حديث النفس",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «إِنَّ اللهَ تَجَاوَزَ (وَفِي رِوَايَةٍ: لِي) عَنْ أُمَّتِي مَا حَدَّثَتْ بِهِ أَنْفُسَهَا مَا لَمْ تَعْمَلْ أَوْ تَتَكَلَّمْ»."
  },
  {
    "id": 55,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: المسلم من سلم المسلمون من لسانه ويده",
    "text": "عَنِ ابْنِ عَمْرٍو - رضي الله عنهما -، قَالَ: قَالَ النَّبِيُّ ﷺ: «الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، (وَالْمُهَاجِرُ مَنْ هَجَرَ مَا نَهَى اللهُ عَنْهُ)».<br>● وَفِي حَدِيثِ أَبِي مُوسَى - رضي الله عنه -: قَالُوا: يَا رَسُولَ اللهِ، أَيُّ الإِسْلامِ أَفْضَلُ؟ قَالَ: «مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ»."
  },
  {
    "id": 56,
    "book": "كتاب الإيمان",
    "bab": "باب من عمل خيرًا في الشرك ثم أسلم",
    "text": "عَنْ حَكِيمِ بْنِ حِزَامٍ - رضي الله عنه -، قَالَ: يَا رَسُولَ اللهِ! أَرَأَيْتَ أُمُورًا كُنْتُ أَتَحَنَّثُ بِهَا فِي الْجَاهِلِيَّةِ: مِنْ صِلَةٍ وَعَتَاقَةٍ وَصَدَقَةٍ، هَلْ لِي فِيهَا مِنْ أَجْرٍ؟ قَالَ رَسُولُ اللهِ ﷺ: «أَسْلَمْتَ عَلَى مَا سَلَفَ مِنْ خَيْرٍ».<br>وَفِي رِوَايَةٍ: عَنْ عُرْوَةَ: أَنَّ حَكِيمَ بْنَ حِزَامٍ - رضي الله عنه - أَعْتَقَ فِي الْجَاهِلِيَّةِ مِائَةَ رَقَبَةٍ، وَحَمَلَ عَلَى مِائَةِ بَعِيرٍ، فَلَمَّا أَسْلَمَ حَمَلَ عَلَى مِائَةِ بَعِيرٍ، وَأَعْتَقَ مِائَةَ رَقَبَةٍ."
  },
  {
    "id": 57,
    "book": "كتاب الإيمان",
    "bab": "باب كم الإيمان للخائف",
    "text": "عَنْ حُذَيْفَةَ - رضي الله عنه -، قَالَ: قَالَ النَّبِيُّ ﷺ: «اكْتُبُوا لِي مَنْ تَلَفَّظَ بِالإِسْلامِ مِنَ النَّاسِ. (فَكَتَبْنَا لَهُ أَلْفًا وَخَمْسَ مِائَةِ رَجُلٍ، فَقُلْنَا: نَخَافُ وَنَحْنُ أَلْفٌ وَخَمْسُ مِائَةٍ)؟! فَلَقَدْ رَأَيْتُنَا ابْتُلِينَا، حَتَّى إِنَّ الرَّجُلَ لَيُصَلِّي وَحْدَهُ وَهُوَ خَائِفٌ»."
  },
  {
    "id": 58,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: كيف كان بدء الوحي إلى رسول الله ﷺ",
    "text": "عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ - رضي الله عنها -، قَالَتْ: أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللهِ ﷺ مِنَ الْوَحْيِ الرُّؤْيَا (الصَّالِحَةُ) - وَفِي رِوَايَةٍ: الصَّادِقَةُ - فِي النَّوْمِ، فَكَانَ لا يَرَى رُؤْيَا إِلا جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ، ثُمَّ حُبِّبَ إِلَيْهِ الْخَلاءُ، وَكَانَ يَخْلُو بِغَارِ حِرَاءٍ فَيَتَحَنَّثُ فِيهِ - وَهُوَ التَّعَبُّدُ - اللَّيَالِيَ ذَوَاتِ الْعَدَدِ قَبْلَ أَنْ يَنْزِعَ إِلَى أَهْلِهِ، وَيَتَزَوَّدُ لِذَلِكَ، ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَيَتَزَوَّدُ لِمِثْلِهَا، حَتَّى جَاءَهُ الْحَقُّ وَهُوَ فِي غَارِ حِرَاءٍ، فَجَاءَهُ الْمَلَكُ، فَقَالَ: اقْرَأْ. قَالَ: «مَا أَنَا بِقَارِئٍ!» قَالَ: فَأَخَذَنِي فَغَطَّنِي، حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي، فَقَالَ: اقْرَأْ. قُلْتُ: «مَا أَنَا بِقَارِئٍ!» فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ، حَتَّى بَلَغَ مِنِّي الْجَهْدَ، ثُمَّ أَرْسَلَنِي، فَقَالَ: اقْرَأْ. فَقُلْتُ: «مَا أَنَا بِقَارِئٍ!» فَأَخَذَنِي فَغَطَّنِي الثَّالِثَةَ، ثُمَّ أَرْسَلَنِي، فَقَالَ: ﴿اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ * خَلَقَ الإِنْسَانَ مِنْ عَلَقٍ * اقْرَأْ وَرَبُّكَ الأَكْرَمُ﴾ - وَفِي رِوَايَةٍ: إِلَى قَوْلِهِ: ﴿عَلَّمَ الإِنْسَانَ مَا لَمْ يَعْلَمْ﴾ -. فَرَجَعَ بِهَا رَسُولُ اللهِ ﷺ يَرْجُفُ فُؤَادُهُ - وَفِي رِوَايَةٍ: بَوَادِرُهُ -، فَدَخَلَ عَلَى خَدِيجَةَ بِنْتِ خُوَيْلِدٍ - رضي الله عنها -، فَقَالَ: «زَمِّلُونِي زَمِّلُونِي!» فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ، فَقَالَ لِخَدِيجَةَ - وَأَخْبَرَهَا الْخَبَرَ -: «لَقَدْ خَشِيتُ عَلَى نَفْسِي». فَقَالَتْ خَدِيجَةُ: كَلا - وَفِي رِوَايَةٍ: أَبْشِرْ -، وَاللهِ! مَا يُخْزِيكَ اللهُ أَبَدًا، إِنَّكَ لَتَصِلُ الرَّحِمَ - وَفِي رِوَايَةٍ: وَتَصْدُقُ الْحَدِيثَ -، وَتَحْمِلُ الْكَلَّ، وَتَكْسِبُ الْمَعْدُومَ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ. فَانْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى، ابْنَ عَمِّ خَدِيجَةَ، وَكَانَ امْرَأً قَدْ تَنَصَّرَ فِي الْجَاهِلِيَّةِ، وَكَانَ يَكْتُبُ الْكِتَابَ الْعِبْرَانِيَّ، فَيَكْتُبُ مِنَ الإِنْجِيلِ بِالْعِبْرَانِيَّةِ - وَفِي رِوَايَةٍ: بِالْعَرَبِيَّةِ - مَا شَاءَ اللهُ أَنْ يَكْتُبَ، وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ، فَقَالَتْ لَهُ خَدِيجَةُ: يَا ابْنَ عَمِّ! اسْمَعْ مِنِ ابْنِ أَخِيكَ. فَقَالَ لَهُ وَرَقَةُ: يَا ابْنَ أَخِي، مَاذَا تَرَى؟ فَأَخْبَرَهُ رَسُولُ اللهِ ﷺ خَبَرَ مَا رَأَى، فَقَالَ لَهُ وَرَقَةُ: هَذَا النَّامُوسُ الَّذِي نَزَّلَ اللهُ عَلَى مُوسَى، يَا لَيْتَنِي فِيهَا جَذَعًا، لَيْتَنِي أَكُونُ حَيًّا إِذْ يُخْرِجُكَ قَوْمُكَ. فَقَالَ رَسُولُ اللهِ ﷺ: «أَوَمُخْرِجِيَّ هُمْ؟» قَالَ: نَعَمْ؛ لَمْ يَأْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِهِ إِلا عُودِيَ، وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا. (ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ، وَفَتَرَ الْوَحْيُ. وَفِي رِوَايَةٍ: حَتَّى حَزِنَ رَسُولُ اللهِ ﷺ)."
  },
  {
    "id": 59,
    "book": "كتاب الإيمان",
    "bab": "باب فتور الوحي ثم تتابعه وكثرته",
    "text": "عَنْ أَبِي سَلَمَةَ، قَالَ: سَأَلْتُ جَابِرَ بْنَ عَبْدِ اللهِ - رضي الله عنهما -: أَيُّ الْقُرْآنِ أُنْزِلَ أَوَّلُ؟ فَقَالَ: ﴿يَا أَيُّهَا الْمُدَّثِّرُ﴾. فَقُلْتُ: أُنْبِئْتُ أَنَّهُ: ﴿اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ﴾! فَقَالَ: لا أُخْبِرُكَ إِلا بِمَا قَالَ رَسُولُ اللهِ ﷺ. قَالَ رَسُولُ اللهِ ﷺ: «جَاوَرْتُ فِي حِرَاءٍ - وَفِي رِوَايَةٍ: فَتَرَ عَنِّي الْوَحْيُ فَتْرَةً -، فَلَمَّا قَضَيْتُ جِوَارِي هَبَطْتُ فَاسْتَبْطَنْتُ الْوَادِيَ، فَنُودِيتُ، فَنَظَرْتُ أَمَامِي وَخَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي -وَفِي رِوَايَةٍ: فَرَفَعْتُ رَأْسِي -، فَإِذَا هُوَ - وَفِي رِوَايَةٍ: فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ - جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ - وَفِي رِوَايَةٍ: فَجُئِثْتُ مِنْهُ رُعْبًا، وَفِي رِوَايَةٍ: حَتَّى هَوَيْتُ إِلَى الأَرْضِ -. فَأَتَيْتُ خَدِيجَةَ، فَقُلْتُ: دَثِّرُونِي، وَصُبُّوا عَلَيَّ مَاءً بَارِدًا. وَأُنْزِلَ عَلَيَّ: ﴿يَا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ * وَرَبَّكَ فَكَبِّرْ﴾». وَفِي رِوَايَةٍ: إِلَى: ﴿وَالرُّجْزَ فَاهْجُرْ﴾، قَبْلَ أَنْ تُفْرَضَ الصَّلاةُ. وَفِي رِوَايَةٍ: ثُمَّ حَمِيَ الْوَحْيُ وَتَتَابَعَ."
  },
  {
    "id": 60,
    "book": "كتاب الإيمان",
    "bab": "باب فتور الوحي ثم تتابعه وكثرته",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -: أَنَّ اللهَ تَعَالَى تَابَعَ عَلَى رَسُولِهِ ﷺ الْوَحْيَ قَبْلَ وَفَاتِهِ حَتَّى تَوَفَّاهُ أَكْثَرَ مَا كَانَ الْوَحْيُ، ثُمَّ تُوُفِّيَ رَسُولُ اللهِ ﷺ بَعْدُ."
  },
  {
    "id": 61,
    "book": "كتاب الإيمان",
    "bab": "باب المعراج بالنبي ﷺ فيما يرى قلبه",
    "text": "عَنْ أَنَسِ بْنِ مَالِكٍ - رضي الله عنه -، عَنْ أَبِي ذَرٍّ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: فُرِجَ عَنْ سَقْفِ بَيْتِي وَأَنَا بِمَكَّةَ، فَنَزَلَ جِبْرِيلُ ﷺ، فَفَرَجَ صَدْرِي، ثُمَّ غَسَلَهُ بِمَاءِ زَمْزَمَ، ثُمَّ جَاءَ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا، فَأَفْرَغَهُ فِي صَدْرِي، ثُمَّ أَطْبَقَهُ، ثُمَّ أَخَذَ بِيَدِي، فَعَرَجَ بِي إِلَى السَّمَاءِ الدُّنْيَا، فَلَمَّا جِئْتُ إِلَى السَّمَاءِ الدُّنْيَا قَالَ جِبْرِيلُ لِخَازِنِ السَّمَاءِ: افْتَحْ. قَالَ: مَنْ هَذَا؟ قَالَ: هَذَا جِبْرِيلُ. قَالَ: هَلْ مَعَكَ أَحَدٌ؟ قَالَ: نَعَمْ، مَعِي مُحَمَّدٌ ﷺ. فَقَالَ: أُرْسِلَ إِلَيْهِ؟ قَالَ: نَعَمْ. فَلَمَّا فَتَحَ عَلَوْنَا السَّمَاءَ الدُّنْيَا، فَإِذَا رَجُلٌ (قَاعِدٌ) عَلَى يَمِينِهِ أَسْوِدَةٌ، وَعَلَى يَسَارِهِ أَسْوِدَةٌ، إِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ يَسَارِهِ بَكَى، فَقَالَ: مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالابْنِ الصَّالِحِ. قُلْتُ لِجِبْرِيلَ: مَنْ هَذَا؟ قَالَ: هَذَا آدَمُ، وَهَذِهِ الأَسْوِدَةُ عَنْ يَمِينِهِ وَشِمَالِهِ نَسَمُ بَنِيهِ، فَأَهْلُ الْيَمِينِ مِنْهُمْ أَهْلُ الْجَنَّةِ، وَالأَسْوِدَةُ الَّتِي عَنْ شِمَالِهِ أَهْلُ النَّارِ، فَإِذَا نَظَرَ عَنْ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى. حَتَّى عَرَجَ بِي إِلَى السَّمَاءِ الثَّانِيَةِ، فَقَالَ لِخَازِنِهَا مِثْلَ مَا قَالَ الأَوَّلَ، فَفَتَحَ. قَالَ أَنَسٌ: فَذَكَرَ أَنَّهُ وَجَدَ فِي السَّمَوَاتِ: آدَمَ، وَإِدْرِيسَ، وَمُوسَى، وَعِيسَى، وَإِبْرَاهِيمَ - صَلَوَاتُ اللهِ عَلَيْهِمْ -، وَلَمْ يُثْبِتْ كَيْفَ مَنَازِلُهُمْ، غَيْرَ أَنَّهُ ذَكَرَ أَنَّهُ وَجَدَ آدَمَ فِي السَّمَاءِ الدُّنْيَا، وَإِبْرَاهِيمَ فِي السَّمَاءِ السَّادِسَةِ. قَالَ أَنَسٌ: فَلَمَّا مَرَّ جِبْرِيلُ بِالنَّبِيِّ ﷺ بِإِدْرِيسَ قَالَ: مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ. فَقُلْتُ: مَنْ هَذَا؟ قَالَ: هَذَا إِدْرِيسُ. ثُمَّ مَرَرْتُ بِمُوسَى، فَقَالَ: مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ. قُلْتُ: مَنْ هَذَا؟ قَالَ: هَذَا مُوسَى. ثُمَّ مَرَرْتُ بِعِيسَى، فَقَالَ: مَرْحَبًا بِالأَخِ الصَّالِحِ وَالنَّبِيِّ الصَّالِحِ. قُلْتُ: مَنْ هَذَا؟ قَالَ: هَذَا عِيسَى. ثُمَّ مَرَرْتُ بِإِبْرَاهِيمَ، فَقَالَ: مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالابْنِ الصَّالِحِ. قُلْتُ: مَنْ هَذَا؟ قَالَ: هَذَا إِبْرَاهِيمُ ﷺ. قَالَ: قَالَ النَّبِيُّ ﷺ: فَفَرَضَ اللهُ عَلَى أُمَّتِي خَمْسِينَ صَلاةً، فَرَجَعْتُ بِذَلِكَ حَتَّى مَرَرْتُ عَلَى مُوسَى، فَقَالَ: مَا فَرَضَ اللهُ لَكَ عَلَى أُمَّتِكَ؟ قُلْتُ: فَرَضَ خَمْسِينَ صَلاةً. قَالَ: فَارْجِعْ إِلَى رَبِّكَ؛ فَإِنَّ أُمَّتَكَ لا تُطِيقُ ذَلِكَ. فَرَاجَعْتُ، فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَى مُوسَى، قُلْتُ: وَضَعَ شَطْرَهَا. فَقَالَ: رَاجِعْ رَبَّكَ؛ فَإِنَّ أُمَّتَكَ لا تُطِيقُ. فَرَاجَعْتُ، فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَيْهِ، فَقَالَ: ارْجِعْ إِلَى رَبِّكَ؛ فَإِنَّ أُمَّتَكَ لا تُطِيقُ ذَلِكَ. فَرَاجَعْتُهُ، فَقَالَ: هِيَ خَمْسٌ وَهِيَ خَمْسُونَ، لا يُبَدَّلُ الْقَوْلُ لَدَيَّ. فَرَجَعْتُ إِلَى مُوسَى، فَقَالَ: رَاجِعْ رَبَّكَ. فَقُلْتُ: اسْتَحْيَيْتُ مِنْ رَبِّي. ثُمَّ انْطَلَقَ بِي حَتَّى انْتَهَى بِي إِلَى سِدْرَةِ الْمُنْتَهَى، وَغَشِيَهَا أَلْوَانٌ لا أَدْرِي مَا هِيَ، ثُمَّ أُدْخِلْتُ الْجَنَّةَ، فَإِذَا فِيهَا (حَبَائِلُ) - وَفِي رِوَايَةٍ: جَنَابِذُ - اللُّؤْلُؤِ، وَإِذَا تُرَابُهَا الْمِسْكُ.<br>● وَفِي حَدِيثِ ابْنِ عَبَّاسٍ وَأَبِي حَبَّةَ - رضي الله عنهما -: ثُمَّ عُرِجَ بِي حَتَّى ظَهَرْتُ لِمُسْتَوًى أَسْمَعُ فِيهِ صَرِيفَ الأَقْلامِ.<br>● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه - قَالَ: لَيْلَةَ أُسْرِيَ بِرَسُولِ اللهِ ﷺ مِنَ مَسْجِدِ الْكَعْبَةِ جَاءَهُ ثَلاثَةُ نَفَرٍ قَبْلَ أَنْ يُوحَى إِلَيْهِ وَهُوَ نَائِمٌ فِي الْمَسْجِدِ الْحَرَامِ، (فَقَالَ أَوَّلُهُمْ: أَيُّهُمْ هُوَ؟ فَقَالَ أَوْسَطُهُمْ: هُوَ خَيْرُهُمْ. فَقَالَ آخِرُهُمْ: خُذُوا خَيْرَهُمْ). فَكَانَتْ تِلْكَ اللَّيْلَةَ، فَلَمْ يَرَهُمْ حَتَّى أَتَوْهُ لَيْلَةً أُخْرَى فِيمَا يَرَى قَلْبُهُ، وَتَنَامُ عَيْنُهُ وَلا يَنَامُ قَلْبُهُ - وَكَذَلِكَ الأَنْبِيَاءُ تَنَامُ أَعْيُنُهُمْ وَلا تَنَامُ قُلُوبُهُمْ -، فَلَمْ يُكَلِّمُوهُ حَتَّى احْتَمَلُوهُ، فَوَضَعُوهُ عِنْدَ بِئْرِ زَمْزَمَ، فَتَوَلاهُ مِنْهُمْ جِبْرِيلُ، فَشَقَّ جِبْرِيلُ مَا بَيْنَ نَحْرِهِ إِلَى لَبَّتِهِ، حَتَّى فَرَغَ مِنْ صَدْرِهِ وَجَوْفِهِ، فَغَسَلَهُ مِنْ مَاءِ زَمْزَمَ بِيَدِهِ، حَتَّى أَنْقَى جَوْفَهُ، ثُمَّ أُتِيَ بِطَسْتٍ مِنْ ذَهَبٍ فِيهِ تَوْرٌ مِنْ ذَهَبٍ، مَحْشُوًّا إِيمَانًا وَحِكْمَةً، فَحَشَا بِهِ صَدْرَهُ وَلَغَادِيدَهُ - يَعْنِي: عُرُوقَ حَلْقِهِ -، ثُمَّ أَطْبَقَهُ، ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ الدُّنْيَا، فَضَرَبَ بَابًا مِنْ أَبْوَابِهَا، فَنَادَاهُ أَهْلُ السَّمَاءِ: مَنْ هَذَا؟ فَقَالَ: جِبْرِيلُ. قَالُوا: وَمَنْ مَعَكَ؟ قَالَ: مَعِي مُحَمَّدٌ. قَالَ: وَقَدْ بُعِثَ؟ قَالَ: نَعَمْ. قَالُوا: فَمَرْحَبًا بِهِ وَأَهْلاً. فَيَسْتَبْشِرُ بِهِ أَهْلُ السَّمَاءِ، لا يَعْلَمُ أَهْلُ السَّمَاءِ بِمَا يُرِيدُ اللهُ بِهِ فِي الأَرْضِ حَتَّى يُعْلِمَهُمْ، فَوَجَدَ فِي السَّمَاءِ الدُّنْيَا آدَمَ، فَقَالَ لَهُ جِبْرِيلُ: هَذَا أَبُوكَ آدَمُ، فَسَلِّمْ عَلَيْهِ. فَسَلَّمَ عَلَيْهِ، وَرَدَّ عَلَيْهِ آدَمُ، وَقَالَ: مَرْحَبًا وَأَهْلاً بِابْنِي، نِعْمَ الابْنُ أَنْتَ! فَإِذَا هُوَ فِي السَّمَاءِ الدُّنْيَا بِنَهَرَيْنِ يَطَّرِدَانِ، فَقَالَ: مَا هَذَانِ النَّهْرَانِ يَا جِبْرِيلُ؟ قَالَ: هَذَا النِّيلُ وَالْفُرَاتُ، عُنْصُرُهُمَا. ثُمَّ مَضَى بِهِ فِي السَّمَاءِ، فَإِذَا هُوَ بِنَهَرٍ آخَرَ عَلَيْهِ قَصْرٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ، فَضَرَبَ يَدَهُ، فَإِذَا هُوَ مِسْكٌ، قَالَ: مَا هَذَا يَا جِبْرِيلُ؟ قَالَ: هَذَا الْكَوْثَرُ الَّذِي خَبَأَ لَكَ رَبُّكَ. ثُمَّ عَرَجَ بِهِ إِلَى السَّمَاءِ الثَّانِيَةِ...، وَفِيهِ: كُلُّ سَمَاءٍ فِيهَا أَنْبِيَاءُ قَدْ سَمَّاهُمْ، فَأَوْعَيْتُ مِنْهُمْ إِدْرِيسَ فِي الثَّانِيَةِ، وَهَارُونَ فِي الرَّابِعَةِ، وَإِبْرَاهِيمَ فِي السَّادِسَةِ، وَمُوسَى فِي السَّابِعَةِ بِتَفْضِيلِ كَلامِ اللهِ، فَقَالَ مُوسَى: رَبِّ لَمْ أَظُنَّ أَنْ تُرْفَعَ عَلَيَّ أَحَدًا. ثُمَّ عَلا بِهِ فَوْقَ ذَلِكَ بِمَا لا يَعْلَمُهُ إِلا اللهُ، حَتَّى جَاءَ سِدْرَةَ الْمُنْتَهَى، وَدَنَا الْجَبَّارُ رَبُّ الْعِزَّةِ فَتَدَلَّى، حَتَّى كَانَ مِنْهُ قَابَ قَوْسَيْنِ أَوْ أَدْنَى، فَأَوْحَى اللهُ فِيمَا أَوْحَى إِلَيْهِ خَمْسِينَ صَلاةً عَلَى أُمَّتِكَ، كُلَّ يَوْمٍ وَلَيْلَةٍ. ثُمَّ هَبَطَ حَتَّى بَلَغَ مُوسَى، فَاحْتَبَسَهُ مُوسَى، فَقَالَ: يَا مُحَمَّدُ، مَاذَا عَهِدَ إِلَيْكَ رَبُّكَ؟ قَالَ: عَهِدَ إِلَيَّ خَمْسِينَ صَلاةً كُلَّ يَوْمٍ وَلَيْلَةٍ. قَالَ: إِنَّ أُمَّتَكَ لا تَسْتَطِيعُ ذَلِكَ، فَارْجِعْ فَلْيُخَفِّفْ عَنْكَ رَبُّكَ وَعَنْهُمْ. فَالْتَفَتَ النَّبِيُّ ﷺ إِلَى جِبْرِيلَ كَأَنَّهُ يَسْتَشِيرُهُ فِي ذَلِكَ، فَأَشَارَ إِلَيْهِ جِبْرِيلُ: أَنْ نَعَمْ إِنْ شِئْتَ. فَعَلا بِهِ إِلَى الْجَبَّارِ، فَقَالَ - وَهُوَ مَكَانَهُ -: يَا رَبِّ، خَفِّفْ عَنَّا؛ فَإِنَّ أُمَّتِي لا تَسْتَطِيعُ هَذَا. فَوَضَعَ عَنْهُ عَشْرَ صَلَوَاتٍ، ثُمَّ رَجَعَ إِلَى مُوسَى فَاحْتَبَسَهُ، فَلَمْ يَزَلْ يُرَدِّدُهُ مُوسَى إِلَى رَبِّهِ حَتَّى صَارَتْ إِلَى خَمْسِ صَلَوَاتٍ، ثُمَّ احْتَبَسَهُ مُوسَى عِنْدَ الْخَمْسِ، فَقَالَ: يَا مُحَمَّدُ، وَاللهِ لَقَدْ رَاوَدْتُ بَنِي إِسْرَائِيلَ - قَوْمِي - عَلَى أَدْنَى مِنْ هَذَا، فَضَعُفُوا فَتَرَكُوهُ، فَأُمَّتُكَ أَضْعَفُ أَجْسَادًا، وَقُلُوبًا، وَأَبْدَانًا، وَأَبْصَارًا، وَأَسْمَاعًا؛ فَارْجِعْ فَلْيُخَفِّفْ عَنْكَ رَبُّكَ. كُلَّ ذَلِكَ يَلْتَفِتُ النَّبِيُّ ﷺ إِلَى جِبْرِيلَ لِيُشِيرَ عَلَيْهِ، وَلا يَكْرَهُ ذَلِكَ جِبْرِيلُ، فَرَفَعَهُ عِنْدَ الْخَامِسَةِ، فَقَالَ: يَا رَبِّ، إِنَّ أُمَّتِي ضُعَفَاءُ أَجْسَادُهُمْ، وَقُلُوبُهُمْ، وَأَسْمَاعُهُمْ، وَأَبْصَارُهُمْ، وَأَبْدَانُهُمْ؛ فَخَفِّفْ عَنَّا. فَقَالَ الْجَبَّارُ: يَا مُحَمَّدُ. قَالَ: لَبَّيْكَ وَسَعْدَيْكَ. قَالَ: إِنَّهُ لا يُبَدَّلُ الْقَوْلُ لَدَيَّ كَمَا فَرَضْتُهُ عَلَيْكَ فِي أُمِّ الْكِتَابِ. قَالَ: فَكُلُّ حَسَنَةٍ بِعَشْرِ أَمْثَالِهَا؛ فَهِيَ خَمْسُونَ فِي أُمِّ الْكِتَابِ، وَهِيَ خَمْسٌ عَلَيْكَ. فَرَجَعَ إِلَى مُوسَى، فَقَالَ: كَيْفَ فَعَلْتَ؟ فَقَالَ: خَفَّفَ عَنَّا: أَعْطَانَا بِكُلِّ حَسَنَةٍ عَشْرَ أَمْثَالِهَا. قَالَ مُوسَى: قَدْ وَاللهِ رَاوَدْتُ بَنِي إِسْرَائِيلَ عَلَى أَدْنَى مِنْ ذَلِكَ فَتَرَكُوهُ؛ ارْجِعْ إِلَى رَبِّكَ فَلْيُخَفِّفْ عَنْكَ أَيْضًا. قَالَ رَسُولُ اللهِ ﷺ: يَا مُوسَى، قَدْ وَاللهِ اسْتَحْيَيْتُ مِنْ رَبِّي مِمَّا اخْتَلَفْتُ إِلَيْهِ. قَالَ: فَاهْبِطْ بِاسْمِ اللهِ. قَالَ: وَاسْتَيْقَظَ وَهُوَ فِي مَسْجِدِ الْحَرَامِ).<br>(وَفِي رِوَايَةٍ: أَنَّ النَّبِيَّ ﷺ قَالَ: بَيْنَمَا أَنَا أَسِيرُ فِي الْجَنَّةِ إِذَا أَنَا بِنَهَرٍ حَافَّتَاهُ قِبَابُ الدُّرِّ - وَفِي رِوَايَةٍ: اللُّؤْلُؤِ - الْمُجَوَّفِ، قُلْتُ: مَا هَذَا يَا جِبْرِيلُ؟ قَالَ: هَذَا الْكَوْثَرُ الَّذِي أَعْطَاكَ رَبُّكَ. فَإِذَا طِينُهُ - أَوْ طِيبُهُ - مِسْكٌ أَذْفَرُ)."
  },
  {
    "id": 62,
    "book": "كتاب الإيمان",
    "bab": "باب المعراج بالنبي ﷺ بروحه وجسده",
    "text": "عَنْ أَنَسِ بْنِ مَالِكٍ - رضي الله عنه -، عَنْ مَالِكِ بْنِ صَعْصَعَةَ - رضي الله عنه -، قَالَ: قَالَ النَّبِيُّ ﷺ: بَيْنَا أَنَا عِنْدَ الْبَيْتِ (وَفِي رِوَايَةٍ: فِي الْحَطِيمِ مُضْطَجِعًا) بَيْنَ النَّائِمِ وَالْيَقْظَانِ - وَذَكَرَ بَيْنَ الرَّجُلَيْنِ - فَأُتِيتُ بِطَسْتٍ مِنْ ذَهَبٍ مُلِئَ حِكْمَةً وَإِيمَانًا، فَشُقَّ مِنَ النَّحْرِ إِلَى مَرَاقِّ الْبَطْنِ، ثُمَّ غُسِلَ الْبَطْنُ بِمَاءِ زَمْزَمَ، ثُمَّ مُلِئَ حِكْمَةً وَإِيمَانًا - وَفِي رِوَايَةٍ: فَاسْتُخْرِجَ قَلْبِي، فَغُسِلَ قَلْبِي، ثُمَّ حُشِيَ، ثُمَّ أُعِيدَ -، وَأُتِيتُ بِدَابَّةٍ أَبْيَضَ دُونَ الْبَغْلِ وَفَوْقَ الْحِمَارِ: الْبُرَاقُ - وَفِي رِوَايَةٍ: يَضَعُ خَطْوَهُ عِنْدَ أَقْصَى طَرْفِهِ -، فَانْطَلَقْتُ مَعَ جِبْرِيلَ حَتَّى أَتَيْنَا السَّمَاءَ الدُّنْيَا، قِيلَ: مَنْ هَذَا؟ قَالَ: جِبْرِيلُ. قِيلَ: مَنْ مَعَكَ؟ قَالَ: مُحَمَّدٌ. قِيلَ: وَقَدْ أُرْسِلَ إِلَيْهِ؟ قَالَ: نَعَمْ. قِيلَ: مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْتُ عَلَى آدَمَ (وَفِي رِوَايَةٍ: فَقَالَ: هَذَا أَبُوكَ آدَمُ فَسَلِّمْ عَلَيْهِ)، (فَسَلَّمْتُ) (وَفِي رِوَايَةٍ: فَرَدَّ السَّلامَ)، فَقَالَ: مَرْحَبًا بِكَ مِنِ ابْنٍ وَنَبِيٍّ. فَأَتَيْنَا السَّمَاءَ الثَّانِيَةَ، قِيلَ: مَنْ هَذَا؟ قَالَ: جِبْرِيلُ. قِيلَ: مَنْ مَعَكَ؟ قَالَ: مُحَمَّدٌ. قِيلَ: أُرْسِلَ إِلَيْهِ؟ قَالَ: نَعَمْ. قِيلَ: مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْتُ عَلَى عِيسَى وَيَحْيَى - وَفِي رِوَايَةٍ: وَهُمَا ابْنَا خَالَةٍ، (قَالَ: هَذَا يَحْيَى وَعِيسَى فَسَلِّمْ عَلَيْهِمَا. فَسَلَّمْتُ، فَرَدَّا) -، فَقَالا: مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ. فَأَتَيْنَا السَّمَاءَ الثَّالِثَةَ، قِيلَ: مَنْ هَذَا؟ قِيلَ: جِبْرِيلُ. قِيلَ: مَنْ مَعَكَ؟ قِيلَ: مُحَمَّدٌ. قِيلَ: وَقَدْ أُرْسِلَ إِلَيْهِ؟ قِيلَ: نَعَمْ. قِيلَ: مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْتُ عَلَى يُوسُفَ (وَفِي رِوَايَةٍ: فَرَدَّ)، (فَسَلَّمْتُ عَلَيْهِ) قَالَ: هَذَا يُوسُفُ فَسَلِّمْ عَلَيْهِ، فَأَتَيْنَا السَّمَاءَ الرَّابِعَةَ، قِيلَ: مَنْ هَذَا؟ قِيلَ: جِبْرِيلُ. قِيلَ: مَنْ مَعَكَ؟ قِيلَ: مُحَمَّدٌ. قِيلَ: وَقَدْ أُرْسِلَ إِلَيْهِ؟ قِيلَ: نَعَمْ. قِيلَ: مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْتُ عَلَى إِدْرِيسَ (وَفِي رِوَايَةٍ: فَرَدَّ)، (فَسَلَّمْتُ عَلَيْهِ) قَالَ: هَذَا إِدْرِيسُ فَسَلِّمْ عَلَيْهِ، فَأَتَيْنَا السَّمَاءَ الْخَامِسَةَ، قِيلَ: مَنْ هَذَا؟ قِيلَ: جِبْرِيلُ. قِيلَ: وَمَنْ مَعَكَ؟ قِيلَ: مُحَمَّدٌ. قِيلَ: وَقَدْ أُرْسِلَ إِلَيْهِ؟ قَالَ: نَعَمْ. قِيلَ: مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْنَا عَلَى هَارُونَ (وَفِي رِوَايَةٍ: فَرَدَّ)، (فَسَلَّمْتُ عَلَيْهِ) قَالَ: هَذَا هَارُونُ فَسَلِّمْ عَلَيْهِ، فَأَتَيْنَا عَلَى السَّمَاءِ السَّادِسَةِ، قِيلَ: مَنْ مَعَكَ؟ قِيلَ: مُحَمَّدٌ. قِيلَ: وَقَدْ أُرْسِلَ إِلَيْهِ؟ قَالَ: نَعَمْ. قِيلَ: مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْتُ عَلَى مُوسَى (وَفِي رِوَايَةٍ: فَرَدَّ)، فَقَالَ: مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ. فَلَمَّا جَاوَزْتُ بَكَى، فَقِيلَ: مَا أَبْكَاكَ؟ قَالَ: يَا رَبِّ! هَذَا الْغُلامُ الَّذِي بُعِثَ بَعْدِي، يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِهِ أَفْضَلُ مِمَّا يَدْخُلُ مِنْ أُمَّتِي. فَأَتَيْنَا السَّمَاءَ السَّابِعَةَ، قِيلَ: مَنْ هَذَا؟ قِيلَ: جِبْرِيلُ. قِيلَ: مَنْ مَعَكَ؟ قِيلَ: مُحَمَّدٌ. قِيلَ: وَقَدْ أُرْسِلَ إِلَيْهِ؟ مَرْحَبًا بِهِ، وَلَنِعْمَ الْمَجِيءُ جَاءَ. فَأَتَيْتُ عَلَى إِبْرَاهِيمَ (وَفِي رِوَايَةٍ: فَرَدَّ)، (فَسَلَّمْتُ عَلَيْهِ) قَالَ: هَذَا أَبُوكَ فَسَلِّمْ عَلَيْهِ، فَقَالَ: مَرْحَبًا بِكَ مِنِ ابْنٍ وَنَبِيٍّ. فَرُفِعَ لِي الْبَيْتُ الْمَعْمُورُ، فَسَأَلْتُ جِبْرِيلَ، فَقَالَ: هَذَا الْبَيْتُ الْمَعْمُورُ، يُصَلِّي فِيهِ كُلَّ يَوْمٍ سَبْعُونَ أَلْفَ مَلَكٍ، إِذَا خَرَجُوا لَمْ يَعُودُوا إِلَيْهِ آخِرَ مَا عَلَيْهِمْ. وَرُفِعَتْ لِي سِدْرَةُ الْمُنْتَهَى، فَإِذَا نَبْقُهَا كَأَنَّهُ قِلالُ (هَجَرَ)، وَوَرَقُهَا كَأَنَّهُ آذَانُ الْفِيُولِ، فِي أَصْلِهَا أَرْبَعَةُ أَنْهَارٍ: نَهْرَانِ بَاطِنَانِ وَنَهْرَانِ ظَاهِرَانِ، فَسَأَلْتُ جِبْرِيلَ، فَقَالَ: أَمَّا الْبَاطِنَانِ فَفِي الْجَنَّةِ، وَأَمَّا الظَّاهِرَانِ فَالنِّيلُ وَالْفُرَاتُ. - وَفِي رِوَايَةٍ: ثُمَّ أُتِيتُ بِإِنَاءٍ مِنْ خَمْرٍ، وَإِنَاءٍ مِنْ لَبَنٍ، وَإِنَاءٍ مِنْ عَسَلٍ، فَأَخَذْتُ اللَّبَنَ، فَقَالَ: هِيَ الْفِطْرَةُ الَّتِي أَنْتَ عَلَيْهَا وَأُمَّتُكَ -. ثُمَّ فُرِضَتْ عَلَيَّ خَمْسُونَ صَلاةً، فَأَقْبَلْتُ حَتَّى جِئْتُ مُوسَى، فَقَالَ: مَا صَنَعْتَ؟ قُلْتُ: فُرِضَتْ عَلَيَّ خَمْسُونَ صَلاةً. قَالَ: إِنَّا أَعْلَمُ بِالنَّاسِ مِنْكَ، عَالَجْتُ بَنِي إِسْرَائِيلَ أَشَدَّ الْمُعَالَجَةِ، وَإِنَّ أُمَّتَكَ لا تُطِيقُ؛ فَارْجِعْ إِلَى رَبِّكَ فَسَلْهُ. فَرَجَعْتُ فَسَأَلْتُهُ، فَجَعَلَهَا أَرْبَعِينَ، ثُمَّ مِثْلَهُ، ثُمَّ ثَلاثِينَ، ثُمَّ مِثْلَهُ فَجَعَلَ عِشْرِينَ، ثُمَّ مِثْلَهُ فَجَعَلَ عَشْرًا، فَأَتَيْتُ مُوسَى، فَقَالَ مِثْلَهُ، فَجَعَلَهَا خَمْسًا، فَأَتَيْتُ مُوسَى، فَقَالَ: مَا صَنَعْتَ؟ قُلْتُ: جَعَلَهَا خَمْسًا. فَقَالَ مِثْلَهُ، قُلْتُ: سَلَّمْتُ بِخَيْرٍ. - فَنُودِيَ: إِنِّي قَدْ أَمْضَيْتُ فَرِيضَتِي، وَخَفَّفْتُ عَنْ عِبَادِي، وَأَجْزِي الْحَسَنَةَ عَشْرًا.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    "
  },
  {
    "id": 63,
    "book": "كتاب الإيمان",
    "bab": "باب المعراج بالنبي ﷺ بروحه وجسده",
    "text": "عَنْ جَابِرٍ - رضي الله عنه -، قَالَ: سَمِعْتُ النَّبيَّ ﷺ يَقُولُ: «لَمَّا كَذَّبَتْنِي قُرَيْشٌ قُمْتُ فِي الْحِجْرِ، فَجَلَّى اللهُ لِي بَيْتَ الْمَقْدِسِ، فَطَفِقْتُ أُخْبِرُهُمْ عَنْ آيَاتِهِ وَأَنَا أَنْظُرُ إِلَيْهِ»."
  },
  {
    "id": 64,
    "book": "كتاب الإيمان",
    "bab": "باب رؤية النبي ﷺ للأنبياء وغيرهم في الإسراء",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -، عَنِ النَّبِيِّ ﷺ، قَالَ: «رَأَيْتُ لَيْلَةَ أُسْرِيَ بِي مُوسَى: رَجُلاً آدَمَ طُوَالاً جَعْدًا، كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ، وَرَأَيْتُ عِيسَى: رَجُلاً مَرْبُوعًا، مَرْبُوعَ الْخَلْقِ، إِلَى الْحُمْرَةِ وَالْبَيَاضِ، سَبِطَ الرَّأْسِ، وَرَأَيْتُ مَالِكًا خَازِنَ النَّارِ وَالدَّجَّالَ، فِي آيَاتٍ أَرَاهُنَّ اللهُ إِيَّاهُ، ﴿فَلا تَكُنْ فِي مِرْيَةٍ مِنْ لِقَائِهِ﴾»."
  },
  {
    "id": 65,
    "book": "كتاب الإيمان",
    "bab": "باب رؤية النبي ﷺ للأنبياء وغيرهم في الإسراء",
    "text": "عَنْ مُجَاهِدٍ: أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ - رضي الله عنهما - وَذَكَرُوا لَهُ الدَّجَّالَ بَيْنَ عَيْنَيْهِ مَكْتُوبٌ: كَافِرٌ، (أَوْ: ك ف ر -)، قَالَ: لَمْ أَسْمَعْهُ، وَلَكِنَّهُ قَالَ: أَمَّا إِبْرَاهِيمُ فَانْظُرُوا إِلَى صَاحِبِكُمْ، وَأَمَّا مُوسَى فَجَعْدٌ آدَمٌ عَلَى جَمَلٍ أَحْمَرَ، مَخْطُومٍ بِخُلْبَةٍ، كَأَنِّي أَنْظُرُ إِلَيْهِ انْحَدَرَ فِي الْوَادِي. وَفِي رِوَايَةٍ: يُلَبِّي."
  },
  {
    "id": 66,
    "book": "كتاب الإيمان",
    "bab": "باب رؤية النبي ﷺ للأنبياء وغيرهم في الإسراء",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «لَيْلَةَ أُسْرِيَ بِي رَأَيْتُ مُوسَى، وَإِذَا هُوَ رَجُلٌ ضَرْبٌ رَجِلٌ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ، وَرَأَيْتُ عِيسَى فَإِذَا هُوَ رَجُلٌ رَبْعَةٌ أَحْمَرُ كَأَنَّمَا خَرَجَ مِنْ دِيمَاسٍ، وَأَنَا أَشْبَهُ وَلَدِ إِبْرَاهِيمَ بِهِ. ثُمَّ أُتِيتُ بِإِنَاءَيْنِ: فِي أَحَدِهِمَا لَبَنٌ، وَفِي الآخَرِ خَمْرٌ، فَقَالَ: اشْرَبْ أَيَّهُمَا شِئْتَ. فَأَخَذْتُ اللَّبَنَ فَشَرِبْتُهُ، فَقِيلَ: أَخَذْتَ الْفِطْرَةَ - وَفِي رِوَايَةٍ: قَالَ جِبْرِيلُ: الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ -، أَمَا إِنَّكَ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ».<br>● (وَفِي حَدِيثِ ابْنِ عُمَرَ - رضي الله عنهما -: رَأَيْتُ عِيسَى وَمُوسَى وَإِبْرَاهِيمَ، فَأَمَّا عِيسَى: فَأَحْمَرُ جَعْدٌ، عَرِيضُ الصَّدْرِ، وَأَمَّا مُوسَى: فَآدَمُ جَسِيمٌ، سَبِطٌ، كَأَنَّهُ مِنْ رِجَالِ الزُّطِّ)."
  },
  {
    "id": 67,
    "book": "كتاب الإيمان",
    "bab": "باب تَوَافُقِ رُؤَى النَّبِيِّ ﷺ لِعِيسَى وَالدَّجَّالِ فِي الْحَقِيقَةِ وَالْمَنَامِ",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما -، قَالَ: «أَرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فِي الْمَنَامِ، فَإِذَا رَجُلٌ آدَمُ كَأَحْسَنِ مَا يُرَى مِنْ أُدْمِ الرِّجَالِ، تَضْرِبُ لِمَّتُهُ بَيْنَ مَنْكِبَيْهِ - وَفِي رِوَايَةٍ: لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ -، رَجِلُ الشَّعَرِ، يَقْطُرُ رَأْسُهُ مَاءً، وَاضِعًا يَدَيْهِ عَلَى مَنْكِبَيْ رَجُلَيْنِ، وَهُوَ يَطُوفُ بِالْبَيْتِ، فَقُلْتُ: مَنْ هَذَا؟ فَقَالُوا: هَذَا الْمَسِيحُ ابْنُ مَرْيَمَ. ثُمَّ رَأَيْتُ رَجُلاً وَرَاءَهُ جَعْدًا قَطَطًا، أَعْوَرَ الْعَيْنِ الْيُمْنَى - وَفِي رِوَايَةٍ: فَإِذَا رَجُلٌ جَسِيمٌ أَحْمَرُ - وَفِي رِوَايَةٍ: كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ -، كَأَشْبَهِ مَنْ رَأَيْتُ بِابْنِ قَطَنٍ، وَاضِعًا يَدَيْهِ عَلَى مَنْكِبَيْ رَجُلٍ، يَطُوفُ بِالْبَيْتِ، فَقُلْتُ: مَنْ هَذَا؟ قَالُوا: الْمَسِيحُ الدَّجَّالُ»."
  },
  {
    "id": 68,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: ﴿لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى﴾",
    "text": "عَنِ الشَّيْبَانِيِّ، قَالَ: سَأَلْتُ زِرًّا عَنْ قَوْلِهِ تَعَالَى: ﴿فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى * فَأَوْحَى إِلَى عَبْدِهِ مَا أَوْحَى﴾. قَالَ: أَخْبَرَنَا عَبْدُ اللهِ: أَنَّ مُحَمَّدًا ﷺ رَأَى جِبْرِيلَ لَهُ سِتُّ مِائَةِ جَنَاحٍ.<br>وَفِي رِوَايَةٍ: ﴿لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى﴾، قَالَ: رَأَى رَفْرَفًا أَخْضَرَ سَدَّ أُفُقَ السَّمَاءِ."
  },
  {
    "id": 69,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: ﴿لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى﴾",
    "text": "عَنْ مَسْرُوقٍ، قَالَ: قُلْتُ لِعَائِشَةَ - رضي الله عنها -: يَا أُمَّتَاهْ! هَلْ رَأَى مُحَمَّدٌ ﷺ رَبَّهُ؟ فَقَالَتْ: لَقَدْ قَفَّ شَعَرِي مِمَّا قُلْتَ! أَيْنَ أَنْتَ مِنْ ثَلاثٍ مَنْ حَدَّثَكَهُنَّ فَقَدْ كَذَبَ؟ مَنْ حَدَّثَكَ أَنَّ مُحَمَّدًا ﷺ رَأَى رَبَّهُ فَقَدْ كَذَبَ. ثُمَّ قَرَأَتْ: ﴿لا تُدْرِكُهُ الأَبْصَارُ وَهُوَ يُدْرِكُ الأَبْصَارَ وَهُوَ اللَّطِيفُ الْخَبِيرُ﴾، ﴿وَمَا كَانَ لِبَشَرٍ أَنْ يُكَلِّمَهُ اللهُ إِلا وَحْيًا أَوْ مِنْ وَرَاءِ حِجَابٍ﴾، وَمَنْ حَدَّثَكَ أَنَّهُ يَعْلَمُ مَا فِي غَدٍ فَقَدْ كَذَبَ. (ثُمَّ قَرَأَتْ: ﴿وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا﴾ - وَفِي رِوَايَةٍ: وَهُوَ يَقُولُ: لا يَعْلَمُ الْغَيْبَ إِلا اللهُ -، وَمَنْ حَدَّثَكَ أَنَّهُ كَتَمَ فَقَدْ كَذَبَ. ثُمَّ قَرَأَتْ: ﴿يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ﴾ الآيَةَ، وَلَكِنَّهُ رَأَى جِبْرِيلَ ﷺ فِي صُورَتِهِ مَرَّتَيْنِ.<br>وَفِي رِوَايَةٍ: قَالَتْ: مَنْ زَعَمَ أَنَّ مُحَمَّدًا رَأَى رَبَّهُ فَقَدْ أَعْظَمَ، وَلَكِنْ قَدْ رَأَى جِبْرِيلَ فِي صُورَتِهِ وَخَلْقِهِ سَادًّا مَا بَيْنَ الأُفُقِ."
  },
  {
    "id": 70,
    "book": "كتاب الإيمان",
    "bab": "باب قول الله تعالى: ﴿وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ * إِلَى رَبِّهَا نَاظِرَةٌ﴾",
    "text": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ - رضي الله عنه -، قَالَ: قُلْنَا: يَا رَسُولَ اللهِ! هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ؟ هَلْ تُضَارُّونَ فِي رُؤْيَةِ الشَّمْسِ وَالْقَمَرِ إِذَا كَانَتْ صَحْوًا؟ قُلْنَا: لا. قَالَ: «فَإِنَّكُمْ لا تُضَارُّونَ فِي رُؤْيَةِ رَبِّكُمْ يَوْمَئِذٍ إِلا كَمَا تُضَارُّونَ فِي رُؤْيَتِهِمَا. ثُمَّ قَالَ: يُنَادِي مُنَادٍ: لِيَذْهَبْ كُلُّ قَوْمٍ إِلَى مَا كَانُوا يَعْبُدُونَ. فَيَذْهَبُ أَصْحَابُ الصَّلِيبِ مَعَ صَلِيبِهِمْ، وَأَصْحَابُ الأَوْثَانِ مَعَ أَوْثَانِهِمْ، وَأَصْحَابُ كُلِّ آلِهَةٍ مَعَ آلِهَتِهِمْ، حَتَّى يَبْقَى مَنْ كَانَ يَعْبُدُ اللهَ مِنْ بَرٍّ أَوْ فَاجِرٍ، وَغُبَّرَاتٌ مِنْ أَهْلِ الْكِتَابِ، ثُمَّ يُؤْتَى بِجَهَنَّمَ تُعْرَضُ كَأَنَّهَا سَرَابٌ، فَيُقَالُ لِلْيَهُودِ: مَا كُنْتُمْ تَعْبُدُونَ؟ قَالُوا: كُنَّا نَعْبُدُ عُزَيْرَ ابْنَ اللهِ. فَيُقَالُ: كَذَبْتُمْ! لَمْ يَكُنْ لِلَّهِ صَاحِبَةٌ وَلا وَلَدٌ، فَمَا تُرِيدُونَ؟ قَالُوا: نُرِيدُ أَنْ تَسْقِيَنَا. فَيُقَالُ: اشْرَبُوا. فَيَتَسَاقَطُونَ فِي جَهَنَّمَ، ثُمَّ يُقَالُ لِلنَّصَارَى: مَا كُنْتُمْ تَعْبُدُونَ؟ فَيُقَالُ: كُنَّا نَعْبُدُ الْمَسِيحَ ابْنَ اللهِ. فَيُقَالُ: كَذَبْتُمْ! لَمْ يَكُنْ لِلَّهِ صَاحِبَةٌ وَلا وَلَدٌ، فَمَا تُرِيدُونَ؟ قَالُوا: نُرِيدُ أَنْ تَسْقِيَنَا. فَيُقَالُ: اشْرَبُوا. فَيَتَسَاقَطُونَ فِي جَهَنَّمَ، حَتَّى يَبْقَى مَنْ كَانَ يَعْبُدُ اللهَ مِنْ بَرٍّ أَوْ فَاجِرٍ، فَيُقَالُ لَهُمْ: مَا يَحْبِسُكُمْ وَقَدْ ذَهَبَ النَّاسُ؟ فَيَقُولُونَ: فَارَقْنَاهُمْ وَنَحْنُ أَحْوَجُ مِنَّا إِلَيْهِ الْيَوْمَ) - وَفِي رِوَايَةٍ: فَارَقْنَا النَّاسَ فِي الدُّنْيَا عَلَى أَفْقَرِ مَا كُنَّا إِلَيْهِمْ وَلَمْ نُصَاحِبْهُمْ -، وَإِنَّا سَمِعْنَا مُنَادِيًا يُنَادِي: لِيَلْحَقْ كُلُّ قَوْمٍ بِمَا كَانُوا يَعْبُدُونَ؛ وَإِنَّمَا نَنْتَظِرُ رَبَّنَا. قَالَ: فَيَأْتِيهِمُ الْجَبَّارُ فِي صُورَةٍ غَيْرِ صُورَتِهِ الَّتِي رَأَوْهُ فِيهَا أَوَّلَ مَرَّةٍ، فَيَقُولُ: أَنَا رَبُّكُمْ. - وَفِي رِوَايَةٍ: فَيَقُولُونَ: لا نُشْرِكُ بِاللهِ شَيْئًا! مَرَّتَيْنِ أَوْ ثَلاثًا -، فَيَقُولُونَ: أَنْتَ رَبُّنَا. فَلا يُكَلِّمُهُ إِلا الأَنْبِيَاءُ، فَيَقُولُ: هَلْ بَيْنَكُمْ وَبَيْنَهُ آيَةٌ تَعْرِفُونَهُ؟ فَيَقُولُونَ: السَّاقُ. فَيَكْشِفُ عَنْ سَاقِهِ، فَيَسْجُدُ لَهُ كُلُّ مُؤْمِنٍ، وَيَبْقَى مَنْ كَانَ يَسْجُدُ لِلَّهِ رِيَاءً وَسُمْعَةً، فَيَذْهَبُ كَيْمَا يَسْجُدَ فَيَعُودُ ظَهْرُهُ طَبَقًا وَاحِدًا، ثُمَّ يُؤْتَى بِالْجَسْرِ، فَيُجْعَلُ بَيْنَ ظَهْرَيْ جَهَنَّمَ. قُلْنَا: يَا رَسُولَ اللهِ، وَمَا الْجِسْرُ؟ قَالَ: مَدْحَضَةٌ مَزِلَّةٌ، عَلَيْهِ خَطَاطِيفُ وَكَلالِيبُ وَحَسَكَةٌ مُفَلْطَحَةٌ لَهَا شَوْكَةٌ عُقَيْفَاءُ تَكُونُ بِنَجْدٍ، يُقَالُ لَهَا: السَّعْدَانُ، الْمُؤْمِنُ عَلَيْهَا كَالطَّرْفِ، وَكَالْبَرْقِ، وَكَالرِّيحِ، وَكَأَجَاوِيدِ الْخَيْلِ وَالرِّكَابِ، فَنَاجٍ مُسَلَّمٌ، وَنَاجٍ مَخْدُوشٌ، وَمَكْدُوسٌ فِي نَارِ جَهَنَّمَ، حَتَّى يَمُرَّ آخِرُهُمْ يُسْحَبُ سَحْبًا، فَمَا أَنْتُمْ بِأَشَدَّ لِي مُنَاشَدَةً فِي الْحَقِّ قَدْ تَبَيَّنَ لَكُمْ مِنَ الْمُؤْمِنِ يَوْمَئِذٍ لِلْجَبَّارِ، وَإِذَا رَأَوْا أَنَّهُمْ قَدْ نَجَوْا فِي إِخْوَانِهِمْ يَقُولُونَ: رَبَّنَا! إِخْوَانُنَا كَانُوا يُصَلُّونَ مَعَنَا، وَيَصُومُونَ مَعَنَا، وَيَعْمَلُونَ مَعَنَا. فَيَقُولُ اللهُ تَعَالَى: اذْهَبُوا فَمَنْ وَجَدْتُمْ فِي قَلْبِهِ مِثْقَالَ دِينَارٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ. وَيُحَرِّمُ اللهُ صُوَرَهُمْ عَلَى النَّارِ، فَيَأْتُونَهُمْ (وَبَعْضُهُمْ قَدْ غَابَ فِي النَّارِ إِلَى قَدَمِهِ، وَإِلَى أَنْصَافِ سَاقَيْهِ)، فَيُخْرِجُونَ مَنْ عَرَفُوا، ثُمَّ يَعُودُونَ، فَيَقُولُ: اذْهَبُوا فَمَنْ وَجَدْتُمْ فِي قَلْبِهِ مِثْقَالَ نِصْفِ دِينَارٍ فَأَخْرِجُوهُ. فَيُخْرِجُونَ مَنْ عَرَفُوا، ثُمَّ يَعُودُونَ، فَيَقُولُ: اذْهَبُوا فَمَنْ وَجَدْتُمْ فِي قَلْبِهِ مِثْقَالَ ذَرَّةٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ. فَيُخْرِجُونَ مَنْ عَرَفُوا. - قَالَ أَبُو سَعِيدٍ: فَمَنْ لَمْ يُصَدِّقْنِي فَلْيَقْرَأْ: ﴿إِنَّ اللهَ لا يَظْلِمُ مِثْقَالَ ذَرَّةٍ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا﴾ - فَيَشْفَعُ النَّبِيُّونَ وَالْمَلائِكَةُ وَالْمُؤْمِنُونَ، فَيَقُولُ الْجَبَّارُ: بَقِيَتْ شَفَاعَتِي. فَيَقْبِضُ قَبْضَةً مِنَ النَّارِ، فَيُخْرِجُ أَقْوَامًا قَدِ امْتُحِشُوا، فَيُلْقَوْنَ فِي نَهَرٍ بِأَفْوَاهِ الْجَنَّةِ، يُقَالُ لَهُ: مَاءُ الْحَيَاةِ، فَيَنْبُتُونَ فِي حَافَتَيْهِ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ، قَدْ رَأَيْتُمُوهَا إِلَى جَانِبِ الصَّخْرَةِ، وَإِلَى جَانِبِ الشَّجَرَةِ، فَمَا كَانَ إِلَى الشَّمْسِ مِنْهَا كَانَ أَخْضَرَ، وَمَا كَانَ مِنْهَا إِلَى الظِّلِّ كَانَ أَبْيَضَ، فَيَخْرُجُونَ كَأَنَّهُمُ اللُّؤْلُؤُ، فَيُجْعَلُ فِي رِقَابِهِمُ الْخَوَاتِيمُ، فَيَدْخُلُونَ الْجَنَّةَ، فَيَقُولُ أَهْلُ الْجَنَّةِ: هَؤُلاءِ عُتَقَاءُ الرَّحْمَنِ، أَدْخَلَهُمُ الْجَنَّةَ بِغَيْرِ عَمَلٍ عَمِلُوهُ، وَلا خَيْرٍ قَدَّمُوهُ. فَيُقَالُ لَهُمْ: لَكُمْ مَا رَأَيْتُمْ وَمِثْلُهُ مَعَهُ."
  },
  {
    "id": 71,
    "book": "كتاب الإيمان",
    "bab": "باب قول الله تعالى: ﴿وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ * إِلَى رَبِّهَا نَاظِرَةٌ﴾",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، قَالَ: قَالَ أَنَسٌ: يَا رَسُولَ اللهِ! هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ؟ فَقَالَ: هَلْ تُضَارُّونَ فِي الشَّمْسِ لَيْسَ دُونَهَا سَحَابٌ؟ قَالُوا: لا يَا رَسُولَ اللهِ. قَالَ: هَلْ تُضَارُّونَ فِي الْقَمَرِ لَيْلَةَ الْبَدْرِ لَيْسَ دُونَهُ سَحَابٌ؟ قَالُوا: لا يَا رَسُولَ اللهِ. قَالَ: «فَإِنَّكُمْ تَرَوْنَهُ يَوْمَ الْقِيَامَةِ كَذَلِكَ. يَجْمَعُ اللهُ النَّاسَ، فَيَقُولُونَ: مَنْ كَانَ يَعْبُدُ شَيْئًا فَلْيَتْبَعْهُ. فَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الشَّمْسَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الْقَمَرَ، وَيَتْبَعُ مَنْ كَانَ يَعْبُدُ الطَّوَاغِيتَ، وَتَبْقَى هَذِهِ الأُمَّةُ فِيهَا مُنَافِقُوهَا، فَيَأْتِيهِمُ اللهُ فِي غَيْرِ الصُّورَةِ الَّتِي يَعْرِفُونَ، فَيَقُولُ: أَنَا رَبُّكُمْ. فَيَقُولُونَ: نَعُوذُ بِاللهِ مِنْكَ! هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا، فَإِذَا أَتَانَا رَبُّنَا عَرَفْنَاهُ. فَيَأْتِيهِمُ اللهُ فِي الصُّورَةِ الَّتِي يَعْرِفُونَ، فَيَقُولُ: أَنَا رَبُّكُمْ. فَيَقُولُونَ: أَنْتَ رَبُّنَا. (فَيَتْبَعُونَهُ) وَيُضْرَبُ جِسْرُ جَهَنَّمَ». قَالَ رَسُولُ اللهِ ﷺ: «فَأَكُونُ أَوَّلَ مَنْ يُجِيزُ - وَفِي رِوَايَةٍ: مِنَ الرُّسُلِ بِأُمَّتِهِ، وَلا يَتَكَلَّمُ يَوْمَئِذٍ أَحَدٌ إِلا الرُّسُلُ -، وَدُعَاءُ الرُّسُلِ يَوْمَئِذٍ: اللَّهُمَّ سَلِّمْ سَلِّمْ! وَبِهِ كَلالِيبُ مِثْلُ شَوْكِ السَّعْدَانِ، أَمَا رَأَيْتُمْ شَوْكَ السَّعْدَانِ؟» قَالُوا: بَلَى يَا رَسُولَ اللهِ. قَالَ: «فَإِنَّهَا مِثْلُ شَوْكِ السَّعْدَانِ، غَيْرَ أَنَّهَا لا يَعْلَمُ قَدْرَ عِظَمِهَا إِلا اللهُ، فَتَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ، مِنْهُمُ الْمُوبَقُ بِعَمَلِهِ، وَمِنْهُمُ (الْمُخَرْدَلُ) - وَفِي رِوَايَةٍ: (أَوِ) الْمُجَازَى - ثُمَّ يَنْجُو، (وَفِي رِوَايَةٍ: ثُمَّ يَتَجَلَّى) حَتَّى إِذَا فَرَغَ اللهُ مِنَ الْقَضَاءِ بَيْنَ عِبَادِهِ، وَأَرَادَ أَنْ يُخْرِجَ مِنَ النَّارِ مَنْ أَرَادَ أَنْ يُخْرِجَ مِمَّنْ كَانَ يَشْهَدُ أَنْ لا إِلَهَ إِلا اللهُ؛ أَمَرَ الْمَلائِكَةَ أَنْ يُخْرِجُوهُمْ، فَيَعْرِفُونَهُمْ بِعَلامَةِ آثَارِ السُّجُودِ، وَحَرَّمَ اللهُ عَلَى النَّارِ أَنْ تَأْكُلَ مِنِ ابْنِ آدَمَ أَثَرَ السُّجُودِ، فَيُخْرِجُونَهُمْ قَدِ امْتُحِشُوا، فَيُصَبُّ عَلَيْهِمْ مَاءٌ يُقَالُ لَهُ: مَاءُ الْحَيَاةِ، فَيَنْبُتُونَ نَبَاتَ الْحِبَّةِ فِي حَمِيلِ السَّيْلِ، وَيَبْقَى رَجُلٌ مِنْهُمْ لَمْ يُقَلْ لَهُ: لأَنَّ ثَمَّتَ شَاهِدًا عَلَيْكَ. وَيَتَفَكَّرُ فِي نَفْسِهِ: مَا الَّذِي يَشْهَدُ عَلَيَّ؟ فَيَخْتِمُ عَلَى فِيهِ، وَيُقَالُ لِفَخِذِهِ وَلَحْمِهِ وَعِظَامِهِ: انْطِقِي. فَتَنْطِقُ فَخِذُهُ وَلَحْمُهُ وَعِظَامُهُ بِعَمَلِهِ، وَذَلِكَ لِيُعْذِرَ مِنْ نَفْسِهِ، وَذَلِكَ الْمُنَافِقُ، وَذَلِكَ الَّذِي يَسْخَطُ اللهُ عَلَيْهِ."
  },
  {
    "id": 72,
    "book": "كتاب الإيمان",
    "bab": "باب قول الله تعالى: ﴿وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ * إِلَى رَبِّهَا نَاظِرَةٌ﴾",
    "text": "وَفِي رِوَايَةٍ: «وَيُعْطِي رَبُّهُ مَنْ عُهُودٍ وَمَوَاثِيقَ مَا شَاءَ - فَيَصْرِفُ وَجْهَهُ عَنِ النَّارِ، ثُمَّ يَقُولُ بَعْدَ ذَلِكَ: يَا رَبِّ! قَرِّبْنِي إِلَى بَابِ الْجَنَّةِ! فَيَقُولُ: أَلَيْسَ قَدْ زَعَمْتَ أَنْ لا تَسْأَلَنِي غَيْرَهُ؟ وَيْلَكَ ابْنَ آدَمَ مَا أَغْدَرَكَ! فَلا يَزَالُ يَدْعُو، فَيَقُولُ: لَعَلِّي إِنْ أَعْطَيْتُكَ ذَلِكَ تَسْأَلُنِي غَيْرَهُ؟ فَيَقُولُ: لا وَعِزَّتِكَ! لا أَسْأَلُكَ غَيْرَهُ. فَيُعْطِي اللهَ - وَفِي رِوَايَةٍ: مَا شَاءَ - مِنْ عُهُودٍ وَمَوَاثِيقَ أَنْ لا يَسْأَلَهُ غَيْرَهُ، فَيُقَرِّبُهُ إِلَى بَابِ الْجَنَّةِ -. فَيَقِفُ إِلَى بَابِ الْجَنَّةِ- فَتَنْفَهْتُ لَهُ الْجَنَّةُ، فَيَرَى مَا فِيهَا مِنَ الْحَبْرَةِ وَالسُّرُورِ -، فَإِذَا رَأَى مَا فِيهَا سَكَتَ مَا شَاءَ اللهُ أَنْ يَسْكُتَ، ثُمَّ يَقُولُ: رَبِّ أَدْخِلْنِي الْجَنَّةَ! ثُمَّ يَقُولُ: أَوَلَيْسَ قَدْ زَعَمْتَ أَنْ لا تَسْأَلَنِي غَيْرَهُ؟ وَيْلَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ! فَيَقُولُ: يَا رَبِّ! لا تَجْعَلْنِي أَشْقَى خَلْقِكَ! فَلا يَزَالُ يَدْعُو حَتَّى يَضْحَكَ، فَإِذَا ضَحِكَ مِنْهُ أَذِنَ لَهُ بِالدُّخُولِ فِيهَا، فَإِذَا دَخَلَ فِيهَا قِيلَ لَهُ: تَمَنَّ مِنْ كَذَا! فَيَتَمَنَّى، ثُمَّ يُقَالُ لَهُ: تَمَنَّ مِنْ كَذَا! فَيَتَمَنَّى، حَتَّى تَنْقَطِعَ بِهِ الأَمَانِيُّ، فَيَقُولُ لَهُ: هَذَا لَكَ وَمِثْلُهُ مَعَهُ». قَالَ أَبُو هُرَيْرَةَ - رضي الله عنه -: وَذَلِكَ الرَّجُلُ آخِرُ أَهْلِ الْجَنَّةِ دُخُولاً.<br>وَفِي رِوَايَةٍ: قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ لأَبِي هُرَيْرَةَ: إِنَّ رَسُولَ اللهِ ﷺ قَالَ: «قَالَ اللهُ: لَكَ ذَلِكَ وَعَشَرَةُ أَمْثَالِهِ». قَالَ أَبُو هُرَيْرَةَ: لَمْ أَحْفَظْ مِنَ رَسُولِ اللهِ ﷺ إِلا قَوْلَهُ: «لَكَ ذَلِكَ وَمِثْلُهُ مَعَهُ». قَالَ أَبُو سَعِيدٍ: إِنِّي سَمِعْتُهُ يَقُولُ: «لَكَ ذَلِكَ وَعَشَرَةُ أَمْثَالِهِ».<br>عَنْ أَبِي مُوسَى - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: «جَنَّتَانِ مِنْ فِضَّةٍ آنِيَتُهُمَا وَمَا فِيهِمَا، وَجَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهُمَا وَمَا فِيهِمَا، وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلا رِدَاءُ الْكِبْرِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍ»."
  },
  {
    "id": 73,
    "book": "كتاب الإيمان",
    "bab": "باب خروج الموحدين من النار",
    "text": "عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ - رضي الله عنه -: قَالَ النَّبِيُّ ﷺ: «إِنِّي لأَعْلَمُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْهَا، وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولاً: رَجُلٌ يَخْرُجُ مِنَ النَّارِ كَبْوًا، فَيَقُولُ اللهُ: اذْهَبْ فَادْخُلِ الْجَنَّةَ! فَيَأْتِيهَا، فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى، فَيَرْجِعُ فَيَقُولُ: يَا رَبِّ وَجَدْتُهَا مَلأَى! فَيَقُولُ: اذْهَبْ فَادْخُلِ الْجَنَّةَ! فَيَأْتِيهَا، فَيُخَيَّلُ إِلَيْهِ أَنَّهَا مَلأَى، فَيَرْجِعُ فَيَقُولُ: يَا رَبِّ وَجَدْتُهَا مَلأَى! فَيَقُولُ: اذْهَبْ فَادْخُلِ الْجَنَّةَ! فَإِنَّ لَكَ مِثْلَ الدُّنْيَا وَعَشَرَةَ أَمْثَالِهَا - أَوْ: إِنَّ لَكَ مِثْلَ عَشَرَةِ أَمْثَالِ الدُّنْيَا -، فَيَقُولُ: تَسْخَرُ مِنِّي، أَوْ: تَضْحَكُ مِنِّي وَأَنْتَ الْمَلِكُ؟!» فَلَقَدْ رَأَيْتُ رَسُولَ اللهِ ﷺ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ، وَكَانَ يَقُولُ: «ذَاكَ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً»."
  },
  {
    "id": 74,
    "book": "كتاب الإيمان",
    "bab": "باب خروج الموحدين من النار",
    "text": "عَنْ عِمْرَانَ بْنِ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرٍ - رضي الله عنهم -: أَنَّ النَّبِيَّ ﷺ قَالَ: «يَخْرُجُ مِنَ النَّارِ بِالشَّفَاعَةِ كَأَنَّهُمُ الثَّعَارِيرُ». قُلْتُ: مَا الثَّعَارِيرُ؟ قَالَ: «الضَّغَابِيسُ». وَكَانَ قَدْ سَقَطَ فَمُهُ.<br>= قَالَ: رَبِّ! أَخْرِجْنِي، فَيَقُولُ: ابْنُ آدَمَ، مَا يَعْرِينِي مِنْكَ؟ أَيُرْضِيكَ أَنْ أُعْطِيَكَ الدُّنْيَا وَمِثْلَهَا مَعَهَا؟ قَالَ: يَا رَبِّ! أَتَسْتَهْزِئُ مِنِّي وَأَنْتَ رَبُّ الْعَالَمِينَ؟ فَضَحِكَ ابْنُ مَسْعُودٍ، فَقَالَ: أَلا تَسْأَلُونِي مِمَّ أَضْحَكُ؟ فَقَالُوا: مِمَّ تَضْحَكُ؟ قَالَ: هَكَذَا ضَحِكَ رَسُولُ اللهِ ﷺ، فَقَالُوا: مِمَّ تَضْحَكُ يَا رَسُولَ اللهِ؟ قَالَ: «مِنْ ضَحِكِ رَبِّ الْعَالَمِينَ حِينَ قَالَ: أَتَسْتَهْزِئُ مِنِّي وَأَنْتَ رَبُّ الْعَالَمِينَ؟ فَيَقُولُ: إِنِّي لا أَسْتَهْزِئُ مِنْكَ، وَلَكِنِّي عَلَى مَا أَشَاءُ قَادِرٌ». وَفِي رِوَايَةٍ: فَيَذْهَبُ فَيَدْخُلُ الْجَنَّةَ، فَيَجِدُ النَّاسَ قَدْ أَخَذُوا الْمَنَازِلَ، فَيُقَالُ لَهُ: أَتَذْكُرُ الزَّمَانَ الَّذِي كُنْتَ فِيهِ؟ فَيَقُولُ: نَعَمْ. فَيُقَالُ لَهُ: تَمَنَّ! فَيَتَمَنَّى، فَيُقَالُ لَهُ: لَكَ الَّذِي تَمَنَّيْتَ وَعَشَرَةُ أَضْعَافِ الدُّنْيَا. قَالَ: ثُمَّ يَدْخُلُ بَيْتَهُ، فَتَدْخُلُ عَلَيْهِ زَوْجَتَاهُ مِنَ الْحُورِ الْعِينِ، فَتَقُولانِ: الْحَمْدُ لِلَّهِ الَّذِي أَحْيَاكَ لَنَا وَأَحْيَانَا لَكَ. قَالَ: فَيَقُولُ: مَا أُعْطِيَ أَحَدٌ مِثْلَ مَا أُعْطِيتُ."
  },
  {
    "id": 75,
    "book": "كتاب الإيمان",
    "bab": "باب خروج الموحدين من النار",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ أُتِيَ بِلَحْمٍ، فَرُفِعَ إِلَيْهِ الذِّرَاعُ - وَكَانَتْ تُعْجِبُهُ - فَنَهَشَ مِنْهَا نَهْشَةً، ثُمَّ قَالَ: «أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ، وَهَلْ تَدْرُونَ مِمَّ ذَلِكَ؟ يَجْمَعُ اللهُ الأَوَّلِينَ وَالآخِرِينَ فِي صَعِيدٍ وَاحِدٍ، يُسْمِعُهُمُ الدَّاعِي، وَيَنْفُذُهُمُ الْبَصَرُ، وَتَدْنُو الشَّمْسُ، فَيَبْلُغُ النَّاسُ مِنَ الْغَمِّ وَالْكَرْبِ مَا لا يُطِيقُونَ وَلا يَحْتَمِلُونَ، فَيَقُولُ النَّاسُ: أَلا تَرَوْنَ مَا قَدْ بَلَغَكُمْ؟ أَلا تَنْظُرُونَ مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ؟ فَيَقُولُ بَعْضُ النَّاسِ لِبَعْضٍ: عَلَيْكُمْ بِآدَمَ. فَيَأْتُونَ آدَمَ ﷺ فَيَقُولُونَ لَهُ: أَنْتَ أَبُو الْبَشَرِ، خَلَقَكَ اللهُ بِيَدِهِ، وَنَفَخَ فِيكَ مِنْ رُوحِهِ، وَأَمَرَ الْمَلائِكَةَ فَسَجَدُوا لَكَ (وَفِي رِوَايَةٍ: وَأَسْكَنَكَ الْجَنَّةَ)، اشْفَعْ لَنَا إِلَى رَبِّكَ! أَلا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ أَلا تَرَى إِلَى مَا قَدْ بَلَغَنَا؟ فَيَقُولُ آدَمُ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنَّهُ قَدْ نَهَانِي عَنِ الشَّجَرَةِ فَعَصَيْتُهُ، نَفْسِي نَفْسِي! اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى نُوحٍ. فَيَأْتُونَ نُوحًا، فَيَقُولُونَ: يَا نُوحُ! إِنَّكَ أَنْتَ أَوَّلُ الرُّسُلِ إِلَى أَهْلِ الأَرْضِ، وَقَدْ سَمَّاكَ اللهُ عَبْدًا شَكُورًا؛ اشْفَعْ لَنَا إِلَى رَبِّكَ! أَلا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ فَيَقُولُ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنَّهُ قَدْ كَانَتْ لِي دَعْوَةٌ دَعَوْتُهَا عَلَى قَوْمِي، نَفْسِي نَفْسِي! اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى إِبْرَاهِيمَ. فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُونَ: يَا إِبْرَاهِيمُ! أَنْتَ نَبِيُّ اللهِ وَخَلِيلُهُ مِنْ أَهْلِ الأَرْضِ؛ اشْفَعْ لَنَا إِلَى رَبِّكَ! أَلا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ فَيَقُولُ لَهُمْ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنِّي قَدْ كُنْتُ كَذَبْتُ ثَلاثَ كَذَبَاتٍ، نَفْسِي نَفْسِي! اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى مُوسَى. فَيَأْتُونَ مُوسَى، فَيَقُولُونَ: يَا مُوسَى! أَنْتَ رَسُولُ اللهِ، فَضَّلَكَ اللهُ بِرِسَالَتِهِ وَبِكَلامِهِ عَلَى النَّاسِ؛ اشْفَعْ لَنَا إِلَى رَبِّكَ! أَلا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ فَيَقُولُ: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ، وَإِنِّي قَدْ قَتَلْتُ نَفْسًا لَمْ أُومَرْ بِقَتْلِهَا، نَفْسِي نَفْسِي! اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى عِيسَى ابْنِ مَرْيَمَ. فَيَأْتُونَ عِيسَى، فَيَقُولُونَ: يَا عِيسَى! أَنْتَ رَسُولُ اللهِ، وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ، وَكَلَّمْتَ النَّاسَ فِي الْمَهْدِ صَبِيًّا؛ اشْفَعْ لَنَا إِلَى رَبِّكَ! أَلا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ فَيَقُولُ عِيسَى: إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ قَطُّ، وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ - وَلَمْ يَذْكُرْ ذَنْبًا -، نَفْسِي نَفْسِي! اذْهَبُوا إِلَى غَيْرِي، اذْهَبُوا إِلَى مُحَمَّدٍ. فَيَأْتُونَ مُحَمَّدًا فَيَقُولُونَ: يَا مُحَمَّدُ! أَنْتَ رَسُولُ اللهِ، وَخَاتَمُ الأَنْبِيَاءِ، وَقَدْ غَفَرَ اللهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ؛ اشْفَعْ لَنَا إِلَى رَبِّكَ! أَلا تَرَى إِلَى مَا نَحْنُ فِيهِ؟ فَأَنْطَلِقُ فَآتِي تَحْتَ الْعَرْشِ، فَأَقَعُ سَاجِدًا لِرَبِّي عَزَّ وَجَلَّ، ثُمَّ يَفْتَحُ اللهُ عَلَيَّ مِنْ مَحَامِدِهِ وَحُسْنِ الثَّنَاءِ عَلَيْهِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى أَحَدٍ قَبْلِي، ثُمَّ يُقَالُ: يَا مُحَمَّدُ! ارْفَعْ رَأْسَكَ - وَفِي رِوَايَةٍ: وَقُلْ يُسْمَعْ لَكَ -، سَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ. فَأَرْفَعُ رَأْسِي، فَأَقُولُ: أُمَّتِي يَا رَبِّ، أُمَّتِي يَا رَبِّ، أُمَّتِي يَا رَبِّ! فَيُقَالُ: يَا مُحَمَّدُ! أَدْخِلْ مِنْ أُمَّتِكَ مَنْ لا حِسَابَ عَلَيْهِمْ مِنَ الْبَابِ الأَيْمَنِ مِنْ أَبْوَابِ الْجَنَّةِ، وَهُمْ شُرَكَاءُ النَّاسِ فِيمَا سِوَى ذَلِكَ مِنَ الأَبْوَابِ. ثُمَّ قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ! إِنَّ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ كَمَا بَيْنَ مَكَّةَ (وَحِمْيَرَ)، أَوْ كَمَا بَيْنَ مَكَّةَ وَبُصْرَى.<br>● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: فَيُقَالُ: انْطَلِقْ فَأَخْرِجْ مِنْهَا مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ شَعِيرَةٍ مِنْ إِيمَانٍ. فَأَنْطَلِقُ فَأَفْعَلُ، ثُمَّ أَعُودُ فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ يُسْمَعْ لَكَ، وَسَلْ تُعْطَ، وَاشْفَعْ تُشَفَّعْ. فَأَقُولُ: يَا رَبِّ، أُمَّتِي أُمَّتِي. فَيُقَالُ: انْطَلِقْ فَأَخْرِجْ مِنْهَا مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ أَوْ خَرْدَلَةٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ. فَأَنْطَلِقُ فَأَفْعَلُ، ثُمَّ أَعُودُ فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ يُسْمَعْ، وَسَلْ تُعْطَ، وَاشْفَعْ تُشَفَّعْ. فَأَقُولُ: يَا رَبِّ، أُمَّتِي أُمَّتِي. فَيُقَالُ: انْطَلِقْ فَأَخْرِجْ مَنْ كَانَ فِي قَلْبِهِ أَدْنَى أَدْنَى أَدْنَى مِثْقَالِ حَبَّةِ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنَ النَّارِ. فَأَنْطَلِقُ فَأَفْعَلُ، ثُمَّ أَعُودُ الرَّابِعَةَ، فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ، ثُمَّ أَخِرُّ لَهُ سَاجِدًا، فَيُقَالُ: يَا مُحَمَّدُ، ارْفَعْ رَأْسَكَ، وَقُلْ يُسْمَعْ، وَسَلْ تُعْطَهْ، وَاشْفَعْ تُشَفَّعْ. فَأَقُولُ: يَا رَبِّ، ائْذَنْ لِي فِيمَنْ قَالَ لا إِلَهَ إِلا اللهُ. فَيَقُولُ: وَعِزَّتِي، وَجَلالِي، وَكِبْرِيَائِي، وَعَظَمَتِي، لأُخْرِجَنَّ مِنْهَا مَنْ قَالَ: لا إِلَهَ إِلا اللهُ.<br>وَفِي رِوَايَةٍ: فَأَقُولُ لأَدَمَ: (وَعَلَّمَكَ أَسْمَاءَ كُلِّ شَيْءٍ). وَفِيهَا: فَيَأْتُونِي فَأَقُولُ: أَنَا لَهَا.، فَأَنْطَلِقُ حَتَّى أَسْتَأْذِنَ عَلَى رَبِّي، فَيُؤْذَنَ لِي، فَإِذَا رَأَيْتُ رَبِّي وَقَعْتُ سَاجِدًا، فَيَدَعُنِي مَا شَاءَ اللهُ...، ثُمَّ أَعُودُ الرَّابِعَةَ، فَأَقُولُ: مَا بَقِيَ فِي النَّارِ إِلا مَنْ حَبَسَهُ الْقُرْآنُ (وَوَجَبَ عَلَيْهِ الْخُلُودُ). (وَفِي رِوَايَةٍ مُعَلَّقَةٍ: ثُمَّ تَلا هَذِهِ الآيَةَ: ﴿عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا﴾، قَالَ: وَهَذَا الْمَقَامُ الْمَحْمُودُ الَّذِي وَعَدَهُ نَبِيُّكُمْ ﷺ).<br>وَفِي رِوَايَةٍ: يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لا إِلَهَ إِلا اللهُ وَفِي قَلْبِهِ وَزْنُ شَعِيرَةٍ مِنْ خَيْرٍ، وَيَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لا إِلَهَ إِلا اللهُ وَفِي قَلْبِهِ وَزْنُ بُرَّةٍ مِنْ خَيْرٍ، وَيَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لا إِلَهَ إِلا اللهُ وَفِي قَلْبِهِ وَزْنُ ذَرَّةٍ مِنْ خَيْرٍ.<br>● (وَفِي حَدِيثِ ابْنِ عُمَرَ - رضي الله عنهما -: إِنَّ الشَّمْسَ تَدْنُو يَوْمَ الْقِيَامَةِ حَتَّى يَبْلُغَ الْعَرَقُ نِصْفَ الأُذُنِ، فَبَيْنَا هُمْ كَذَلِكَ اسْتَغَاثُوا بِآدَمَ، ثُمَّ بِمُوسَى، ثُمَّ بِمُحَمَّدٍ ﷺ - وَفِي رِوَايَةٍ: قَالَ ابْنُ عُمَرَ: إِنَّ النَّاسَ يَصِيرُونَ يَوْمَ الْقِيَامَةِ جُثًا، كُلُّ أُمَّةٍ تَتْبَعُ نَبِيَّهَا يَقُولُونَ: يَا فُلانُ! اشْفَعْ. حَتَّى تَنْتَهِيَ الشَّفَاعَةُ إِلَى النَّبِيِّ ﷺ، فَيَشْفَعُ لِيُقْضَى بَيْنَ الْخَلْقِ، فَيَمْشِي حَتَّى يَأْخُذَ بِحَلْقَةِ الْبَابِ، فَيَوْمَئِذٍ يَبْعَثُهُ اللهُ مَقَامًا مَحْمُودًا، يَحْمَدُهُ أَهْلُ الْجَمْعِ كُلُّهُمْ)."
  },
  {
    "id": 76,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: لكل نبي دعوة مستجابة",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ يَدْعُو بِهَا، وَأُرِيدُ - وَفِي رِوَايَةٍ: إِنْ شَاءَ اللهُ - أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لأُمَّتِي فِي الآخِرَةِ. وَفِي رِوَايَةٍ: يَوْمَ الْقِيَامَةِ»."
  },
  {
    "id": 77,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: ﴿إِنْ هُوَ إِلا نَذِيرٌ لَكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ﴾",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -، قَالَ: لَمَّا نَزَلَتْ: ﴿وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ﴾ وَرَهْطَكَ مِنْهُمُ الْمُخْلَصِينَ؛ خَرَجَ رَسُولُ اللهِ ﷺ حَتَّى صَعِدَ الصَّفَا، فَهَتَفَ: «يَا صَبَاحَاهْ!» فَقَالُوا: مَنْ هَذَا؟ (وَفِي رِوَايَةٍ: جَعَلَ يُنَادِي: يَا بَنِي فِهْرٍ، يَا بَنِي عَدِيٍّ! - لِبُطُونِ قُرَيْشٍ -، فَجَعَلَ الرَّجُلُ إِذَا لَمْ يَسْتَطِعْ أَنْ يَخْرُجَ أَرْسَلَ رَسُولاً)، فَاجْتَمَعُوا إِلَيْهِ، فَقَالَ: «أَرَأَيْتُمْ إِنْ أَخْبَرْتُكُمْ أَنَّ خَيْلاً تَخْرُجُ مِنْ سَفْحِ هَذَا الْجَبَلِ، أَكُنْتُمْ مُصَدِّقِيَّ؟» قَالُوا: مَا جَرَّبْنَا عَلَيْكَ كَذِبًا. قَالَ: «فَإِنِّي نَذِيرٌ لَكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ». قَالَ أَبُو لَهَبٍ: تَبًّا لَكَ! مَا جَمَعْتَنَا إِلا لِهَذَا؟ ثُمَّ قَامَ، فَنَزَلَتْ: ﴿تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ * وَقَدْ تَبَّ﴾. هَكَذَا قَرَأَهَا الأَعْمَشُ يَوْمَئِذٍ. إِلَى آخِرِهَا."
  },
  {
    "id": 78,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: ﴿إِنْ هُوَ إِلا نَذِيرٌ لَكُمْ بَيْنَ يَدَيْ عَذَابٍ شَدِيدٍ﴾",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، قَالَ: قَامَ رَسُولُ اللهِ ﷺ حِينَ أُنْزِلَ عَلَيْهِ: ﴿وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ﴾ فَقَالَ: «يَا مَعْشَرَ قُرَيْشٍ! - أَوْ كَلِمَةً نَحْوَهَا - اشْتَرُوا أَنْفُسَكُمْ، لا أُغْنِي عَنْكُمْ مِنَ اللهِ شَيْئًا. - وَفِي رِوَايَةٍ: يَا بَنِي عَبْدِ الْمُطَّلِبِ! اشْتَرُوا أَنْفُسَكُمْ مِنَ اللهِ - يَا بَنِي عَبْدِ مَنَافٍ! لا أُغْنِي عَنْكُمْ مِنَ اللهِ شَيْئًا. يَا عَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ! لا أُغْنِي عَنْكَ مِنَ اللهِ شَيْئًا. وَيَا صَفِيَّةُ عَمَّةَ رَسُولِ اللهِ! لا أُغْنِي عَنْكِ مِنَ اللهِ شَيْئًا، وَيَا فَاطِمَةُ بِنْتَ مُحَمَّدٍ! سَلِينِي مَا شِئْتِ مِنْ مَالِي، لا أُغْنِي عَنْكِ مِنَ اللهِ شَيْئًا»."
  },
  {
    "id": 79,
    "book": "كتاب الإيمان",
    "bab": "بابٌ: مَنْ حَقَّقَ التَّوْحِيدَ دَخَلَ الْجَنَّةَ بِغَيْرِ حِسَابٍ",
    "text": "عَنْ حُصَيْنٍ، عَنْ عَامِرٍ، عَنْ (عِمْرَانَ)، قَالَ: لا رُقْيَةَ إِلا مِنْ عَيْنٍ أَوْ حُمَةٍ. فَذَكَرْتُهُ لِسَعِيدِ بْنِ جُبَيْرٍ، فَقَالَ: حَدَّثَنَا ابْنُ عَبَّاسٍ - رضي الله عنهما -: قَالَ رَسُولُ اللهِ ﷺ: «عُرِضَتْ عَلَيَّ الأُمَمُ، فَجَعَلَ النَّبِيُّ وَالنَّبِيَّانِ يَمُرُّونَ مَعَهُمُ الرَّهْطُ، وَالنَّبِيُّ لَيْسَ مَعَهُ أَحَدٌ، حَتَّى رُفِعَ لِي سَوَادٌ عَظِيمٌ، قُلْتُ: مَا هَذَا؟ أُمَّتِي هَذِهِ؟ قِيلَ: بَلْ هَذَا مُوسَى وَقَوْمُهُ. قِيلَ: انْظُرْ إِلَى الأُفُقِ. فَإِذَا سَوَادٌ يَمْلأُ الأُفُقَ، ثُمَّ قِيلَ لِي: انْظُرْ هَا هُنَا وَهَا هُنَا فِي آفَاقِ السَّمَاءِ. فَإِذَا سَوَادٌ قَدْ مَلأَ الأُفُقَ، قِيلَ: هَذِهِ أُمَّتُكَ، وَيَدْخُلُ الْجَنَّةَ مِنْ هَؤُلاءِ سَبْعُونَ أَلْفًا بِغَيْرِ حِسَابٍ». ثُمَّ دَخَلَ وَلَمْ يُبَيِّنْ لَهُمْ، فَأَفَاضَ الْقَوْمُ وَقَالُوا: (نَحْنُ الَّذِينَ آمَنَّا بِاللهِ وَاتَّبَعْنَا رَسُولَهُ، فَنَحْنُ هُمْ؟ أَوْ أَوْلادُنَا الَّذِينَ وُلِدُوا فِي الإِسْلامِ؟ فَإِنَّا وُلِدْنَا فِي الْجَاهِلِيَّةِ)، فَبَلَغَ النَّبِيَّ ﷺ، فَخَرَجَ، فَقَالَ: «هُمُ الَّذِينَ لا يَسْتَرْقُونَ، وَلا يَتَطَيَّرُونَ، وَلا يَكْتَوُونَ، وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ». فَقَالَ عُكَّاشَةُ بْنُ مِحْصَنٍ: أَمِنْهُمْ أَنَا يَا رَسُولَ اللهِ؟ قَالَ: «نَعَمْ». فَقَامَ آخَرُ، فَقَالَ: أَمِنْهُمْ أَنَا؟ قَالَ: «سَبَقَكَ بِهَا عُكَّاشَةُ».<br>● وَفِي حَدِيثِ سَهْلِ بْنِ سَعْدٍ - رضي الله عنه -: «لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا، أَوْ: سَبْعُ مِائَةِ أَلْفٍ، مُتَمَاسِكُونَ، آخِذٌ بَعْضُهُمْ بَعْضًا، لا يَدْخُلُ أَوَّلُهُمْ حَتَّى يَدْخُلَ آخِرُهُمْ، وُجُوهُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ»."
  },
  {
    "id": 80,
    "book": "كتاب الإيمان",
    "bab": "باب قول النبي ﷺ: «لا يَدْخُلُ الْجَنَّةَ إِلا نَفْسٌ مُسْلِمَةٌ»",
    "text": "عَنِ ابْنِ مَسْعُودٍ - رضي الله عنه -، قَالَ: كُنَّا مَعَ النَّبِيِّ ﷺ فِي قُبَّةٍ، فَقَالَ: «أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ؟» قُلْنَا: نَعَمْ. قَالَ: «أَتَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ؟» قُلْنَا: نَعَمْ. قَالَ: «أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ؟» قُلْنَا: نَعَمْ. قَالَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ! إِنِّي لأَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ، وَذَلِكَ أَنَّ الْجَنَّةَ لا يَدْخُلُهَا إِلا نَفْسٌ مُسْلِمَةٌ، وَمَا أَنْتُمْ فِي أَهْلِ الشِّرْكِ إِلا كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ، أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الأَحْمَرِ»."
  },
  {
    "id": 81,
    "book": "كتاب الإيمان",
    "bab": "باب إثبات النداء والصوف لله ﷺ بما يليق بجلاله",
    "text": "عَنْ أَبِي سَعِيدٍ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: يَقُولُ اللهُ: يَا آدَمُ! فَيَقُولُ: لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ فِي يَدَيْكَ! قَالَ: يَقُولُ: (وَفِي رِوَايَةٍ: فَيُنَادِي بِصَوْتٍ): أَخْرِجْ بَعْثَ النَّارِ. قَالَ: وَمَا بَعْثُ النَّارِ؟ قَالَ: مِنْ كُلِّ أَلْفٍ تِسْعَ مِائَةٍ وَتِسْعَةً وَتِسْعِينَ. فَذَاكَ حِينَ يَشِيبُ الصَّغِيرُ، وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللهِ شَدِيدٌ». فَاشْتَدَّ ذَلِكَ عَلَيْهِمْ، فَقَالُوا: يَا رَسُولَ اللهِ! أَيُّنَا ذَلِكَ الرَّجُلُ؟ قَالَ: «أَبْشِرُوا! فَإِنَّ مِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفًا وَمِنْكُمْ رَجُلٌ.. وَفِي رِوَايَةٍ: ثُمَّ قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ! إِنِّي أَرْجُو أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ. فَكَبَّرْنَا.. ثُمَّ قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ! إِنِّي لأَطْمَعُ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ. قَالَ: فَحَمِدْنَا اللهَ وَكَبَّرْنَا، ثُمَّ قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ! إِنِّي لأَطْمَعُ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ، إِنَّ مَثَلَكُمْ فِي الأُمَمِ كَمَثَلِ الشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الأَسْوَدِ، أَوِ الرَّقْمَةِ فِي ذِرَاعِ الْحِمَارِ. وَفِي رِوَايَةٍ: أَوِ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ ثَوْرٍ أَبْيَضَ.<br>● (وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَوَّلُ مَنْ يُدْعَى يَوْمَ الْقِيَامَةِ آدَمُ، فَتَرَاءَى ذُرِّيَّتُهُ، فَيُقَالُ: هَذَا أَبُوكُمْ آدَمُ)."
  },
  {
    "id": 82,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: لا تقبل صلاة بغير طهور",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «لا يَقْبَلُ اللهُ صَلاةَ أَحَدِكُمْ إِذَا أَحْدَثَ حَتَّى يَتَوَضَّأَ».<br>● (وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه - قَالَ: كَانَ النَّبِيُّ ﷺ يَتَوَضَّأُ عِنْدَ كُلِّ صَلاةٍ)."
  },
  {
    "id": 83,
    "book": "كتاب الوضوء",
    "bab": "باب الاستجمار وترًا",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَجْعَلْ فِي أَنْفِهِ مَاءً ثُمَّ لِيَنْثِرْ، وَمَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وَإِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ؛ فَإِنَّ أَحَدَكُمْ لا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ»."
  },
  {
    "id": 84,
    "book": "كتاب الوضوء",
    "bab": "باب ما يقول عند الخلاء",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، قَالَ: كَانَ النَّبِيُّ ﷺ إِذَا دَخَلَ (وَفِي رِوَايَةٍ مُعَلَّقَةٍ: إِذَا أَرَادَ أَنْ يَدْخُلَ) الْخَلاءَ قَالَ: «اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ»."
  },
  {
    "id": 85,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: لا تستقبل القبلة بغائط أو بول إلا عند البناء",
    "text": "عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ - رضي الله عنه -: أَنَّ النَّبِيَّ ﷺ قَالَ: «إِذَا أَتَيْتُمُ الْغَائِطَ فَلا تَسْتَقْبِلُوا الْقِبْلَةَ وَلا تَسْتَدْبِرُوهَا، وَلَكِنْ شَرِّقُوا أَوْ غَرِّبُوا». قَالَ أَبُو أَيُّوبَ: فَقَدِمْنَا الشَّأْمَ، فَوَجَدْنَا مَرَاحِيضَ بُنِيَتْ قِبَلَ الْقِبْلَةِ؛ فَنَنْحَرِفُ وَنَسْتَغْفِرُ اللهَ تَعَالَى."
  },
  {
    "id": 86,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: لا تستقبل القبلة بغائط أو بول إلا عند البناء",
    "text": "عَنْ وَاسِعِ بْنِ حَبَّانَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ - رضي الله عنهما -: أَنَّهُ كَانَ يَقُولُ: إِنَّ نَاسًا يَقُولُونَ: إِذَا قَعَدْتَ عَلَى حَاجَتِكَ فَلا تَسْتَقْبِلِ الْقِبْلَةَ وَلا بَيْتَ الْمَقْدِسِ! فَقَالَ عَبْدُ اللهِ بْنُ عُمَرَ: لَقَدِ ارْتَقَيْتُ يَوْمًا عَلَى ظَهْرِ بَيْتٍ لَنَا، فَرَأَيْتُ رَسُولَ اللهِ ﷺ عَلَى لَبِنَتَيْنِ مُسْتَقْبِلاً بَيْتَ الْمَقْدِسِ لِحَاجَتِهِ. وَفِي رِوَايَةٍ: مُسْتَدْبِرَ الْقِبْلَةِ."
  },
  {
    "id": 87,
    "book": "كتاب الوضوء",
    "bab": "باب البول في الماء الدائم",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّهُ سَمِعَ رَسُولَ اللهِ ﷺ يَقُولُ: «لا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ الَّذِي لا يَجْرِي ثُمَّ يَغْتَسِلُ فِيهِ»."
  },
  {
    "id": 88,
    "book": "كتاب الوضوء",
    "bab": "باب البول قائمًا وقاعدًا",
    "text": "عَنْ أَبِي وَائِلٍ، قَالَ: كَانَ أَبُو مُوسَى - رضي الله عنه - يُشَدِّدُ فِي الْبَوْلِ، وَيَقُولُ: إِنَّ بَنِي إِسْرَائِيلَ كَانَ إِذَا أَصَابَ ثَوْبَ أَحَدِهِمْ قَرَضَهُ. فَقَالَ حُذَيْفَةُ - رضي الله عنه -: لَيْتَهُ أَمْسَكَ! أَتَى رَسُولُ اللهِ ﷺ سُبَاطَةَ قَوْمٍ، فَبَالَ قَائِمًا.<br>وَفِي رِوَايَةٍ: رَأَيْتُنِي أَنَا وَالنَّبِيَّ ﷺ نَتَمَاشَى، فَأَتَى سُبَاطَةَ قَوْمٍ خَلْفَ حَائِطٍ، فَقَامَ كَمَا يَقُومُ أَحَدُكُمْ، فَانْتَبَذْتُ مِنْهُ، فَأَشَارَ إِلَيَّ فَجِئْتُهُ، فَقُمْتُ عِنْدَ عَقِبِهِ حَتَّى فَرَغَ، وَفِي رِوَايَةٍ: (ثُمَّ دَعَا بِمَاءٍ، فَجِئْتُهُ بِمَاءٍ فَتَوَضَّأَ)."
  },
  {
    "id": 89,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: من الكبائر أن لا يستتر من بوله",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -، قَالَ: مَرَّ النَّبِيُّ ﷺ عَلَى قَبْرَيْنِ، فَقَالَ: «إِنَّهُمَا لَيُعَذَّبَانِ، وَمَا يُعَذَّبَانِ مِنْ كَبِيرٍ. ثُمَّ قَالَ: بَلَى؛ أَمَّا أَحَدُهُمَا فَكَانَ يُسَمَّى بِالنَّمِيمَةِ، وَأَمَّا الآخَرُ فَكَانَ لا يَسْتَتِرُ مِنْ بَوْلِهِ». قَالَ: ثُمَّ أَخَذَ عُودًا رَطْبًا، فَكَسَرَهُ بِاثْنَتَيْنِ، ثُمَّ غَرَزَ كُلَّ وَاحِدٍ مِنْهُمَا عَلَى قَبْرٍ، ثُمَّ قَالَ: «لَعَلَّهُ يُخَفَّفُ عَنْهُمَا مَا لَمْ يَيْبَسَا»."
  },
  {
    "id": 90,
    "book": "كتاب الوضوء",
    "bab": "باب النهي عن الاستنجاء باليمين",
    "text": "عَنْ أَبِي قَتَادَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «إِذَا بَالَ أَحَدُكُمْ فَلا يَأْخُذَنَّ ذَكَرَهُ بِيَمِينِهِ، وَلا يَسْتَنْجِ بِيَمِينِهِ، وَلا يَتَنَفَّسْ فِي الإِنَاءِ»."
  },
  {
    "id": 91,
    "book": "كتاب الوضوء",
    "bab": "باب الاستنجاء بالماء",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، قَالَ: كَانَ النَّبِيُّ ﷺ إِذَا خَرَجَ لِحَاجَتِهِ أَجِيءُ أَنَا وَغُلامٌ مَعَنَا إِدَاوَةٌ مِنْ مَاءٍ - وَفِي رِوَايَةٍ: وَعَنَزَةٌ -. يَعْنِي: يَسْتَنْجِي بِهِ."
  },
  {
    "id": 92,
    "book": "كتاب الوضوء",
    "bab": "باب الاستنجاء بالحجارة",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّهُ كَانَ يَحْمِلُ مَعَ النَّبِيِّ ﷺ إِدَاوَةً لِوَضُوئِهِ وَحَاجَتِهِ، فَبَيْنَمَا هُوَ يَتْبَعُهُ بِهَا - وَفِي رِوَايَةٍ: فَكَانَ لا يَلْتَفِتُ، فَدَنَوْتُ مِنْهُ -، فَقَالَ: «مَنْ هَذَا؟» فَقَالَ: أَنَا أَبُو هُرَيْرَةَ. فَقَالَ: «ابْغِنِي أَحْجَارًا أَسْتَنْفِضْ بِهَا، وَلا تَأْتِنِي بِعَظْمٍ وَلا بِرَوْثَةٍ». فَأَتَيْتُهُ بِأَحْجَارٍ أَحْمِلُهَا فِي طَرَفِ ثَوْبِي حَتَّى وَضَعْتُهَا إِلَى جَنْبِهِ، ثُمَّ انْصَرَفْتُ - وَفِي رِوَايَةٍ: وَأَعْرَضْتُ عَنْهُ، فَلَمَّا قَضَى أَتْبَعْتُهُ بِهِنَّ -، حَتَّى إِذَا فَرَغَ مَشَيْتُ، فَقُلْتُ: مَا بَالُ الْعَظْمِ وَالرَّوْثَةِ؟ قَالَ: «هُمَا مِنْ طَعَامِ الْجِنِّ، وَإِنَّهُ أَتَانِي وَفْدُ جِنِّ (نَصِيبِينَ) - وَنِعْمَ الْجِنُّ -، فَسَأَلُونِي الزَّادَ، وَشِمَالاً، ثُمَّ أَقْبَلَ، فَلَمَّا انْتَهَى إِلَى الْحَجَرَتَيْنِ، بَارَكَ، هَلْ رَأَيْتَ مَقَامِي، فَلْكَ: نَعَمْ يَا رَسُولَ اللهِ. قَالَ: فَانْطَلَقَ إِلَى الْحَجَرَتَيْنِ، فَاقْطَعْ مِنْ كُلِّ وَاحِدَةٍ مِنْهُمَا غُصْنًا، فَأَقْبَلَ بِهِمَا، حَتَّى إِذَا قُمْتَ مَقَامِي فَأَرْسِلْ غُصْنًا عَنْ يَمِينِكَ، وَغُصْنًا عَنْ يَسَارِكَ. قَالَ جَابِرٌ: فَقُمْتُ، فَأَخَذْتُ حَجَرًا فَكَسَرْتُهُ، وَحَسَرْتُهُ، فَانْطَلَقْتُ لِي، فَأَتَيْتُ الشَّجَرَتَيْنِ فَقَطَعْتُ مِنْ كُلِّ وَاحِدَةٍ مِنْهُمَا غُصْنًا، ثُمَّ أَقْبَلْتُ أَجُرُّهُمَا، حَتَّى قُمْتُ مَقَامَ رَسُولِ اللهِ ﷺ، أَرْسَلْتُ غُصْنًا عَنْ يَمِينِي، وَغُصْنًا عَنْ يَسَارِي، ثُمَّ لَحِقْتُهُ، فَقُلْتُ: قَدْ فَعَلْتُ يَا رَسُولَ اللهِ، فَعَمَّ ذَاكَ؟ قَالَ: «إِنِّي مَرَرْتُ بِقَبْرَيْنِ يُعَذَّبَانِ، فَأَحْبَبْتُ بِشَفَاعَتِي أَنْ يُرَفَّهَ عَنْهُمَا مَا دَامَ الْغُصْنَانِ رَطْبَيْنِ».<br>● (وَفِي حَدِيثِ ابْنِ مَسْعُودٍ - رضي الله عنه -، قَالَ: أَتَى النَّبِيُّ ﷺ الْغَائِطَ، فَأَمَرَنِي أَنْ آتِيَهُ بِثَلاثَةِ أَحْجَارٍ، فَوَجَدْتُ حَجَرَيْنِ، وَالْتَمَسْتُ الثَّالِثَ فَلَمْ أَجِدْهُ، فَأَخَذْتُ رَوْثَةً، فَأَتَيْتُهُ بِهَا، فَأَخَذَ الْحَجَرَيْنِ، وَأَلْقَى الرَّوْثَةَ، وَقَالَ: هَذَا رِكْسٌ)."
  },
  {
    "id": 93,
    "book": "كتاب الوضوء",
    "bab": "باب جلود الميتة",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -: أَنَّ رَسُولَ اللهِ ﷺ مَرَّ بِشَاةٍ مَيِّتَةٍ - وَفِي رِوَايَةٍ: أُعْطِيَتْهَا مَوْلاةٌ لِمَيْمُونَةَ مِنَ الصَّدَقَةِ -، فَقَالَ: «هَلا اسْتَمْتَعْتُمْ بِإِهَابِهَا؟» قَالُوا: إِنَّهَا مَيْتَةٌ! قَالَ: «إِنَّمَا حَرُمَ أَكْلُهَا»."
  },
  {
    "id": 94,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: إذا ولغ الكلب في الإناء",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «إِذَا شَرِبَ الْكَلْبُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَغْسِلْهُ سَبْعًا»."
  },
  {
    "id": 95,
    "book": "كتاب الوضوء",
    "bab": "باب التيمن في الوضوء والغسل",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كَانَ النَّبِيُّ ﷺ يُحِبُّ التَّيَمُّنَ مَا اسْتَطَاعَ فِي شَأْنِهِ كُلِّهِ، فِي طُهُورِهِ، وَتَرَجُّلِهِ، وَتَنَعُّلِهِ."
  },
  {
    "id": 96,
    "book": "كتاب الوضوء",
    "bab": "باب الوضوء ثلاثًا ثلاثًا",
    "text": "عَنْ حُمْرَانَ - مَوْلَى عُثْمَانَ بْنِ عَفَّانَ -: أَنَّهُ رَأَى عُثْمَانَ - رضي الله عنه - دَعَا بِوَضُوءٍ، فَأَفْرَغَ عَلَى يَدَيْهِ مِنْ إِنَائِهِ، فَغَسَلَهُمَا ثَلاثَ مَرَّاتٍ، ثُمَّ أَدْخَلَ يَمِينَهُ فِي الْوَضُوءِ، ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ وَاسْتَنْثَرَ، ثُمَّ غَسَلَ وَجْهَهُ ثَلاثًا، وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلاثًا، ثُمَّ غَسَلَ يَدَهُ الْيُمْنَى، ثُمَّ غَسَلَ يَدَهُ الْيُسْرَى -، ثُمَّ مَسَحَ بِرَأْسِهِ، وَفِي رِوَايَةٍ: إِلَى الْكَفَّيْنِ. وَفِي رِوَايَةٍ: ثُمَّ غَسَلَ كُلَّ رِجْلٍ ثَلاثًا -، ثُمَّ قَالَ: رَأَيْتُ النَّبِيَّ ﷺ يَتَوَضَّأُ نَحْوَ وُضُوئِي هَذَا، وَقَالَ: «مَنْ تَوَضَّأَ نَحْوَ وُضُوئِي هَذَا، ثُمَّ صَلَّى رَكْعَتَيْنِ لا يُحَدِّثُ فِيهِمَا نَفْسَهُ؛ غُفِرَ اللهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ».<br>وَفِي رِوَايَةٍ: مِنْ تَوَضَّأَ مِثْلَ هَذَا الْوُضُوءِ، ثُمَّ أَتَى الْمَسْجِدَ، (فَرَكَعَ رَكْعَتَيْنِ، ثُمَّ جَلَسَ)، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ. (قَالَ: وَقَالَ النَّبِيُّ ﷺ: لا تَغْتَرُّوا)."
  },
  {
    "id": 97,
    "book": "كتاب الوضوء",
    "bab": "باب من توضأ مرتين مرتين أو مرة مرة",
    "text": "عَنْ عَبْدِ اللهِ بْنِ زَيْدٍ - رضي الله عنه -: أَنَّهُ سُئِلَ: كَيْفَ رَأَيْتَ النَّبِيَّ ﷺ يَتَوَضَّأُ؟ فَدَعَا بِتَوْرٍ مِنْ مَاءٍ، فَكَفَأَ عَلَى يَدَيْهِ، فَغَسَلَهُمَا ثَلاثَ مِرَارٍ، ثُمَّ أَدْخَلَ يَدَهُ فِي التَّوْرِ، فَمَضْمَضَ وَاسْتَنْثَرَ ثَلاثَ مَرَّاتٍ مِنْ غَرْفَةٍ وَاحِدَةٍ، ثُمَّ أَدْخَلَ يَدَهُ فَاعْتَرَفَ بِهَا، فَغَسَلَ وَجْهَهُ ثَلاثَ مَرَّاتٍ، ثُمَّ غَسَلَ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ مَرَّتَيْنِ مَرَّتَيْنِ، ثُمَّ أَخَذَ بِيَدِهِ مَاءً، فَمَسَحَ رَأْسَهُ - وَفِي رِوَايَةٍ: مَرَّةً وَاحِدَةً - فَأَدْبَرَ بِهِ وَأَقْبَلَ، ثُمَّ غَسَلَ رِجْلَيْهِ - وَفِي رِوَايَةٍ: إِلَى الْكَعْبَيْنِ -، فَقَالَ: هَكَذَا رَأَيْتُ النَّبِيَّ ﷺ يَتَوَضَّأُ.<br>(وَفِي رِوَايَةٍ: أَنَّ النَّبِيَّ ﷺ تَوَضَّأَ مَرَّتَيْنِ مَرَّتَيْنِ).<br>● (وَفِي حَدِيثِ ابْنِ عَبَّاسٍ - رضي الله عنهما -: تَوَضَّأَ النَّبِيُّ ﷺ مَرَّةً مَرَّةً)."
  },
  {
    "id": 98,
    "book": "كتاب الوضوء",
    "bab": "باب الاستنثار ثلاثًا عند الاستيقاظ من النوم",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ (فَتَوَضَّأَ) فَلْيَسْتَنْثِرْ ثَلاثًا؛ فَإِنَّ الشَّيْطَانَ يَبِيتُ عَلَى خَيْشُومِهِ»."
  },
  {
    "id": 99,
    "book": "كتاب الوضوء",
    "bab": "باب فضل الوضوء، والغر المحجلون من آثار الوضوء",
    "text": "عَنْ نُعَيْمٍ الْمُجْمِرِ - رضي الله عنه -، قَالَ: رَقِيتُ مَعَ أَبِي هُرَيْرَةَ - رضي الله عنه - (عَلَى ظَهْرِ الْمَسْجِدِ)، فَتَوَضَّأَ، فَقَالَ: إِنِّي سَمِعْتُ النَّبِيَّ ﷺ يَقُولُ: «إِنَّ أُمَّتِي يُدْعَوْنَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ آثَارِ الْوُضُوءِ. فَمَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يُطِيلَ غُرَّتَهُ فَلْيَفْعَلْ»."
  },
  {
    "id": 100,
    "book": "كتاب الوضوء",
    "bab": "باب منتهى الحلية",
    "text": "عَنْ أَبِي زُرْعَةَ، قَالَ: دَخَلْتُ مَعَ أَبِي هُرَيْرَةَ - رضي الله عنه - (دَارًا بِالْمَدِينَةِ، فَدَعَا بِتَوْرٍ مِنْ مَاءٍ)، فَتَوَضَّأَ حَتَّى بَلَغَ إِبْطَهُ، فَقُلْتُ: يَا أَبَا هُرَيْرَةَ! أَشَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللهِ ﷺ؟ قَالَ: مُنْتَهَى الْحِلْيَةِ."
  },
  {
    "id": 101,
    "book": "كتاب الوضوء",
    "bab": "باب الوضوء بالمد",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، قَالَ: كَانَ النَّبِيُّ ﷺ يَغْتَسِلُ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ، وَيَتَوَضَّأُ بِالْمُدِّ."
  },
  {
    "id": 102,
    "book": "كتاب الوضوء",
    "bab": "باب غسل الأعقاب",
    "text": "عَنِ ابْنِ عَمْرٍو - رضي الله عنهما -، قَالَ: تَخَلَّفَ عَنَّا النَّبِيُّ ﷺ فِي سَفْرَةٍ سَافَرْنَاهَا، فَأَدْرَكَنَا وَقَدْ أَرْهَقَتْنَا الصَّلاةُ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ: «وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ!» (مَرَّتَيْنِ أَوْ ثَلاثًا).<br>● وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَسْبِغُوا الْوُضُوءَ؛ فَإِنَّ أَبَا الْقَاسِمِ ﷺ قَالَ: «وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ»."
  },
  {
    "id": 103,
    "book": "كتاب الوضوء",
    "bab": "باب المسح على الخفين",
    "text": "عَنِ الْمُغِيرَةِ - رضي الله عنه -، قَالَ: كُنْتُ مَعَ النَّبِيِّ ﷺ ذَاتَ لَيْلَةٍ فِي سَفَرٍ - وَفِي رِوَايَةٍ: فِي غَزْوَةِ تَبُوكَ -، فَقَالَ: «أَمَعَكَ مَاءٌ؟» قُلْتُ: نَعَمْ. فَنَزَلَ عَنْ رَاحِلَتِهِ، فَمَشَى حَتَّى تَوَارَى عَنِّي فِي سَوَادِ اللَّيْلِ، ثُمَّ جَاءَ فَأَفْرَغْتُ عَلَيْهِ الإِدَاوَةَ، فَغَسَلَ وَجْهَهُ وَيَدَيْهِ (فَمَضْمَضَ وَاسْتَنْشَقَ)، وَعَلَيْهِ جُبَّةٌ مِنْ صُوفٍ - وَفِي رِوَايَةٍ: شَآمِيَّةٌ -، فَلَمْ يَسْتَطِعْ أَنْ يُخْرِجَ ذِرَاعَيْهِ مِنْهَا، حَتَّى أَخْرَجَهُمَا مِنْ أَسْفَلِ الْجُبَّةِ، فَغَسَلَ ذِرَاعَيْهِ، ثُمَّ مَسَحَ بِرَأْسِهِ، ثُمَّ أَهْوَيْتُ لأَنْزِعَ خُفَّيْهِ، فَقَالَ: «دَعْهُمَا؛ فَإِنِّي أَدْخَلْتُهُمَا طَاهِرَتَيْنِ». فَمَسَحَ عَلَيْهِمَا. وَفِي رِوَايَةٍ: ثُمَّ صَلَّى."
  },
  {
    "id": 104,
    "book": "كتاب الوضوء",
    "bab": "باب المسح على الخفين",
    "text": "عَنْ هَمَّامِ بْنِ الْحَارِثِ، قَالَ: رَأَيْتُ جَرِيرَ بْنَ عَبْدِ اللهِ - رضي الله عنه - بَالَ، ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ، (ثُمَّ قَامَ فَصَلَّى)، فَقِيلَ، فَقَالَ: رَأَيْتُ النَّبِيَّ ﷺ صَنَعَ مِثْلَ هَذَا."
  },
  {
    "id": 105,
    "book": "كتاب الوضوء",
    "bab": "باب المسح على الخفين",
    "text": "عَنْ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ - رضي الله عنه -، قَالَ: رَأَيْتُ النَّبِيَّ ﷺ يَمْسَحُ عَلَى عِمَامَتِهِ وَخُفَّيْهِ."
  },
  {
    "id": 106,
    "book": "كتاب الوضوء",
    "bab": "باب غسل المذي والوضوء منه",
    "text": "عَنْ عَلِيٍّ - رضي الله عنه -، قَالَ: كُنْتُ رَجُلاً مَذَّاءً، فَأَمَرْتُ رَجُلاً - وَفِي رِوَايَةٍ: الْمِقْدَادَ - أَنْ يَسْأَلَ النَّبِيَّ ﷺ؛ لِمَكَانِ ابْنَتِهِ، فَسَأَلَ، فَقَالَ: «تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ»."
  },
  {
    "id": 107,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: نوم الجالس لا ينقض الوضوء",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، قَالَ: أُقِيمَتِ الصَّلاةُ وَرَجُلٌ يُنَاجِي رَسُولَ اللهِ ﷺ، فَمَا زَالَ يُنَاجِيهِ حَتَّى نَامَ أَصْحَابُهُ، ثُمَّ قَامَ فَصَلَّى."
  },
  {
    "id": 108,
    "book": "كتاب الوضوء",
    "bab": "باب من لم يتوضأ مما مست النار",
    "text": "عَنْ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ - رضي الله عنه -، قَالَ: رَأَيْتُ رَسُولَ اللهِ ﷺ يَحْتَزُّ مِنْ كَتِفِ شَاةٍ، فَأَكَلَ مِنْهَا، فَدُعِيَ إِلَى الصَّلاةِ، فَقَامَ، فَطَرَحَ السِّكِّينَ، فَصَلَّى، وَلَمْ يَتَوَضَّأْ.<br>● (وَفِي حَدِيثِ جَابِرٍ - رضي الله عنه -: أَنَّهُ سُئِلَ عَنِ الْوُضُوءِ مِمَّا مَسَّتِ النَّارُ، فَقَالَ: لا؛ قَدْ كُنَّا زَمَانَ النَّبِيِّ ﷺ لا نَجِدُ مِثْلَ ذَلِكَ مِنَ الطَّعَامِ إِلا قَلِيلاً، فَإِذَا نَحْنُ وَجَدْنَاهُ لَمْ يَكُنْ لَنَا مَنَادِيلُ إِلا أَكُفَّنَا وَسَوَاعِدَنَا وَأَقْدَامَنَا، ثُمَّ نُصَلِّي وَلا نَتَوَضَّأُ)."
  },
  {
    "id": 109,
    "book": "كتاب الوضوء",
    "bab": "باب المضمضة بعد الطعام",
    "text": "عَنِ ابْنِ عَبَّاسٍ - رضي الله عنهما -: أَنَّ رَسُولَ اللهِ ﷺ شَرِبَ لَبَنًا، فَمَضْمَضَ، وَقَالَ: «إِنَّ لَهُ دَسَمًا».<br>● (وَفِي حَدِيثِ سُوَيْدِ بْنِ النُّعْمَانِ - رضي الله عنه - وَكَانَ مِنْ أَصْحَابِ الشَّجَرَةِ -: أَنَّهُ خَرَجَ مَعَ رَسُولِ اللهِ ﷺ عَامَ خَيْبَرَ، حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ - وَهِيَ أَدْنَى خَيْبَرَ -، فَصَلَّى الْعَصْرَ، ثُمَّ دَعَا بِالأَزْوَادِ، فَلَمْ يُؤْتَ إِلا بِالسَّوِيقِ، فَأَمَرَ بِهِ فَثُرِّيَ، فَأَكَلَ رَسُولُ اللهِ ﷺ وَأَكَلْنَا، ثُمَّ قَامَ إِلَى الْمَغْرِبِ فَمَضْمَضَ، وَمَضْمَضْنَا، ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ)."
  },
  {
    "id": 110,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: لا يتوضأ من الشك حتى يستيقن",
    "text": "عَنْ عَبْدِ اللهِ بْنِ زَيْدٍ - رضي الله عنه -: أَنَّهُ شَكَا إِلَى رَسُولِ اللهِ ﷺ الرَّجُلَ الَّذِي يُخَيَّلُ إِلَيْهِ أَنَّهُ يَجِدُ الشَّيْءَ فِي الصَّلاةِ، فَقَالَ: «لا يَنْفَتِلْ - أَوْ: لا يَنْصَرِفْ - حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا»."
  },
  {
    "id": 111,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: إنما الماء من الماء",
    "text": "عَنْ أَبِي سَعِيدٍ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ أَرْسَلَ إِلَى رَجُلٍ مِنَ الأَنْصَارِ، فَجَاءَ وَرَأْسُهُ يَقْطُرُ، فَقَالَ النَّبِيُّ ﷺ: «لَعَلَّنَا أَعْجَلْنَاكَ!» فَقَالَ: نَعَمْ. فَقَالَ رَسُولُ اللهِ ﷺ: «إِذَا أُعْجِلْتَ أَوْ قُحِطْتَ فَعَلَيْكَ الْوُضُوءُ»."
  },
  {
    "id": 112,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: إنما الماء من الماء",
    "text": "عَنْ أُبَيِّ بْنِ كَعْبٍ - رضي الله عنه -: أَنَّهُ قَالَ: يَا رَسُولَ اللهِ! إِذَا جَامَعَ الرَّجُلُ الْمَرْأَةَ فَلَمْ يُنْزِلْ؟ قَالَ: «يَغْسِلُ مَا مَسَّ الْمَرْأَةَ مِنْهُ، ثُمَّ يَتَوَضَّأُ وَيُصَلِّي»."
  },
  {
    "id": 113,
    "book": "كتاب الوضوء",
    "bab": "باب نسخ إنما الماء من الماء",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «إِذَا جَلَسَ بَيْنَ شُعَبِهَا الأَرْبَعِ، ثُمَّ جَهَدَهَا؛ فَقَدْ وَجَبَ الْغُسْلُ»."
  },
  {
    "id": 114,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: إذا احتلمت المرأة",
    "text": "عَنْ أُمِّ سَلَمَةَ - رضي الله عنها -، قَالَتْ: جَاءَتْ أُمُّ سُلَيْمٍ إِلَى رَسُولِ اللهِ ﷺ، فَقَالَتْ: يَا رَسُولَ اللهِ! إِنَّ اللهَ لا يَسْتَحْيِي مِنَ الْحَقِّ، فَهَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا احْتَلَمَتْ؟ فَقَالَ النَّبِيُّ ﷺ: «إِذَا رَأَتِ الْمَاءَ». (فَغَطَّتْ أُمُّ سَلَمَةَ - تَعْنِي: وَجْهَهَا -، وَفِي رِوَايَةٍ: فَضَحِكَتْ)، وَقَالَتْ: يَا رَسُولَ اللهِ! وَتَحْتَلِمُ الْمَرْأَةُ؟ قَالَ: «نَعَمْ، تَرِبَتْ يَمِينُكِ! فَبِمَ يُشْبِهُهَا وَلَدُهَا؟»."
  },
  {
    "id": 115,
    "book": "كتاب الوضوء",
    "bab": "باب صفة الغسل من الجنابة",
    "text": "عَنْ مَيْمُونَةَ - رضي الله عنها -، قَالَتْ: وَضَعَ رَسُولُ اللهِ ﷺ وَضُوءًا لِجَنَابَةٍ - وَفِي رِوَايَةٍ: فَسَتَرْتُهُ (بِثَوْبٍ) -، فَأَكْفَأَ بِيَمِينِهِ عَلَى شِمَالِهِ مَرَّتَيْنِ أَوْ ثَلاثًا، ثُمَّ غَسَلَ فَرْجَهُ، ثُمَّ ضَرَبَ يَدَهُ بِالأَرْضِ (أَوِ الْحَائِطِ مَرَّتَيْنِ أَوْ ثَلاثًا)، ثُمَّ مَضْمَضَ وَاسْتَنْشَقَ، وَغَسَلَ وَجْهَهُ وَذِرَاعَيْهِ - وَفِي رِوَايَةٍ: تَوَضَّأَ وُضُوءَهُ لِلصَّلاةِ غَيْرَ رِجْلَيْهِ -، ثُمَّ أَفَاضَ عَلَى رَأْسِهِ الْمَاءَ - وَفِي رِوَايَةٍ: ثَلاثًا -، ثُمَّ غَسَلَ جَسَدَهُ، ثُمَّ تَنَحَّى فَغَسَلَ رِجْلَيْهِ. قَالَتْ: فَأَتَيْتُهُ بِخِرْقَةٍ فَلَمْ يُرِدْهَا، فَجَعَلَ يَنْفُضُ بِيَدِهِ.<br>● (وَفِي حَدِيثِ عَائِشَةَ - رضي الله عنها -: أَنَّ النَّبِيَّ ﷺ كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاةِ، ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ، فَيُخَلِّلُ بِهَا أُصُولَ شَعَرِهِ، ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلاثَ غُرَفٍ بِيَدَيْهِ - وَفِي رِوَايَةٍ: يُخَلِّلُ بِيَدِهِ شَعَرُهُ، حَتَّى إِذَا ظَنَّ أَنْ قَدْ أَرْوَى بَشَرَتَهُ أَفَاضَ عَلَيْهِ الْمَاءَ ثَلاثَ مَرَّاتٍ -، ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ)."
  },
  {
    "id": 116,
    "book": "كتاب الوضوء",
    "bab": "باب الغسل بالصاع ونحوه",
    "text": "عَنْ أَبِي سَلَمَةَ، قَالَ: دَخَلْتُ أَنَا وَأَخُو عَائِشَةَ عَلَى عَائِشَةَ - رضي الله عنها -، فَسَأَلَهَا أَخُوهَا عَنْ غُسْلِ النَّبِيِّ ﷺ، فَدَعَتْ بِإِنَاءٍ نَحْوًا مِنْ صَاعٍ، فَاغْتَسَلَتْ وَأَفَاضَتْ عَلَى رَأْسِهَا، وَبَيْنَنَا وَبَيْنَهَا حِجَابٌ."
  },
  {
    "id": 117,
    "book": "كتاب الوضوء",
    "bab": "باب الغسل بالصاع ونحوه",
    "text": "عَنْ أَبِي جَعْفَرٍ، قَالَ: قَالَ لِي جَابِرٌ - رضي الله عنه -: (أَتَانِي ابْنُ عَمِّكَ - يُعَرِّضُ بِالْحَسَنِ بْنِ مُحَمَّدٍ ابْنِ الْحَنَفِيَّةِ - قَالَ: كَيْفَ الْغُسْلُ مِنَ الْجَنَابَةِ؟ فَقُلْتُ:) كَانَ النَّبِيُّ ﷺ يَأْخُذُ ثَلاثَةَ أَكُفٍّ وَيُفِيضُهَا عَلَى رَأْسِهِ، ثُمَّ يُفِيضُ عَلَى سَائِرِ جَسَدِهِ. فَقَالَ (لِي) الْحَسَنُ: إِنِّي رَجُلٌ كَثِيرُ الشَّعَرِ. فَقُلْتُ: كَانَ النَّبِيُّ ﷺ أَكْثَرَ مِنْكَ شَعَرًا.<br>(وَفِي رِوَايَةٍ: أَنَّ جَابِرًا - رضي الله عنه - سُئِلَ عَنِ الْغُسْلِ، فَقَالَ: يَكْفِيكَ صَاعٌ. فَقَالَ رَجُلٌ: مَا يَكْفِينِي. فَقَالَ جَابِرٌ: كَانَ يَكْفِي مَنْ هُوَ أَوْفَى مِنْكَ شَعَرًا، وَخَيْرٌ مِنْكَ. ثُمَّ أَمَّنَا فِي ثَوْبٍ)."
  },
  {
    "id": 118,
    "book": "كتاب الوضوء",
    "bab": "باب الغسل بالصاع ونحوه",
    "text": "(وَفِي حَدِيثِ جُبَيْرِ بْنِ مُطْعِمٍ - رضي الله عنه -، قَالَ: قَالَ رَسُولُ اللهِ ﷺ: أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلاثًا. (وَأَشَارَ بِيَدَيْهِ كِلْتَيْهِمَا)).<br>عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كَانَ النَّبِيُّ ﷺ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ دَعَا بِشَيْءٍ نَحْوَ الْحِلابِ، فَأَخَذَ بِكَفِّهِ، فَبَدَأَ بِشِقِّ رَأْسِهِ الأَيْمَنِ، ثُمَّ الأَيْسَرِ، فَقَالَ بِهِمَا عَلَى وَسَطِ رَأْسِهِ."
  },
  {
    "id": 119,
    "book": "كتاب الوضوء",
    "bab": "باب غسل المرأة من الحيض والجنابة",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -: أَنَّ امْرَأَةً سَأَلَتِ النَّبِيَّ ﷺ عَنْ غُسْلِهَا مِنَ الْمَحِيضِ، فَأَمَرَهَا كَيْفَ تَغْتَسِلُ: قَالَ: «خُذِي فِرْصَةً مِنْ مِسْكٍ فَتَطَهَّرِي بِهَا (وَفِي رِوَايَةٍ: ثَلاثًا)». قَالَتْ: كَيْفَ أَتَطَهَّرُ؟ قَالَ: «تَطَهَّرِي بِهَا!» قَالَتْ: كَيْفَ؟ قَالَ: «سُبْحَانَ اللهِ! تَطَهَّرِي!» - وَفِي رِوَايَةٍ: ثُمَّ إِنَّ النَّبِيَّ ﷺ اسْتَحْيَا فَأَعْرَضَ بِوَجْهِهِ -، فَاجْتَبَذْتُهَا إِلَيَّ، فَقُلْتُ: تَتَبَّعِي بِهَا أَثَرَ الدَّمِ."
  },
  {
    "id": 120,
    "book": "كتاب الوضوء",
    "bab": "باب ما جاء في ضفائر المغتسلة من الجنابة",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كُنَّا إِذَا أَصَابَتْ إِحْدَانَا جَنَابَةٌ أَخَذَتْ بِيَدَيْهَا ثَلاثًا فَوْقَ رَأْسِهَا، ثُمَّ تَأْخُذُ بِيَدِهَا عَلَى شِقِّهَا الأَيْمَنِ، وَبِيَدِهَا الأُخْرَى عَلَى شِقِّهَا الأَيْسَرِ."
  },
  {
    "id": 121,
    "book": "كتاب الوضوء",
    "bab": "باب التستر في الغسل عند الناس",
    "text": "عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ - رضي الله عنها -، قَالَتْ: ذَهَبْتُ إِلَى رَسُولِ اللهِ ﷺ عَامَ الْفَتْحِ، فَوَجَدْتُهُ يَغْتَسِلُ، وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ، فَسَلَّمْتُ عَلَيْهِ، فَقَالَ: «مَنْ هَذِهِ؟» فَقُلْتُ: أَنَا أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍ. فَقَالَ: «مَرْحَبًا بِأُمِّ هَانِئٍ». فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ، فَلَمَّا انْصَرَفَ قُلْتُ: يَا رَسُولَ اللهِ، زَعَمَ ابْنُ أُمِّي - وَفِي رِوَايَةٍ: عَلِيٌّ - أَنَّهُ قَاتِلٌ رَجُلاً قَدْ أَجَرْتُهُ: فُلانَ بْنَ هُبَيْرَةَ! فَقَالَ رَسُولُ اللهِ ﷺ: «قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ». قَالَتْ أُمُّ هَانِئٍ: وَذَاكَ ضُحًى.<br>وَفِي رِوَايَةٍ: عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، قَالَ: مَا أَخْبَرَنَا أَحَدٌ أَنَّهُ رَأَى النَّبِيَّ ﷺ صَلَّى الضُّحَى غَيْرَ أُمِّ هَانِئٍ: ذَكَرَتْ أَنَّ النَّبِيَّ ﷺ يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا، فَصَلَّى ثَمَانِيَ رَكَعَاتٍ، فَمَا رَأَيْتُهُ صَلَّى صَلاةً أَخَفَّ مِنْهَا، غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ."
  },
  {
    "id": 122,
    "book": "كتاب الوضوء",
    "bab": "باب من اغتسل عريانًا وحده في الخلوة، ومن تستر فالتستر أفضل",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -، عَنِ النَّبِيِّ ﷺ، قَالَ: «كَانَتْ بَنُو إِسْرَائِيلَ يَغْتَسِلُونَ عُرَاةً، يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ، وَكَانَ مُوسَى يَغْتَسِلُ وَحْدَهُ، فَقَالُوا: وَاللهِ مَا يَمْنَعُ مُوسَى أَنْ يَغْتَسِلَ مَعَنَا إِلا أَنَّهُ آدَرُ، فَذَهَبَ مَرَّةً يَغْتَسِلُ، فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ، فَفَرَّ الْحَجَرُ بِثَوْبِهِ، فَخَرَجَ مُوسَى فِي إِثْرِهِ يَقُولُ: ثَوْبِي يَا حَجَرُ! - وَفِي رِوَايَةٍ: وَقَامَ الْحَجَرُ - حَتَّى نَظَرَتْ بَنُو إِسْرَائِيلَ إِلَى مُوسَى، فَقَالُوا: وَاللهِ مَا بِمُوسَى مِنْ بَأْسٍ. وَأَخَذَ ثَوْبَهُ، فَطَفِقَ بِالْحَجَرِ ضَرْبًا - وَفِي رِوَايَةٍ: بِعَصَاهُ -. فَقَالَ أَبُو هُرَيْرَةَ: وَاللهِ إِنَّهُ لَنَدَبٌ بِالْحَجَرِ سِتَّةٌ أَوْ سَبْعَةٌ ضَرْبًا بِالْحَجَرِ.<br>وَفِي رِوَايَةٍ: كَانَ رَجُلاً حَيِيًّا سِتِّيرًا لا يُرَى مِنْ جِلْدِهِ شَيْءٌ اسْتِحْيَاءً مِنْهُ، فَآذَاهُ مَنْ آذَاهُ مِنْ بَنِي إِسْرَائِيلَ... وَفِيهَا: فَذَلِكَ قَوْلُهُ: ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا لا تَكُونُوا كَالَّذِينَ آذَوْا مُوسَى فَبَرَّأَهُ اللهُ مِمَّا قَالُوا وَكَانَ عِنْدَ اللهِ وَجِيهًا﴾."
  },
  {
    "id": 123,
    "book": "كتاب الوضوء",
    "bab": "باب كراهية التعري في الصلاة وغيرها",
    "text": "عَنْ جَابِرٍ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ كَانَ يَنْقُلُ مَعَهُمُ الْحِجَارَةَ لِلْكَعْبَةِ وَعَلَيْهِ إِزَارُهُ، فَقَالَ لَهُ الْعَبَّاسُ عَمُّهُ: يَا ابْنَ أَخِي! لَوْ حَلَلْتَ إِزَارَكَ فَجَعَلْتَهُ عَلَى مَنْكِبَيْكَ دُونَ الْحِجَارَةِ. قَالَ: فَحَلَّهُ، فَجَعَلَهُ عَلَى مَنْكِبَيْهِ، فَسَقَطَ مَغْشِيًّا عَلَيْهِ - وَفِي رِوَايَةٍ: وَطَمَحَتْ عَيْنَاهُ إِلَى السَّمَاءِ، فَقَالَ: أَرِنِي إِزَارِي. فَشَدَّهُ عَلَيْهِ -، فَمَا رُئِيَ بَعْدَ ذَلِكَ عُرْيَانًا ﷺ."
  },
  {
    "id": 124,
    "book": "كتاب الوضوء",
    "bab": "باب غسل المني وفركه",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كُنْتُ أَغْسِلُ الْجَنَابَةَ مِنْ ثَوْبِ النَّبِيِّ ﷺ، فَيَخْرُجُ إِلَى الصَّلاةِ وَإِنَّ بُقَعَ الْمَاءِ فِي ثَوْبِهِ."
  },
  {
    "id": 125,
    "book": "كتاب الوضوء",
    "bab": "باب غسل الرجل مع امرأته",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كُنْتُ أَغْتَسِلُ أَنَا وَالنَّبِيُّ ﷺ مِنْ إِنَاءٍ وَاحِدٍ - وَفِي رِوَايَةٍ: مِنْ قَدَحٍ يُقَالُ لَهُ: الْفَرَقُ. وَفِي رِوَايَةٍ: تَخْتَلِفُ أَيْدِينَا فِيهِ، كِلانَا جُنُبٌ."
  },
  {
    "id": 126,
    "book": "كتاب الوضوء",
    "bab": "باب الجنب يتوضأ ثم ينام",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كَانَ النَّبِيُّ ﷺ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ (غَسَلَ فَرْجَهُ وَتَوَضَّأَ لِلصَّلاةِ)."
  },
  {
    "id": 127,
    "book": "كتاب الوضوء",
    "bab": "باب نوم الجنب",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما -، قَالَ: ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ - رضي الله عنه - لِرَسُولِ اللهِ ﷺ أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنَ اللَّيْلِ، فَقَالَ لَهُ رَسُولُ اللهِ ﷺ: «تَوَضَّأْ، وَاغْسِلْ ذَكَرَكَ، ثُمَّ نَمْ»."
  },
  {
    "id": 128,
    "book": "كتاب الوضوء",
    "bab": "باب من طاف على نسائه في غسل واحد",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -، قَالَ: كَانَ النَّبِيُّ ﷺ يَدُورُ عَلَى نِسَائِهِ (فِي السَّاعَةِ الْوَاحِدَةِ مِنَ اللَّيْلِ وَالنَّهَارِ، وَهُنَّ إِحْدَى عَشْرَةَ - وَفِي رِوَايَةٍ: بِسَبْعِ نِسْوَةٍ -). قَالَ قَتَادَةُ لأَنَسٍ: أَوَكَانَ يُطِيقُهُ؟ قَالَ: كُنَّا نَتَحَدَّثُ أَنَّهُ أُعْطِيَ قُوَّةَ ثَلاثِينَ."
  },
  {
    "id": 129,
    "book": "كتاب الوضوء",
    "bab": "باب قوله: ﴿فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا﴾",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: خَرَجْنَا مَعَ رَسُولِ اللهِ ﷺ فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ - أَوْ بِذَاتِ الْجَيْشِ - انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللهِ ﷺ عَلَى الْتِمَاسِهِ وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ، فَأَتَى النَّاسُ أَبَا بَكْرٍ - رضي الله عنه -، فَقَالُوا: أَلا تَرَى مَا صَنَعَتْ عَائِشَةُ؟ أَقَامَتْ بِرَسُولِ اللهِ ﷺ وَبِالنَّاسِ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ. فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللهِ ﷺ وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ، فَقَالَ: حَبَسْتِ رَسُولَ اللهِ ﷺ وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ! قَالَتْ: فَعَاتَبَنِي، وَقَالَ مَا شَاءَ اللهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، فَلا يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلا مَكَانُ رَسُولِ اللهِ ﷺ عَلَى فَخِذِي، فَنَامَ رَسُولُ اللهِ ﷺ حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ؛ فَأَنْزَلَ اللهُ آيَةَ التَّيَمُّمِ: ﴿فَتَيَمَّمُوا﴾، فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ: مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ.<br>وَفِي رِوَايَةٍ: جَزَاكِ اللهُ خَيْرًا، فَوَاللهِ مَا نَزَلَ بِكِ أَمْرٌ تَكْرَهِينَهُ إِلا جَعَلَ اللهُ ذَلِكَ لَكِ وَلِلْمُسْلِمِينَ فِيهِ خَيْرًا -. فَقَالَتْ عَائِشَةُ: فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ، فَوَجَدْنَا الْعِقْدَ تَحْتَهُ.<br>وَفِي رِوَايَةٍ: أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ - رضي الله عنهما - قِلادَةً، فَهَلَكَتْ، فَبَعَثَ رَسُولُ اللهِ ﷺ رَجُلاً، فَوَجَدَهَا، فَأَدْرَكَتْهُمُ الصَّلاةُ وَلَيْسَ مَعَهُمْ مَاءٌ، فَصَلَّوْا، فَشَكَوْا ذَلِكَ إِلَى رَسُولِ اللهِ ﷺ، فَأَنْزَلَ اللهُ آيَةَ التَّيَمُّمِ."
  },
  {
    "id": 130,
    "book": "كتاب الوضوء",
    "bab": "باب التيمم ضربة",
    "text": "عَنْ شَقِيقٍ، قَالَ: كُنْتُ جَالِسًا مَعَ عَبْدِ اللهِ وَأَبِي مُوسَى الأَشْعَرِيِّ - رضي الله عنهما -، فَقَالَ لَهُ أَبُو مُوسَى: لَوْ أَنَّ رَجُلاً أَجْنَبَ فَلَمْ يَجِدِ الْمَاءَ شَهْرًا، أَمَا كَانَ يَتَيَمَّمُ وَيُصَلِّي؟ فَكَيْفَ تَصْنَعُونَ بِهَذِهِ الآيَةِ فِي سُورَةِ الْمَائِدَةِ: ﴿فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا﴾؟ فَقَالَ عَبْدُ اللهِ: لَوْ رُخِّصَ لَهُمْ فِي هَذَا لأَوْشَكُوا إِذَا بَرَدَ عَلَيْهِمُ الْمَاءُ أَنْ يَتَيَمَّمُوا الصَّعِيدَ! (وَفِي رِوَايَةٍ: لا يَصَلِّي حَتَّى يَجِدَ الْمَاءَ)، (قُلْتُ: وَإِنَّمَا كَرِهْتُمْ هَذَا لِذَا؟ قَالَ: نَعَمْ). فَقَالَ أَبُو مُوسَى: أَلَمْ تَسْمَعْ قَوْلَ عَمَّارٍ لِعُمَرَ: بَعَثَنِي رَسُولُ اللهِ ﷺ فِي حَاجَةٍ - وَفِي رِوَايَةٍ: أَنَا وَأَنْتَ -. فَأَجْنَبْتُ، فَلَمْ أَجِدِ الْمَاءَ، فَتَمَرَّغْتُ فِي الصَّعِيدِ كَمَا تَمَرَّغُ الدَّابَّةُ، فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ ﷺ، فَقَالَ: «إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَصْنَعَ هَكَذَا». فَضَرَبَ بِكَفِّهِ ضَرْبَةً عَلَى الأَرْضِ، ثُمَّ نَفَضَهَا، ثُمَّ مَسَحَ بِهَا ظَهَرَ كَفِّهِ بِشِمَالِهِ، أَوْ ظَهَرَ شِمَالِهِ بِكَفِّهِ، ثُمَّ مَسَحَ بِهِمَا وَجْهَهُ؟ فَقَالَ عَبْدُ اللهِ: أَفَلَمْ تَرَ عُمَرَ لَمْ يَقْنَعْ بِقَوْلِ عَمَّارٍ؟<br>● (وَفِي حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى - رضي الله عنه - عَنْ عَمَّارٍ - رضي الله عنه -: فَضَرَبَ النَّبِيُّ ﷺ بِكَفَّيْهِ الأَرْضَ، وَنَفَخَ فِيهِمَا)."
  },
  {
    "id": 131,
    "book": "كتاب الوضوء",
    "bab": "باب التيمم بالجدار",
    "text": "عَنْ أَبِي الْجُهَيْمِ - رضي الله عنه -، قَالَ: أَقْبَلَ النَّبِيُّ ﷺ مِنْ نَحْوِ بِئْرِ جَمَلٍ، فَلَقِيَهُ رَجُلٌ فَسَلَّمَ عَلَيْهِ، فَلَمْ يَرُدَّ عَلَيْهِ النَّبِيُّ ﷺ، حَتَّى أَقْبَلَ عَلَى الْجِدَارِ فَمَسَحَ بِوَجْهِهِ وَيَدَيْهِ، ثُمَّ رَدَّ عَلَيْهِ السَّلامَ."
  },
  {
    "id": 132,
    "book": "كتاب الوضوء",
    "bab": "بابٌ: الجنب يخرج ويمشي في السوق وغيره",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: لَقِيَنِي رَسُولُ اللهِ ﷺ وَأَنَا جُنُبٌ، فَأَخَذَ بِيَدِي، فَمَشَيْتُ مَعَهُ حَتَّى قَعَدَ، فَانْسَلَلْتُ، فَأَتَيْتُ الرَّحْلَ فَاغْتَسَلْتُ، ثُمَّ جِئْتُ وَهُوَ قَاعِدٌ، فَقَالَ: «أَيْنَ كُنْتَ يَا أَبَا هِرٍّ؟» فَقُلْتُ لَهُ - وَفِي رِوَايَةٍ: كُنْتُ جُنُبًا، فَكَرِهْتُ أَنْ أُجَالِسَكَ وَأَنَا عَلَى غَيْرِ طَهَارَةٍ -، فَقَالَ: «سُبْحَانَ اللهِ يَا أَبَا هِرٍّ! إِنَّ الْمُؤْمِنَ لا يَنْجُسُ»."
  },
  {
    "id": 133,
    "book": "كتاب الوضوء",
    "bab": "باب من أجاز قراءة القرآن للجنب",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها - (مُعَلَّقًا)، قَالَتْ: كَانَ النَّبِيُّ ﷺ يَذْكُرُ اللهَ عَلَى كُلِّ أَحْيَانِهِ."
  },
  {
    "id": 134,
    "book": "كتاب الحيض",
    "bab": "باب غسل دم المحيض",
    "text": "عَنْ أَسْمَاءَ - رضي الله عنها -، قَالَتْ: جَاءَتِ امْرَأَةٌ إِلَى النَّبِيِّ ﷺ، فَقَالَتْ: أَرَأَيْتَ إِحْدَانَا تَحِيضُ فِي الثَّوْبِ، كَيْفَ تَصْنَعُ؟ قَالَ: «تَحُتُّهُ، ثُمَّ تَقْرُصُهُ بِالْمَاءِ، وَتَنْضَحُهُ، وَتُصَلِّي فِيهِ».<br>● (وَفِي حَدِيثِ عَائِشَةَ - رضي الله عنها -: مَا كَانَ لإِحْدَانَا إِلا ثَوْبٌ وَاحِدٌ تَحِيضُ فِيهِ، فَإِذَا أَصَابَهُ شَيْءٌ مِنْ دَمٍ قَالَتْ بِرِيقِهَا فَقَصَعَتْهُ بِظُفْرِهَا)."
  },
  {
    "id": 135,
    "book": "كتاب الحيض",
    "bab": "باب الحائض تُرجل المعتكف",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كَانَ رَسُولُ اللهِ ﷺ لَيُدْخِلُ عَلَيَّ رَأْسَهُ وَهُوَ فِي الْمَسْجِدِ، فَأُرَجِّلُهُ - وَفِي رِوَايَةٍ: فَأَغْسِلُهُ وَأَنَا حَائِضٌ -، وَكَانَ لا يَدْخُلُ الْبَيْتَ إِلا لِحَاجَةٍ إِذَا كَانَ مُعْتَكِفًا."
  },
  {
    "id": 136,
    "book": "كتاب الحيض",
    "bab": "باب قراءة الرجل في حجر امرأته وهي حائض",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -: أَنَّ النَّبِيَّ ﷺ كَانَ يَتَّكِئُ فِي حِجْرِي وَأَنَا حَائِضٌ، ثُمَّ يَقْرَأُ الْقُرْآنَ."
  },
  {
    "id": 137,
    "book": "كتاب الحيض",
    "bab": "باب من سمى النفاس حيضًا والحيض نفاسًا",
    "text": "عَنْ أُمِّ سَلَمَةَ - رضي الله عنها -، قَالَتْ: بَيْنَمَا أَنَا مَعَ رَسُولِ اللهِ ﷺ فِي الْخَمِيلَةِ إِذْ حِضْتُ، فَانْسَلَلْتُ، فَأَخَذْتُ ثِيَابَ حِيضَتِي، فَقَالَ: «مَا لَكِ؟! أَنَفِسْتِ؟» قُلْتُ: نَعَمْ. فَدَخَلْتُ مَعَهُ فِي الْخَمِيلَةِ. وَكَانَتْ هِيَ وَرَسُولُ اللهِ ﷺ يَغْتَسِلانِ مِنْ إِنَاءٍ وَاحِدٍ. وَفِي رِوَايَةٍ: مِنَ الْجَنَابَةِ."
  },
  {
    "id": 138,
    "book": "كتاب الحيض",
    "bab": "باب مباشرة الحائض",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: كَانَتْ إِحْدَانَا إِذَا كَانَتْ حَائِضًا، فَأَرَادَ رَسُولُ اللهِ ﷺ أَنْ يُبَاشِرَهَا؛ أَمَرَهَا أَنْ تَتَّزِرَ فِي فَوْرِ حَيْضَتِهَا، ثُمَّ يُبَاشِرَهَا، وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ النَّبِيُّ ﷺ يَمْلِكُ إِرْبَهُ؟."
  },
  {
    "id": 139,
    "book": "كتاب الحيض",
    "bab": "باب الاستحاضة",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -، قَالَتْ: جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ ﷺ، فَقَالَتْ: يَا رَسُولَ اللهِ! إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلا أَطْهُرُ، أَفَأَدَعُ الصَّلاةَ؟ فَقَالَ رَسُولُ اللهِ ﷺ: «لا، إِنَّمَا ذَلِكَ عِرْقٌ وَلَيْسَ بِحَيْضٍ، فَإِذَا أَقْبَلَتْ حَيْضَتُكِ فَدَعِي الصَّلاةَ [وَفِي رِوَايَةٍ: قَدْرَ الأَيَّامِ الَّتِي كُنْتِ تَحِيضِينَ فِيهَا]، وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ [وَفِي رِوَايَةٍ: فَاغْتَسِلِي]، ثُمَّ صَلِّي، (ثُمَّ تَوَضَّئِي لِكُلِّ صَلاةٍ، حَتَّى يَجِيءَ ذَلِكَ الْوَقْتُ)."
  },
  {
    "id": 140,
    "book": "كتاب الحيض",
    "bab": "باب الاستحاضة",
    "text": "عَنْ عَائِشَةَ - رضي الله عنها -: أَنَّ أُمَّ حَبِيبَةَ اسْتُحِيضَتْ سَبْعَ سِنِينَ، فَسَأَلَتْ رَسُولَ اللهِ ﷺ عَنْ ذَلِكَ، فَأَمَرَهَا أَنْ تَغْتَسِلَ، فَقَالَ: «هَذَا عِرْقٌ». فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلاةٍ."
  },
  {
    "id": 141,
    "book": "كتاب الحيض",
    "bab": "بابٌ: لا تقضي الحائض الصلاة",
    "text": "عَنْ مُعَاذَةَ: أَنَّ امْرَأَةً قَالَتْ لِعَائِشَةَ - رضي الله عنها -: أَتَجْزِي إِحْدَانَا صَلاتَهَا إِذَا طَهُرَتْ؟ فَقَالَتْ: أَحَرُورِيَّةٌ أَنْتِ؟ كُنَّا نَحِيضُ مَعَ النَّبِيِّ ﷺ فَلا يَأْمُرُنَا بِهِ."
  },
  {
    "id": 142,
    "book": "كتاب خصال الفطرة",
    "bab": "بابٌ: خمس من الفطرة",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه - رِوَايَةً: «الْفِطْرَةُ خَمْسٌ - أَوْ: خَمْسٌ مِنَ الْفِطْرَةِ -: الْخِتَانُ، وَالاسْتِحْدَادُ، وَنَتْفُ الإِبْطِ، وَتَقْلِيمُ الأَظْفَارِ، وَقَصُّ الشَّارِبِ»."
  },
  {
    "id": 143,
    "book": "كتاب خصال الفطرة",
    "bab": "باب المبالغة في السواك",
    "text": "عَنْ أَبِي مُوسَى - رضي الله عنه -، قَالَ: أَتَيْتُ النَّبِيَّ ﷺ فَوَجَدْتُهُ يَسْتَنُّ بِسِوَاكٍ بِيَدِهِ، (يَقُولُ: أُعْ أُعْ. وَالسِّوَاكُ فِي فِيهِ كَأَنَّهُ يَتَهَوَّعُ)."
  },
  {
    "id": 144,
    "book": "كتاب خصال الفطرة",
    "bab": "باب السواك عند الصلاة",
    "text": "عَنْ أَبِي هُرَيْرَةَ - رضي الله عنه -: أَنَّ رَسُولَ اللهِ ﷺ قَالَ: «لَوْلا أَنْ أَشُقَّ عَلَى أُمَّتِي - أَوْ: عَلَى النَّاسِ - لأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلاةٍ»."
  },
  {
    "id": 145,
    "book": "كتاب خصال الفطرة",
    "bab": "باب السواك عند الصلاة",
    "text": "● وَفِي حَدِيثِ أَنَسٍ - رضي الله عنه -: «أُمِرْتُ عَلَيْكُمْ فِي السِّوَاكِ».<br>عَنْ حُذَيْفَةَ - رضي الله عنه -، قَالَ: كَانَ النَّبِيُّ ﷺ إِذَا قَامَ مِنَ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ."
  },
  {
    "id": 146,
    "book": "كتاب خصال الفطرة",
    "bab": "باب رؤيا النبي ﷺ السواك في المنام",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما - (مُعَلَّقًا): أَنَّ النَّبِيَّ ﷺ قَالَ: «أَرَانِي أَتَسَوَّكُ بِسِوَاكٍ، فَجَاءَنِي رَجُلانِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ، فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا، فَقِيلَ لِي: كَبِّرْ. فَدَفَعْتُهُ إِلَى الأَكْبَرِ مِنْهُمَا»."
  },
  {
    "id": 147,
    "book": "كتاب خصال الفطرة",
    "bab": "باب إعفاء اللحى",
    "text": "عَنِ ابْنِ عُمَرَ - رضي الله عنهما -، عَنِ النَّبِيِّ ﷺ، قَالَ: «خَالِفُوا الْمُشْرِكِينَ، (وَفِّرُوا) اللِّحَى، وَأَحْفُوا الشَّوَارِبَ - وَفِي رِوَايَةٍ: (أَنْهِكُوا) الشَّوَارِبَ، وَأَعْفُوا اللِّحَى -». وَكَانَ ابْنُ عُمَرَ إِذَا حَجَّ أَوِ اعْتَمَرَ قَبَضَ عَلَى لِحْيَتِهِ، فَمَا فَضَلَ أَخَذَهُ."
  },
  {
    "id": 148,
    "book": "كتاب خصال الفطرة",
    "bab": "باب صب الماء على البول في المسجد",
    "text": "عَنْ أَنَسٍ - رضي الله عنه -: أَنَّ أَعْرَابِيًّا بَالَ فِي الْمَسْجِدِ، فَقَامُوا إِلَيْهِ، فَقَالَ رَسُولُ اللهِ ﷺ: «لا تُزْرِمُوهُ». ثُمَّ دَعَا بِدَلْوٍ مِنْ مَاءٍ فَصُبَّ عَلَيْهِ.<br>● (وَفِي حَدِيثِ أَبِي هُرَيْرَةَ - رضي الله عنه -: دَعُوهُ، وَهَرِيقُوا عَلَى بَوْلِهِ سَجْلاً مِنْ مَاءٍ، أَوْ: ذَنُوبًا مِنْ مَاءٍ؛ فَإِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ وَلَمْ تُبْعَثُوا مُعَسِّرِينَ)."
  },
  {
    "id": 149,
    "book": "كتاب خصال الفطرة",
    "bab": "باب بول الصبيان",
    "text": "عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ - رضي الله عنها -: أَنَّهَا أَتَتْ بِابْنٍ لَهَا صَغِيرٍ لَمْ يَأْكُلِ الطَّعَامَ إِلَى رَسُولِ اللهِ ﷺ، فَأَجْلَسَهُ رَسُولُ اللهِ ﷺ فِي حِجْرِهِ، فَبَالَ عَلَى ثَوْبِهِ، فَدَعَا بِمَاءٍ فَنَضَحَهُ، وَلَمْ يَغْسِلْهُ.<br>● وَفِي حَدِيثِ عَائِشَةَ - رضي الله عنها -: كَانَ النَّبِيُّ ﷺ يُؤْتَى بِالصِّبْيَانِ فَيُدْعُو لَهُمْ، فَأُتِيَ بِصَبِيٍّ - وَفِي رِوَايَةٍ: يُحَنِّكُهُ - ..."
  }
]